; ModuleID = '543bs8w8n6vsg0rr'
source_filename = "543bs8w8n6vsg0rr"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_enums.rs:73:1: 85:2]" = type {}
%"[closure@src/test_enums.rs:88:1: 100:2]" = type {}
%"[closure@src/test_enums.rs:37:1: 40:2]" = type {}
%"[closure@src/test_enums.rs:58:1: 70:2]" = type {}
%"[closure@src/test_enums.rs:103:1: 115:2]" = type {}
%"[closure@src/test_enums.rs:118:1: 130:2]" = type {}
%"[closure@src/test_enums.rs:43:1: 55:2]" = type {}
%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&[i32; 6] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 6] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "358d88facf61ead4530386abd50fe857")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 6]", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 6, lowerBound: 0)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "<&[i32; 1] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 1] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !49, vtableHolder: !54, templateParams: !23, identifier: "8c376f87b4817cf69c8f30bcf302b960")
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !48, file: !2, baseType: !6, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !48, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !48, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 1]", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, align: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1, lowerBound: 0)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "<&[i32; 4] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 4] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !61, vtableHolder: !66, templateParams: !23, identifier: "a95e8e1432549f1820c20f0bc70265a8")
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !60, file: !2, baseType: !6, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !60, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !60, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 4]", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, align: 32, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 4, lowerBound: 0)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "<&[i32; 10] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !72, isLocal: true, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 10] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !73, vtableHolder: !78, templateParams: !23, identifier: "52e8b284be8e9634c9ba80284e386ef6")
!73 = !{!74, !75, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !72, file: !2, baseType: !6, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !72, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !72, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !72, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 10]", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 320, align: 32, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 10, lowerBound: 0)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "<&[i32; 7] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 7] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !85, vtableHolder: !90, templateParams: !23, identifier: "8877d283b7cf888f6fe2deb151047e66")
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !84, file: !2, baseType: !6, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 7]", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 224, align: 32, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 7, lowerBound: 0)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "rust_e", linkageName: "_ZN10enum_tests8top_enum6rust_e17h17a8b40d99714f2cE", scope: !96, file: !98, line: 13, type: !99, isLocal: true, isDefinition: true, align: 32)
!96 = !DINamespace(name: "top_enum", scope: !97)
!97 = !DINamespace(name: "enum_tests", scope: null)
!98 = !DIFile(filename: "src/top_enum.rs", directory: "/home/calvin/git/c2rust/tests/enums", checksumkind: CSK_MD5, checksum: "869ed46fc2a79567b7dbe1251524aaac")
!99 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!100 = !{i32 7, !"PIC Level", i32 2}
!101 = !{i32 7, !"PIE Level", i32 2}
!102 = !{i32 2, !"RtLibUseGOT", i32 1}
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !106, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !125)
!106 = !DIFile(filename: "src/lib.rs/@/543bs8w8n6vsg0rr", directory: "/home/calvin/git/c2rust/tests/enums")
!107 = !{!108, !119}
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !109, file: !2, baseType: !113, size: 8, align: 8, flags: DIFlagEnumClass, elements: !114)
!109 = !DINamespace(name: "v1", scope: !110)
!110 = !DINamespace(name: "rt", scope: !111)
!111 = !DINamespace(name: "fmt", scope: !112)
!112 = !DINamespace(name: "core", scope: null)
!113 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!114 = !{!115, !116, !117, !118}
!115 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !120, file: !2, baseType: !113, size: 8, align: 8, flags: DIFlagEnumClass, elements: !121)
!120 = !DINamespace(name: "panicking", scope: !112)
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!125 = !{!0, !24, !34, !46, !58, !70, !82, !94}
!126 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h75bcc83fddf6bf54E", scope: !128, file: !127, line: 118, type: !130, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !136, retainedNodes: !132)
!127 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!128 = !DINamespace(name: "backtrace", scope: !129)
!129 = !DINamespace(name: "sys_common", scope: !17)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !20}
!132 = !{!133, !134}
!133 = !DILocalVariable(name: "f", arg: 1, scope: !126, file: !127, line: 118, type: !20)
!134 = !DILocalVariable(name: "result", scope: !135, file: !127, line: 122, type: !7, align: 1)
!135 = distinct !DILexicalBlock(scope: !126, file: !127, line: 122, column: 5)
!136 = !{!137, !138}
!137 = !DITemplateTypeParameter(name: "F", type: !20)
!138 = !DITemplateTypeParameter(name: "T", type: !7)
!139 = !DILocation(line: 122, column: 9, scope: !135)
!140 = !DILocation(line: 118, column: 43, scope: !126)
!141 = !DILocalVariable(name: "dummy", scope: !142, file: !127, line: 125, type: !7, align: 1)
!142 = !DILexicalBlockFile(scope: !143, file: !127, discriminator: 0)
!143 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hcdd205405cc2a328E", scope: !145, file: !144, line: 225, type: !146, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !149, retainedNodes: !148)
!144 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!145 = !DINamespace(name: "hint", scope: !112)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !7}
!148 = !{!141}
!149 = !{!138}
!150 = !DILocation(line: 125, column: 5, scope: !142, inlinedAt: !151)
!151 = !DILocation(line: 125, column: 5, scope: !135)
!152 = !DILocation(line: 122, column: 18, scope: !126)
!153 = !{i32 3352417}
!154 = !DILocation(line: 128, column: 2, scope: !126)
!155 = !DILocation(line: 128, column: 1, scope: !126)
!156 = !DILocation(line: 118, column: 1, scope: !126)
!157 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h24c25c811e2636c7E", scope: !16, file: !158, line: 139, type: !159, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !149, retainedNodes: !164)
!158 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !20, !161, !162}
!161 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !{!165, !166, !167, !168}
!165 = !DILocalVariable(name: "main", arg: 1, scope: !157, file: !158, line: 140, type: !20)
!166 = !DILocalVariable(name: "argc", arg: 2, scope: !157, file: !158, line: 141, type: !161)
!167 = !DILocalVariable(name: "argv", arg: 3, scope: !157, file: !158, line: 142, type: !162)
!168 = !DILocalVariable(name: "v", scope: !169, file: !158, line: 144, type: !161, align: 8)
!169 = distinct !DILexicalBlock(scope: !157, file: !158, line: 144, column: 5)
!170 = !DILocation(line: 140, column: 5, scope: !157)
!171 = !DILocation(line: 141, column: 5, scope: !157)
!172 = !DILocation(line: 142, column: 5, scope: !157)
!173 = !DILocation(line: 145, column: 10, scope: !157)
!174 = !DILocation(line: 145, column: 9, scope: !157)
!175 = !DILocation(line: 144, column: 17, scope: !157)
!176 = !DILocation(line: 144, column: 12, scope: !157)
!177 = !DILocation(line: 144, column: 12, scope: !169)
!178 = !DILocation(line: 150, column: 2, scope: !157)
!179 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h52c5ae235102c8d1E", scope: !15, file: !158, line: 145, type: !180, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !149, retainedNodes: !183)
!180 = !DISubroutineType(types: !181)
!181 = !{!33, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !{!184}
!184 = !DILocalVariable(name: "main", scope: !179, file: !158, line: 140, type: !20, align: 8)
!185 = !{i64 8}
!186 = !DILocation(line: 140, column: 5, scope: !179)
!187 = !DILocalVariable(name: "self", scope: !188, file: !158, line: 145, type: !191, align: 1)
!188 = !DILexicalBlockFile(scope: !189, file: !158, discriminator: 0)
!189 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h5ced6e4f22c19521E", scope: !191, file: !190, line: 1808, type: !202, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !23, retainedNodes: !204)
!190 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !192, file: !2, size: 8, align: 8, elements: !193, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!192 = !DINamespace(name: "process", scope: !17)
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !2, baseType: !195, size: 8, align: 8)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !196, file: !2, size: 8, align: 8, elements: !200, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!196 = !DINamespace(name: "process_common", scope: !197)
!197 = !DINamespace(name: "process", scope: !198)
!198 = !DINamespace(name: "unix", scope: !199)
!199 = !DINamespace(name: "sys", scope: !17)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !195, file: !2, baseType: !113, size: 8, align: 8)
!202 = !DISubroutineType(types: !203)
!203 = !{!33, !191}
!204 = !{!187}
!205 = !DILocation(line: 145, column: 18, scope: !188, inlinedAt: !206)
!206 = !DILocation(line: 145, column: 18, scope: !179)
!207 = !DILocation(line: 145, column: 77, scope: !179)
!208 = !DILocalVariable(name: "self", scope: !209, file: !158, line: 145, type: !214, align: 8)
!209 = !DILexicalBlockFile(scope: !210, file: !158, discriminator: 0)
!210 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217hbaff3acac5e7545fE", scope: !195, file: !211, line: 485, type: !212, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !23, retainedNodes: !215)
!211 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!212 = !DISubroutineType(types: !213)
!213 = !{!33, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !195, size: 64, align: 64, dwarfAddressSpace: 0)
!215 = !{!208}
!216 = !DILocation(line: 145, column: 18, scope: !209, inlinedAt: !217)
!217 = !DILocation(line: 1809, column: 9, scope: !189, inlinedAt: !206)
!218 = !DILocation(line: 145, column: 17, scope: !179)
!219 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h384c4c39141f8cfdE", scope: !221, file: !220, line: 2361, type: !222, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !282)
!220 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!221 = !DINamespace(name: "{impl#59}", scope: !111)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !241, !247}
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !225, file: !2, size: 8, align: 8, elements: !226, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!225 = !DINamespace(name: "result", scope: !112)
!226 = !{!227}
!227 = !DICompositeType(tag: DW_TAG_variant_part, scope: !224, file: !2, size: 8, align: 8, elements: !228, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !240)
!228 = !{!229, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !227, file: !2, baseType: !230, size: 8, align: 8, extraData: i64 0)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !224, file: !2, size: 8, align: 8, elements: !231, templateParams: !233, identifier: "cea751326735c343faf647063a65ad14")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !230, file: !2, baseType: !7, align: 8, offset: 8)
!233 = !{!138, !234}
!234 = !DITemplateTypeParameter(name: "E", type: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !111, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !227, file: !2, baseType: !237, size: 8, align: 8, extraData: i64 1)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !224, file: !2, size: 8, align: 8, elements: !238, templateParams: !233, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !237, file: !2, baseType: !235, align: 8, offset: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !2, baseType: !113, size: 8, align: 8, flags: DIFlagArtificial)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !242, size: 64, align: 64, dwarfAddressSpace: 0)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !243, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!243 = !{!244, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !242, file: !2, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !242, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !248, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !111, file: !2, size: 512, align: 64, elements: !249, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!249 = !{!250, !251, !253, !254, !270, !271}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !2, baseType: !99, size: 32, align: 32, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !248, file: !2, baseType: !252, size: 32, align: 32, offset: 416)
!252 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !248, file: !2, baseType: !108, size: 8, align: 8, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !248, file: !2, baseType: !255, size: 128, align: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !256, file: !2, size: 128, align: 64, elements: !257, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!256 = !DINamespace(name: "option", scope: !112)
!257 = !{!258}
!258 = !DICompositeType(tag: DW_TAG_variant_part, scope: !255, file: !2, size: 128, align: 64, elements: !259, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !268)
!259 = !{!260, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !258, file: !2, baseType: !261, size: 128, align: 64, extraData: i64 0)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !255, file: !2, size: 128, align: 64, elements: !23, templateParams: !262, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!262 = !{!263}
!263 = !DITemplateTypeParameter(name: "T", type: !9)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !258, file: !2, baseType: !265, size: 128, align: 64, extraData: i64 1)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !255, file: !2, size: 128, align: 64, elements: !266, templateParams: !262, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!266 = !{!267}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !265, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !2, baseType: !269, size: 64, align: 64, flags: DIFlagArtificial)
!269 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !248, file: !2, baseType: !255, size: 128, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !248, file: !2, baseType: !272, size: 128, align: 64, offset: 256)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !273, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!273 = !{!274, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !272, file: !2, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64, dwarfAddressSpace: 0)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !272, file: !2, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !279, size: 64, align: 64, dwarfAddressSpace: 0)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 3, lowerBound: 0)
!282 = !{!283, !284}
!283 = !DILocalVariable(name: "self", arg: 1, scope: !219, file: !220, line: 2361, type: !241)
!284 = !DILocalVariable(name: "f", arg: 2, scope: !219, file: !220, line: 2361, type: !247)
!285 = !{!286}
!286 = !DITemplateTypeParameter(name: "T", type: !33)
!287 = !DILocation(line: 2361, column: 20, scope: !219)
!288 = !DILocation(line: 2361, column: 27, scope: !219)
!289 = !DILocation(line: 2361, column: 71, scope: !219)
!290 = !{i64 4}
!291 = !DILocation(line: 2361, column: 62, scope: !219)
!292 = !DILocation(line: 2361, column: 84, scope: !219)
!293 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h54a4743f53e7e3feE", scope: !221, file: !220, line: 2361, type: !294, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !297)
!294 = !DISubroutineType(types: !295)
!295 = !{!224, !296, !247}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !{!298, !299}
!298 = !DILocalVariable(name: "self", arg: 1, scope: !293, file: !220, line: 2361, type: !296)
!299 = !DILocalVariable(name: "f", arg: 2, scope: !293, file: !220, line: 2361, type: !247)
!300 = !DILocation(line: 2361, column: 20, scope: !293)
!301 = !DILocation(line: 2361, column: 27, scope: !293)
!302 = !DILocation(line: 2361, column: 71, scope: !293)
!303 = !DILocation(line: 2361, column: 62, scope: !293)
!304 = !DILocation(line: 2361, column: 84, scope: !293)
!305 = distinct !DISubprogram(name: "fmt<[i32; 6]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h712c4898028879caE", scope: !221, file: !220, line: 2361, type: !306, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !312, retainedNodes: !309)
!306 = !DISubroutineType(types: !307)
!307 = !{!224, !308, !247}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 6]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !{!310, !311}
!310 = !DILocalVariable(name: "self", arg: 1, scope: !305, file: !220, line: 2361, type: !308)
!311 = !DILocalVariable(name: "f", arg: 2, scope: !305, file: !220, line: 2361, type: !247)
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "T", type: !43)
!314 = !DILocation(line: 2361, column: 20, scope: !305)
!315 = !DILocation(line: 2361, column: 27, scope: !305)
!316 = !DILocation(line: 2361, column: 71, scope: !305)
!317 = !DILocation(line: 2361, column: 62, scope: !305)
!318 = !DILocation(line: 2361, column: 84, scope: !305)
!319 = distinct !DISubprogram(name: "fmt<[i32; 7]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h73b62204be0d9aa4E", scope: !221, file: !220, line: 2361, type: !320, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !326, retainedNodes: !323)
!320 = !DISubroutineType(types: !321)
!321 = !{!224, !322, !247}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 7]", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = !{!324, !325}
!324 = !DILocalVariable(name: "self", arg: 1, scope: !319, file: !220, line: 2361, type: !322)
!325 = !DILocalVariable(name: "f", arg: 2, scope: !319, file: !220, line: 2361, type: !247)
!326 = !{!327}
!327 = !DITemplateTypeParameter(name: "T", type: !91)
!328 = !DILocation(line: 2361, column: 20, scope: !319)
!329 = !DILocation(line: 2361, column: 27, scope: !319)
!330 = !DILocation(line: 2361, column: 71, scope: !319)
!331 = !DILocation(line: 2361, column: 62, scope: !319)
!332 = !DILocation(line: 2361, column: 84, scope: !319)
!333 = distinct !DISubprogram(name: "fmt<[i32; 4]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h92a1bed0018681f5E", scope: !221, file: !220, line: 2361, type: !334, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !340, retainedNodes: !337)
!334 = !DISubroutineType(types: !335)
!335 = !{!224, !336, !247}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 4]", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !{!338, !339}
!338 = !DILocalVariable(name: "self", arg: 1, scope: !333, file: !220, line: 2361, type: !336)
!339 = !DILocalVariable(name: "f", arg: 2, scope: !333, file: !220, line: 2361, type: !247)
!340 = !{!341}
!341 = !DITemplateTypeParameter(name: "T", type: !67)
!342 = !DILocation(line: 2361, column: 20, scope: !333)
!343 = !DILocation(line: 2361, column: 27, scope: !333)
!344 = !DILocation(line: 2361, column: 71, scope: !333)
!345 = !DILocation(line: 2361, column: 62, scope: !333)
!346 = !DILocation(line: 2361, column: 84, scope: !333)
!347 = distinct !DISubprogram(name: "fmt<[i32; 1]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hc03f1b85accb5763E", scope: !221, file: !220, line: 2361, type: !348, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !354, retainedNodes: !351)
!348 = !DISubroutineType(types: !349)
!349 = !{!224, !350, !247}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 1]", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!351 = !{!352, !353}
!352 = !DILocalVariable(name: "self", arg: 1, scope: !347, file: !220, line: 2361, type: !350)
!353 = !DILocalVariable(name: "f", arg: 2, scope: !347, file: !220, line: 2361, type: !247)
!354 = !{!355}
!355 = !DITemplateTypeParameter(name: "T", type: !55)
!356 = !DILocation(line: 2361, column: 20, scope: !347)
!357 = !DILocation(line: 2361, column: 27, scope: !347)
!358 = !DILocation(line: 2361, column: 71, scope: !347)
!359 = !DILocation(line: 2361, column: 62, scope: !347)
!360 = !DILocation(line: 2361, column: 84, scope: !347)
!361 = distinct !DISubprogram(name: "fmt<[i32; 10]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hecf0f57663ba443eE", scope: !221, file: !220, line: 2361, type: !362, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !368, retainedNodes: !365)
!362 = !DISubroutineType(types: !363)
!363 = !{!224, !364, !247}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 10]", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !{!366, !367}
!366 = !DILocalVariable(name: "self", arg: 1, scope: !361, file: !220, line: 2361, type: !364)
!367 = !DILocalVariable(name: "f", arg: 2, scope: !361, file: !220, line: 2361, type: !247)
!368 = !{!369}
!369 = !DITemplateTypeParameter(name: "T", type: !79)
!370 = !DILocation(line: 2361, column: 20, scope: !361)
!371 = !DILocation(line: 2361, column: 27, scope: !361)
!372 = !DILocation(line: 2361, column: 71, scope: !361)
!373 = !DILocation(line: 2361, column: 62, scope: !361)
!374 = !DILocation(line: 2361, column: 84, scope: !361)
!375 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17h61a7f8632c1878acE", scope: !376, file: !220, line: 2586, type: !377, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !379)
!376 = !DINamespace(name: "{impl#26}", scope: !111)
!377 = !DISubroutineType(types: !378)
!378 = !{!224, !242, !247}
!379 = !{!380, !381}
!380 = !DILocalVariable(name: "self", arg: 1, scope: !375, file: !220, line: 2586, type: !242)
!381 = !DILocalVariable(name: "f", arg: 2, scope: !375, file: !220, line: 2586, type: !247)
!382 = !DILocation(line: 2586, column: 12, scope: !375)
!383 = !DILocation(line: 2586, column: 19, scope: !375)
!384 = !DILocation(line: 2587, column: 9, scope: !375)
!385 = !DILocation(line: 2587, column: 32, scope: !375)
!386 = !DILocalVariable(name: "self", scope: !387, file: !220, line: 2587, type: !242, align: 8)
!387 = !DILexicalBlockFile(scope: !388, file: !220, discriminator: 0)
!388 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17h8c9e6202202c0c62E", scope: !390, file: !389, line: 734, type: !392, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !410)
!389 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!390 = !DINamespace(name: "{impl#0}", scope: !391)
!391 = !DINamespace(name: "slice", scope: !112)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !242}
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !395, file: !2, size: 128, align: 64, elements: !396, templateParams: !285, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!395 = !DINamespace(name: "iter", scope: !391)
!396 = !{!397, !404, !405}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !394, file: !2, baseType: !398, size: 64, align: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !399, file: !2, size: 64, align: 64, elements: !401, templateParams: !285, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!399 = !DINamespace(name: "non_null", scope: !400)
!400 = !DINamespace(name: "ptr", scope: !112)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !398, file: !2, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !394, file: !2, baseType: !403, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !394, file: !2, baseType: !406, align: 8)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !407, file: !2, align: 8, elements: !23, templateParams: !408, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!407 = !DINamespace(name: "marker", scope: !112)
!408 = !{!409}
!409 = !DITemplateTypeParameter(name: "T", type: !32)
!410 = !{!386}
!411 = !DILocation(line: 2587, column: 32, scope: !387, inlinedAt: !385)
!412 = !DILocation(line: 2588, column: 6, scope: !375)
!413 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hd9e5901974cba7aaE", scope: !415, file: !414, line: 185, type: !417, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !23, retainedNodes: !419)
!414 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!415 = !DINamespace(name: "{impl#80}", scope: !416)
!416 = !DINamespace(name: "num", scope: !111)
!417 = !DISubroutineType(types: !418)
!418 = !{!224, !32, !247}
!419 = !{!420, !421}
!420 = !DILocalVariable(name: "self", arg: 1, scope: !413, file: !414, line: 185, type: !32)
!421 = !DILocalVariable(name: "f", arg: 2, scope: !413, file: !414, line: 185, type: !247)
!422 = !DILocation(line: 185, column: 20, scope: !413)
!423 = !DILocation(line: 185, column: 27, scope: !413)
!424 = !DILocation(line: 186, column: 20, scope: !413)
!425 = !DILocation(line: 188, column: 27, scope: !413)
!426 = !DILocation(line: 187, column: 21, scope: !413)
!427 = !DILocation(line: 186, column: 17, scope: !413)
!428 = !DILocation(line: 193, column: 14, scope: !413)
!429 = !{i8 0, i8 2}
!430 = !DILocation(line: 191, column: 21, scope: !413)
!431 = !DILocation(line: 189, column: 21, scope: !413)
!432 = !DILocation(line: 188, column: 24, scope: !413)
!433 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hda836d1b04b03406E", scope: !435, file: !434, line: 637, type: !445, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !455, retainedNodes: !448)
!434 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !436, file: !2, size: 128, align: 64, elements: !437, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!436 = !DINamespace(name: "builders", scope: !111)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !435, file: !2, baseType: !439, size: 128, align: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !436, file: !2, size: 128, align: 64, elements: !440, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !439, file: !2, baseType: !247, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !439, file: !2, baseType: !224, size: 8, align: 8, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !439, file: !2, baseType: !444, size: 8, align: 8, offset: 72)
!444 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !447, !394}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !435, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !{!449, !450, !451, !453}
!449 = !DILocalVariable(name: "self", arg: 1, scope: !433, file: !434, line: 637, type: !447)
!450 = !DILocalVariable(name: "entries", arg: 2, scope: !433, file: !434, line: 637, type: !394)
!451 = !DILocalVariable(name: "iter", scope: !452, file: !434, line: 642, type: !394, align: 8)
!452 = distinct !DILexicalBlock(scope: !433, file: !434, line: 642, column: 9)
!453 = !DILocalVariable(name: "entry", scope: !454, file: !434, line: 642, type: !32, align: 8)
!454 = distinct !DILexicalBlock(scope: !452, file: !434, line: 642, column: 30)
!455 = !{!456, !457}
!456 = !DITemplateTypeParameter(name: "D", type: !32)
!457 = !DITemplateTypeParameter(name: "I", type: !394)
!458 = !DILocation(line: 637, column: 26, scope: !433)
!459 = !DILocation(line: 637, column: 37, scope: !433)
!460 = !DILocation(line: 642, column: 22, scope: !452)
!461 = !DILocation(line: 642, column: 13, scope: !454)
!462 = !DILocation(line: 642, column: 22, scope: !433)
!463 = !DILocation(line: 642, column: 9, scope: !452)
!464 = !DILocation(line: 642, column: 9, scope: !433)
!465 = !DILocation(line: 642, column: 13, scope: !452)
!466 = !DILocation(line: 643, column: 24, scope: !454)
!467 = !DILocation(line: 643, column: 13, scope: !454)
!468 = !DILocation(line: 644, column: 9, scope: !452)
!469 = !DILocation(line: 637, column: 5, scope: !433)
!470 = !DILocation(line: 646, column: 6, scope: !433)
!471 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h7e05277355add560E", scope: !472, file: !220, line: 390, type: !546, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !23, retainedNodes: !548)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !111, file: !2, size: 384, align: 64, elements: !473, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!473 = !{!474, !485, !530}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !472, file: !2, baseType: !475, size: 128, align: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !476, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!476 = !{!477, !484}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !475, file: !2, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64, dwarfAddressSpace: 0)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !480, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!480 = !{!481, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !479, file: !2, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !479, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !475, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !472, file: !2, baseType: !486, size: 128, align: 64, offset: 128)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !256, file: !2, size: 128, align: 64, elements: !487, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_variant_part, scope: !486, file: !2, size: 128, align: 64, elements: !489, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !529)
!489 = !{!490, !525}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !488, file: !2, baseType: !491, size: 128, align: 64, extraData: i64 0)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !486, file: !2, size: 128, align: 64, elements: !23, templateParams: !492, identifier: "742dbe7e160661d8ca36fcfff2574850")
!492 = !{!493}
!493 = !DITemplateTypeParameter(name: "T", type: !494)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !495, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!495 = !{!496, !524}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !494, file: !2, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !109, file: !2, size: 448, align: 64, elements: !499, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !498, file: !2, baseType: !9, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !498, file: !2, baseType: !502, size: 384, align: 64, offset: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !109, file: !2, size: 384, align: 64, elements: !503, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!503 = !{!504, !505, !506, !507, !523}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !502, file: !2, baseType: !252, size: 32, align: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !502, file: !2, baseType: !108, size: 8, align: 8, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !2, baseType: !99, size: 32, align: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !502, file: !2, baseType: !508, size: 128, align: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !109, file: !2, size: 128, align: 64, elements: !509, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!509 = !{!510}
!510 = !DICompositeType(tag: DW_TAG_variant_part, scope: !508, file: !2, size: 128, align: 64, elements: !511, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !522)
!511 = !{!512, !516, !520}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !510, file: !2, baseType: !513, size: 128, align: 64, extraData: i64 0)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !508, file: !2, size: 128, align: 64, elements: !514, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !513, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !510, file: !2, baseType: !517, size: 128, align: 64, extraData: i64 1)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !508, file: !2, size: 128, align: 64, elements: !518, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !517, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !510, file: !2, baseType: !521, size: 128, align: 64, extraData: i64 2)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !508, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !508, file: !2, baseType: !269, size: 64, align: 64, flags: DIFlagArtificial)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !502, file: !2, baseType: !508, size: 128, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !494, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !488, file: !2, baseType: !526, size: 128, align: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !486, file: !2, size: 128, align: 64, elements: !527, templateParams: !492, identifier: "17f2fc106094349c7673abca4839c97a")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !526, file: !2, baseType: !494, size: 128, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, scope: !486, file: !2, baseType: !269, size: 64, align: 64, flags: DIFlagArtificial)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !472, file: !2, baseType: !531, size: 128, align: 64, offset: 256)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !532, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!532 = !{!533, !545}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !531, file: !2, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64, dwarfAddressSpace: 0)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !111, file: !2, size: 128, align: 64, elements: !536, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!536 = !{!537, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !535, file: !2, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !539, size: 64, align: 64, dwarfAddressSpace: 0)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !540, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!540 = !DINamespace(name: "{extern#0}", scope: !111)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !535, file: !2, baseType: !542, size: 64, align: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !543, size: 64, align: 64, dwarfAddressSpace: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!224, !538, !247}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !531, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!472, !475, !531}
!548 = !{!549, !550}
!549 = !DILocalVariable(name: "pieces", arg: 1, scope: !471, file: !220, line: 390, type: !475)
!550 = !DILocalVariable(name: "args", arg: 2, scope: !471, file: !220, line: 390, type: !531)
!551 = !DILocation(line: 390, column: 25, scope: !471)
!552 = !DILocation(line: 390, column: 53, scope: !471)
!553 = !DILocation(line: 391, column: 12, scope: !471)
!554 = !DILocation(line: 391, column: 56, scope: !471)
!555 = !DILocation(line: 391, column: 41, scope: !471)
!556 = !DILocation(line: 394, column: 34, scope: !471)
!557 = !DILocation(line: 394, column: 9, scope: !471)
!558 = !DILocation(line: 395, column: 6, scope: !471)
!559 = !DILocation(line: 392, column: 13, scope: !471)
!560 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h3e7c8fa52320df5dE", scope: !562, file: !561, line: 248, type: !565, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !571, retainedNodes: !568)
!561 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!562 = !DINamespace(name: "FnOnce", scope: !563)
!563 = !DINamespace(name: "function", scope: !564)
!564 = !DINamespace(name: "ops", scope: !112)
!565 = !DISubroutineType(types: !566)
!566 = !{!33, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !{!569, !570}
!569 = !DILocalVariable(arg: 1, scope: !560, file: !561, line: 248, type: !567)
!570 = !DILocalVariable(arg: 2, scope: !560, file: !561, line: 248, type: !7)
!571 = !{!572, !573}
!572 = !DITemplateTypeParameter(name: "Self", type: !14)
!573 = !DITemplateTypeParameter(name: "Args", type: !7)
!574 = !DILocation(line: 248, column: 5, scope: !560)
!575 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_buffer3::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h42fca45f7b90fa63E", scope: !562, file: !561, line: 248, type: !576, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !584, retainedNodes: !581)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !578}
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !579, file: !2, align: 8, elements: !23, identifier: "c37db7cd82fcfbca2c10ebb51d5d95c5")
!579 = !DINamespace(name: "test_buffer3", scope: !580)
!580 = !DINamespace(name: "test_enums", scope: !97)
!581 = !{!582, !583}
!582 = !DILocalVariable(arg: 1, scope: !575, file: !561, line: 248, type: !578)
!583 = !DILocalVariable(arg: 2, scope: !575, file: !561, line: 248, type: !7)
!584 = !{!585, !573}
!585 = !DITemplateTypeParameter(name: "Self", type: !578)
!586 = !DILocation(line: 248, column: 5, scope: !575)
!587 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h8e874ff8dcdeef97E", scope: !562, file: !561, line: 248, type: !130, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !591, retainedNodes: !588)
!588 = !{!589, !590}
!589 = !DILocalVariable(arg: 1, scope: !587, file: !561, line: 248, type: !20)
!590 = !DILocalVariable(arg: 2, scope: !587, file: !561, line: 248, type: !7)
!591 = !{!592, !573}
!592 = !DITemplateTypeParameter(name: "Self", type: !20)
!593 = !DILocation(line: 248, column: 5, scope: !587)
!594 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_buffer4::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h9341cb19c5c24755E", scope: !562, file: !561, line: 248, type: !595, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !602, retainedNodes: !599)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !597}
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !598, file: !2, align: 8, elements: !23, identifier: "93482208007c4b1199d60c8be891dab3")
!598 = !DINamespace(name: "test_buffer4", scope: !580)
!599 = !{!600, !601}
!600 = !DILocalVariable(arg: 1, scope: !594, file: !561, line: 248, type: !597)
!601 = !DILocalVariable(arg: 2, scope: !594, file: !561, line: 248, type: !7)
!602 = !{!603, !573}
!603 = !DITemplateTypeParameter(name: "Self", type: !597)
!604 = !DILocation(line: 248, column: 5, scope: !594)
!605 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_variants::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h9e7a1f5608996941E", scope: !562, file: !561, line: 248, type: !606, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !613, retainedNodes: !610)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !608}
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !609, file: !2, align: 8, elements: !23, identifier: "1a5550b6e017efee2f7a1d399352177b")
!609 = !DINamespace(name: "test_variants", scope: !580)
!610 = !{!611, !612}
!611 = !DILocalVariable(arg: 1, scope: !605, file: !561, line: 248, type: !608)
!612 = !DILocalVariable(arg: 2, scope: !605, file: !561, line: 248, type: !7)
!613 = !{!614, !573}
!614 = !DITemplateTypeParameter(name: "Self", type: !608)
!615 = !DILocation(line: 248, column: 5, scope: !605)
!616 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_buffer2::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hb5a505783b20948bE", scope: !562, file: !561, line: 248, type: !617, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !624, retainedNodes: !621)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !619}
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !620, file: !2, align: 8, elements: !23, identifier: "dc862943e25fe4513850fbf83db2d776")
!620 = !DINamespace(name: "test_buffer2", scope: !580)
!621 = !{!622, !623}
!622 = !DILocalVariable(arg: 1, scope: !616, file: !561, line: 248, type: !619)
!623 = !DILocalVariable(arg: 2, scope: !616, file: !561, line: 248, type: !7)
!624 = !{!625, !573}
!625 = !DITemplateTypeParameter(name: "Self", type: !619)
!626 = !DILocation(line: 248, column: 5, scope: !616)
!627 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_buffer5::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hb8425bf5565e8fe7E", scope: !562, file: !561, line: 248, type: !628, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !635, retainedNodes: !632)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630}
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !631, file: !2, align: 8, elements: !23, identifier: "1fcef6b60ff0784251ccc95688fa3c96")
!631 = !DINamespace(name: "test_buffer5", scope: !580)
!632 = !{!633, !634}
!633 = !DILocalVariable(arg: 1, scope: !627, file: !561, line: 248, type: !630)
!634 = !DILocalVariable(arg: 2, scope: !627, file: !561, line: 248, type: !7)
!635 = !{!636, !573}
!636 = !DITemplateTypeParameter(name: "Self", type: !630)
!637 = !DILocation(line: 248, column: 5, scope: !627)
!638 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_buffer6::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hda4d63f67d682cdaE", scope: !562, file: !561, line: 248, type: !639, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !646, retainedNodes: !643)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641}
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !642, file: !2, align: 8, elements: !23, identifier: "9613328e0272520dccba9cdb6e1cec3a")
!642 = !DINamespace(name: "test_buffer6", scope: !580)
!643 = !{!644, !645}
!644 = !DILocalVariable(arg: 1, scope: !638, file: !561, line: 248, type: !641)
!645 = !DILocalVariable(arg: 2, scope: !638, file: !561, line: 248, type: !7)
!646 = !{!647, !573}
!647 = !DITemplateTypeParameter(name: "Self", type: !641)
!648 = !DILocation(line: 248, column: 5, scope: !638)
!649 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hecf3ff2734033fa2E", scope: !562, file: !561, line: 248, type: !650, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !571, retainedNodes: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{!33, !14}
!652 = !{!653, !654}
!653 = !DILocalVariable(arg: 1, scope: !649, file: !561, line: 248, type: !14)
!654 = !DILocalVariable(arg: 2, scope: !649, file: !561, line: 248, type: !7)
!655 = !DILocation(line: 248, column: 5, scope: !649)
!656 = distinct !DISubprogram(name: "call_once<enum_tests::test_enums::test_buffer::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hffee2510c829820cE", scope: !562, file: !561, line: 248, type: !657, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !664, retainedNodes: !661)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !659}
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !660, file: !2, align: 8, elements: !23, identifier: "2c76c9c3012e9388e04598a77c3f4798")
!660 = !DINamespace(name: "test_buffer", scope: !580)
!661 = !{!662, !663}
!662 = !DILocalVariable(arg: 1, scope: !656, file: !561, line: 248, type: !659)
!663 = !DILocalVariable(arg: 2, scope: !656, file: !561, line: 248, type: !7)
!664 = !{!665, !573}
!665 = !DITemplateTypeParameter(name: "Self", type: !659)
!666 = !DILocation(line: 248, column: 5, scope: !656)
!667 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h7ec66b900a4eee11E", scope: !400, file: !668, line: 487, type: !669, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !408, retainedNodes: !672)
!668 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!669 = !DISubroutineType(types: !670)
!670 = !{null, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!672 = !{!673}
!673 = !DILocalVariable(arg: 1, scope: !667, file: !668, line: 487, type: !671)
!674 = !DILocation(line: 487, column: 1, scope: !667)
!675 = distinct !DISubprogram(name: "drop_in_place<&[i32; 1]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$1$u5d$$GT$17hb90f7df8ef5ae85eE", scope: !400, file: !668, line: 487, type: !676, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !681, retainedNodes: !679)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 1]", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!679 = !{!680}
!680 = !DILocalVariable(arg: 1, scope: !675, file: !668, line: 487, type: !678)
!681 = !{!682}
!682 = !DITemplateTypeParameter(name: "T", type: !54)
!683 = !DILocation(line: 487, column: 1, scope: !675)
!684 = distinct !DISubprogram(name: "drop_in_place<&[i32; 4]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$4$u5d$$GT$17h9e0521c4efa00d88E", scope: !400, file: !668, line: 487, type: !685, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !690, retainedNodes: !688)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 4]", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!688 = !{!689}
!689 = !DILocalVariable(arg: 1, scope: !684, file: !668, line: 487, type: !687)
!690 = !{!691}
!691 = !DITemplateTypeParameter(name: "T", type: !66)
!692 = !DILocation(line: 487, column: 1, scope: !684)
!693 = distinct !DISubprogram(name: "drop_in_place<&[i32; 6]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$6$u5d$$GT$17h8238de2a00adf46bE", scope: !400, file: !668, line: 487, type: !694, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !699, retainedNodes: !697)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 6]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!697 = !{!698}
!698 = !DILocalVariable(arg: 1, scope: !693, file: !668, line: 487, type: !696)
!699 = !{!700}
!700 = !DITemplateTypeParameter(name: "T", type: !42)
!701 = !DILocation(line: 487, column: 1, scope: !693)
!702 = distinct !DISubprogram(name: "drop_in_place<&[i32; 7]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$7$u5d$$GT$17h889d1b24797287b7E", scope: !400, file: !668, line: 487, type: !703, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !708, retainedNodes: !706)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 7]", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!706 = !{!707}
!707 = !DILocalVariable(arg: 1, scope: !702, file: !668, line: 487, type: !705)
!708 = !{!709}
!709 = !DITemplateTypeParameter(name: "T", type: !90)
!710 = !DILocation(line: 487, column: 1, scope: !702)
!711 = distinct !DISubprogram(name: "drop_in_place<&[i32; 10]>", linkageName: "_ZN4core3ptr50drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$10$u5d$$GT$17h90d6b078349ea47dE", scope: !400, file: !668, line: 487, type: !712, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !717, retainedNodes: !715)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 10]", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!715 = !{!716}
!716 = !DILocalVariable(arg: 1, scope: !711, file: !668, line: 487, type: !714)
!717 = !{!718}
!718 = !DITemplateTypeParameter(name: "T", type: !78)
!719 = !DILocation(line: 487, column: 1, scope: !711)
!720 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h591352874f4f157eE", scope: !400, file: !668, line: 487, type: !721, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !725, retainedNodes: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !567}
!723 = !{!724}
!724 = !DILocalVariable(arg: 1, scope: !720, file: !668, line: 487, type: !567)
!725 = !{!726}
!726 = !DITemplateTypeParameter(name: "T", type: !14)
!727 = !DILocation(line: 487, column: 1, scope: !720)
!728 = distinct !DISubprogram(name: "fmt<i32, 7>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17h19f2004614bd64e3E", scope: !730, file: !729, line: 251, type: !732, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !734)
!729 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e237aff39bff30ac55984ee183267020")
!730 = !DINamespace(name: "{impl#12}", scope: !731)
!731 = !DINamespace(name: "array", scope: !112)
!732 = !DISubroutineType(types: !733)
!733 = !{!224, !90, !247}
!734 = !{!735, !736}
!735 = !DILocalVariable(name: "self", arg: 1, scope: !728, file: !729, line: 251, type: !90)
!736 = !DILocalVariable(name: "f", arg: 2, scope: !728, file: !729, line: 251, type: !247)
!737 = !DILocation(line: 251, column: 12, scope: !728)
!738 = !DILocation(line: 251, column: 19, scope: !728)
!739 = !DILocalVariable(name: "index", scope: !740, file: !729, line: 252, type: !744, align: 1)
!740 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 7>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h71a812bf65094410E", scope: !741, file: !729, line: 285, type: !742, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !754)
!741 = !DINamespace(name: "{impl#15}", scope: !731)
!742 = !DISubroutineType(types: !743)
!743 = !{!242, !90, !744, !746}
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !745, file: !2, align: 8, elements: !23, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!745 = !DINamespace(name: "range", scope: !564)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !747, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !748, file: !2, size: 192, align: 64, elements: !750, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!748 = !DINamespace(name: "location", scope: !749)
!749 = !DINamespace(name: "panic", scope: !112)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !747, file: !2, baseType: !479, size: 128, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !747, file: !2, baseType: !99, size: 32, align: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !747, file: !2, baseType: !99, size: 32, align: 32, offset: 160)
!754 = !{!755, !739}
!755 = !DILocalVariable(name: "self", scope: !740, file: !729, line: 252, type: !90, align: 8)
!756 = !{!286, !757}
!757 = !DITemplateTypeParameter(name: "I", type: !744)
!758 = !DILocation(line: 252, column: 27, scope: !740, inlinedAt: !759)
!759 = !DILocation(line: 252, column: 27, scope: !728)
!760 = !DILocalVariable(name: "index", scope: !761, file: !729, line: 252, type: !744, align: 1)
!761 = !DILexicalBlockFile(scope: !762, file: !729, discriminator: 0)
!762 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hf5bf1e02d4d75e99E", scope: !764, file: !763, line: 17, type: !766, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !768)
!763 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!764 = !DINamespace(name: "{impl#0}", scope: !765)
!765 = !DINamespace(name: "index", scope: !391)
!766 = !DISubroutineType(types: !767)
!767 = !{!242, !242, !744, !746}
!768 = !{!769, !760}
!769 = !DILocalVariable(name: "self", scope: !761, file: !729, line: 252, type: !242, align: 8)
!770 = !DILocation(line: 252, column: 27, scope: !761, inlinedAt: !771)
!771 = !DILocation(line: 286, column: 9, scope: !740, inlinedAt: !759)
!772 = !DILocalVariable(name: "self", scope: !773, file: !729, line: 252, type: !744, align: 1)
!773 = !DILexicalBlockFile(scope: !774, file: !729, discriminator: 0)
!774 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h925e7add725817c1E", scope: !775, file: !763, line: 432, type: !776, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !778)
!775 = !DINamespace(name: "{impl#6}", scope: !765)
!776 = !DISubroutineType(types: !777)
!777 = !{!242, !744, !242, !746}
!778 = !{!772, !779}
!779 = !DILocalVariable(name: "slice", scope: !773, file: !729, line: 252, type: !242, align: 8)
!780 = !DILocation(line: 252, column: 27, scope: !773, inlinedAt: !781)
!781 = !DILocation(line: 18, column: 9, scope: !762, inlinedAt: !771)
!782 = !DILocation(line: 252, column: 26, scope: !728)
!783 = !DILocation(line: 252, column: 9, scope: !728)
!784 = !DILocation(line: 253, column: 6, scope: !728)
!785 = distinct !DISubprogram(name: "fmt<i32, 1>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17h7eb0907c0c19ff33E", scope: !730, file: !729, line: 251, type: !786, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{!224, !54, !247}
!788 = !{!789, !790}
!789 = !DILocalVariable(name: "self", arg: 1, scope: !785, file: !729, line: 251, type: !54)
!790 = !DILocalVariable(name: "f", arg: 2, scope: !785, file: !729, line: 251, type: !247)
!791 = !DILocation(line: 251, column: 12, scope: !785)
!792 = !DILocation(line: 251, column: 19, scope: !785)
!793 = !DILocalVariable(name: "index", scope: !794, file: !729, line: 252, type: !744, align: 1)
!794 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 1>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h6ff1485251815bd7E", scope: !741, file: !729, line: 285, type: !795, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!242, !54, !744, !746}
!797 = !{!798, !793}
!798 = !DILocalVariable(name: "self", scope: !794, file: !729, line: 252, type: !54, align: 8)
!799 = !DILocation(line: 252, column: 27, scope: !794, inlinedAt: !800)
!800 = !DILocation(line: 252, column: 27, scope: !785)
!801 = !DILocalVariable(name: "index", scope: !802, file: !729, line: 252, type: !744, align: 1)
!802 = !DILexicalBlockFile(scope: !803, file: !729, discriminator: 0)
!803 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hf5bf1e02d4d75e99E", scope: !764, file: !763, line: 17, type: !766, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !804)
!804 = !{!805, !801}
!805 = !DILocalVariable(name: "self", scope: !802, file: !729, line: 252, type: !242, align: 8)
!806 = !DILocation(line: 252, column: 27, scope: !802, inlinedAt: !807)
!807 = !DILocation(line: 286, column: 9, scope: !794, inlinedAt: !800)
!808 = !DILocalVariable(name: "self", scope: !809, file: !729, line: 252, type: !744, align: 1)
!809 = !DILexicalBlockFile(scope: !810, file: !729, discriminator: 0)
!810 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h925e7add725817c1E", scope: !775, file: !763, line: 432, type: !776, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !811)
!811 = !{!808, !812}
!812 = !DILocalVariable(name: "slice", scope: !809, file: !729, line: 252, type: !242, align: 8)
!813 = !DILocation(line: 252, column: 27, scope: !809, inlinedAt: !814)
!814 = !DILocation(line: 18, column: 9, scope: !803, inlinedAt: !807)
!815 = !DILocation(line: 252, column: 26, scope: !785)
!816 = !DILocation(line: 252, column: 9, scope: !785)
!817 = !DILocation(line: 253, column: 6, scope: !785)
!818 = distinct !DISubprogram(name: "fmt<i32, 4>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17hcfa8031c92774399E", scope: !730, file: !729, line: 251, type: !819, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{!224, !66, !247}
!821 = !{!822, !823}
!822 = !DILocalVariable(name: "self", arg: 1, scope: !818, file: !729, line: 251, type: !66)
!823 = !DILocalVariable(name: "f", arg: 2, scope: !818, file: !729, line: 251, type: !247)
!824 = !DILocation(line: 251, column: 12, scope: !818)
!825 = !DILocation(line: 251, column: 19, scope: !818)
!826 = !DILocalVariable(name: "index", scope: !827, file: !729, line: 252, type: !744, align: 1)
!827 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 4>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h424eac0904f6bca3E", scope: !741, file: !729, line: 285, type: !828, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!242, !66, !744, !746}
!830 = !{!831, !826}
!831 = !DILocalVariable(name: "self", scope: !827, file: !729, line: 252, type: !66, align: 8)
!832 = !DILocation(line: 252, column: 27, scope: !827, inlinedAt: !833)
!833 = !DILocation(line: 252, column: 27, scope: !818)
!834 = !DILocalVariable(name: "index", scope: !835, file: !729, line: 252, type: !744, align: 1)
!835 = !DILexicalBlockFile(scope: !836, file: !729, discriminator: 0)
!836 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hf5bf1e02d4d75e99E", scope: !764, file: !763, line: 17, type: !766, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !837)
!837 = !{!838, !834}
!838 = !DILocalVariable(name: "self", scope: !835, file: !729, line: 252, type: !242, align: 8)
!839 = !DILocation(line: 252, column: 27, scope: !835, inlinedAt: !840)
!840 = !DILocation(line: 286, column: 9, scope: !827, inlinedAt: !833)
!841 = !DILocalVariable(name: "self", scope: !842, file: !729, line: 252, type: !744, align: 1)
!842 = !DILexicalBlockFile(scope: !843, file: !729, discriminator: 0)
!843 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h925e7add725817c1E", scope: !775, file: !763, line: 432, type: !776, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !844)
!844 = !{!841, !845}
!845 = !DILocalVariable(name: "slice", scope: !842, file: !729, line: 252, type: !242, align: 8)
!846 = !DILocation(line: 252, column: 27, scope: !842, inlinedAt: !847)
!847 = !DILocation(line: 18, column: 9, scope: !836, inlinedAt: !840)
!848 = !DILocation(line: 252, column: 26, scope: !818)
!849 = !DILocation(line: 252, column: 9, scope: !818)
!850 = !DILocation(line: 253, column: 6, scope: !818)
!851 = distinct !DISubprogram(name: "fmt<i32, 10>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17hdcaf2c7de2ab494eE", scope: !730, file: !729, line: 251, type: !852, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !854)
!852 = !DISubroutineType(types: !853)
!853 = !{!224, !78, !247}
!854 = !{!855, !856}
!855 = !DILocalVariable(name: "self", arg: 1, scope: !851, file: !729, line: 251, type: !78)
!856 = !DILocalVariable(name: "f", arg: 2, scope: !851, file: !729, line: 251, type: !247)
!857 = !DILocation(line: 251, column: 12, scope: !851)
!858 = !DILocation(line: 251, column: 19, scope: !851)
!859 = !DILocalVariable(name: "index", scope: !860, file: !729, line: 252, type: !744, align: 1)
!860 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 10>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17hc2d10c166af97137E", scope: !741, file: !729, line: 285, type: !861, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{!242, !78, !744, !746}
!863 = !{!864, !859}
!864 = !DILocalVariable(name: "self", scope: !860, file: !729, line: 252, type: !78, align: 8)
!865 = !DILocation(line: 252, column: 27, scope: !860, inlinedAt: !866)
!866 = !DILocation(line: 252, column: 27, scope: !851)
!867 = !DILocalVariable(name: "index", scope: !868, file: !729, line: 252, type: !744, align: 1)
!868 = !DILexicalBlockFile(scope: !869, file: !729, discriminator: 0)
!869 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hf5bf1e02d4d75e99E", scope: !764, file: !763, line: 17, type: !766, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !870)
!870 = !{!871, !867}
!871 = !DILocalVariable(name: "self", scope: !868, file: !729, line: 252, type: !242, align: 8)
!872 = !DILocation(line: 252, column: 27, scope: !868, inlinedAt: !873)
!873 = !DILocation(line: 286, column: 9, scope: !860, inlinedAt: !866)
!874 = !DILocalVariable(name: "self", scope: !875, file: !729, line: 252, type: !744, align: 1)
!875 = !DILexicalBlockFile(scope: !876, file: !729, discriminator: 0)
!876 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h925e7add725817c1E", scope: !775, file: !763, line: 432, type: !776, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !877)
!877 = !{!874, !878}
!878 = !DILocalVariable(name: "slice", scope: !875, file: !729, line: 252, type: !242, align: 8)
!879 = !DILocation(line: 252, column: 27, scope: !875, inlinedAt: !880)
!880 = !DILocation(line: 18, column: 9, scope: !869, inlinedAt: !873)
!881 = !DILocation(line: 252, column: 26, scope: !851)
!882 = !DILocation(line: 252, column: 9, scope: !851)
!883 = !DILocation(line: 253, column: 6, scope: !851)
!884 = distinct !DISubprogram(name: "fmt<i32, 6>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17he336869ccd8e886dE", scope: !730, file: !729, line: 251, type: !885, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{!224, !42, !247}
!887 = !{!888, !889}
!888 = !DILocalVariable(name: "self", arg: 1, scope: !884, file: !729, line: 251, type: !42)
!889 = !DILocalVariable(name: "f", arg: 2, scope: !884, file: !729, line: 251, type: !247)
!890 = !DILocation(line: 251, column: 12, scope: !884)
!891 = !DILocation(line: 251, column: 19, scope: !884)
!892 = !DILocalVariable(name: "index", scope: !893, file: !729, line: 252, type: !744, align: 1)
!893 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 6>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17ha3ed10a5c3687b1eE", scope: !741, file: !729, line: 285, type: !894, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!242, !42, !744, !746}
!896 = !{!897, !892}
!897 = !DILocalVariable(name: "self", scope: !893, file: !729, line: 252, type: !42, align: 8)
!898 = !DILocation(line: 252, column: 27, scope: !893, inlinedAt: !899)
!899 = !DILocation(line: 252, column: 27, scope: !884)
!900 = !DILocalVariable(name: "index", scope: !901, file: !729, line: 252, type: !744, align: 1)
!901 = !DILexicalBlockFile(scope: !902, file: !729, discriminator: 0)
!902 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hf5bf1e02d4d75e99E", scope: !764, file: !763, line: 17, type: !766, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !756, retainedNodes: !903)
!903 = !{!904, !900}
!904 = !DILocalVariable(name: "self", scope: !901, file: !729, line: 252, type: !242, align: 8)
!905 = !DILocation(line: 252, column: 27, scope: !901, inlinedAt: !906)
!906 = !DILocation(line: 286, column: 9, scope: !893, inlinedAt: !899)
!907 = !DILocalVariable(name: "self", scope: !908, file: !729, line: 252, type: !744, align: 1)
!908 = !DILexicalBlockFile(scope: !909, file: !729, discriminator: 0)
!909 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h925e7add725817c1E", scope: !775, file: !763, line: 432, type: !776, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !910)
!910 = !{!907, !911}
!911 = !DILocalVariable(name: "slice", scope: !908, file: !729, line: 252, type: !242, align: 8)
!912 = !DILocation(line: 252, column: 27, scope: !908, inlinedAt: !913)
!913 = !DILocation(line: 18, column: 9, scope: !902, inlinedAt: !906)
!914 = !DILocation(line: 252, column: 26, scope: !884)
!915 = !DILocation(line: 252, column: 9, scope: !884)
!916 = !DILocation(line: 253, column: 6, scope: !884)
!917 = distinct !DISubprogram(name: "eq<i32, i32, 7>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17h78f399bd261d3bafE", scope: !919, file: !918, line: 11, type: !921, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !926, retainedNodes: !923)
!918 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/equality.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b2a6ef978d2ec8f60a33a03ff9f5cb8")
!919 = !DINamespace(name: "{impl#0}", scope: !920)
!920 = !DINamespace(name: "equality", scope: !731)
!921 = !DISubroutineType(types: !922)
!922 = !{!444, !90, !90}
!923 = !{!924, !925}
!924 = !DILocalVariable(name: "self", arg: 1, scope: !917, file: !918, line: 11, type: !90)
!925 = !DILocalVariable(name: "other", arg: 2, scope: !917, file: !918, line: 11, type: !90)
!926 = !{!927, !928}
!927 = !DITemplateTypeParameter(name: "A", type: !33)
!928 = !DITemplateTypeParameter(name: "B", type: !33)
!929 = !DILocation(line: 11, column: 11, scope: !917)
!930 = !DILocation(line: 11, column: 18, scope: !917)
!931 = !DILocation(line: 12, column: 9, scope: !917)
!932 = !DILocation(line: 13, column: 6, scope: !917)
!933 = distinct !DISubprogram(name: "eq<i32, i32, 1>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17hd3a423a48c324e28E", scope: !919, file: !918, line: 11, type: !934, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !926, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!444, !54, !54}
!936 = !{!937, !938}
!937 = !DILocalVariable(name: "self", arg: 1, scope: !933, file: !918, line: 11, type: !54)
!938 = !DILocalVariable(name: "other", arg: 2, scope: !933, file: !918, line: 11, type: !54)
!939 = !DILocation(line: 11, column: 11, scope: !933)
!940 = !DILocation(line: 11, column: 18, scope: !933)
!941 = !DILocation(line: 12, column: 9, scope: !933)
!942 = !DILocation(line: 13, column: 6, scope: !933)
!943 = distinct !DISubprogram(name: "eq<i32, i32, 10>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17hd92c6ff93cabd6daE", scope: !919, file: !918, line: 11, type: !944, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !926, retainedNodes: !946)
!944 = !DISubroutineType(types: !945)
!945 = !{!444, !78, !78}
!946 = !{!947, !948}
!947 = !DILocalVariable(name: "self", arg: 1, scope: !943, file: !918, line: 11, type: !78)
!948 = !DILocalVariable(name: "other", arg: 2, scope: !943, file: !918, line: 11, type: !78)
!949 = !DILocation(line: 11, column: 11, scope: !943)
!950 = !DILocation(line: 11, column: 18, scope: !943)
!951 = !DILocation(line: 12, column: 9, scope: !943)
!952 = !DILocation(line: 13, column: 6, scope: !943)
!953 = distinct !DISubprogram(name: "eq<i32, i32, 6>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17he1bb92bffaa7cd4aE", scope: !919, file: !918, line: 11, type: !954, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !926, retainedNodes: !956)
!954 = !DISubroutineType(types: !955)
!955 = !{!444, !42, !42}
!956 = !{!957, !958}
!957 = !DILocalVariable(name: "self", arg: 1, scope: !953, file: !918, line: 11, type: !42)
!958 = !DILocalVariable(name: "other", arg: 2, scope: !953, file: !918, line: 11, type: !42)
!959 = !DILocation(line: 11, column: 11, scope: !953)
!960 = !DILocation(line: 11, column: 18, scope: !953)
!961 = !DILocation(line: 12, column: 9, scope: !953)
!962 = !DILocation(line: 13, column: 6, scope: !953)
!963 = distinct !DISubprogram(name: "eq<i32, i32, 4>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17he96d361e685ffc6fE", scope: !919, file: !918, line: 11, type: !964, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !926, retainedNodes: !966)
!964 = !DISubroutineType(types: !965)
!965 = !{!444, !66, !66}
!966 = !{!967, !968}
!967 = !DILocalVariable(name: "self", arg: 1, scope: !963, file: !918, line: 11, type: !66)
!968 = !DILocalVariable(name: "other", arg: 2, scope: !963, file: !918, line: 11, type: !66)
!969 = !DILocation(line: 11, column: 11, scope: !963)
!970 = !DILocation(line: 11, column: 18, scope: !963)
!971 = !DILocation(line: 12, column: 9, scope: !963)
!972 = !DILocation(line: 13, column: 6, scope: !963)
!973 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h416cb3eecf921d6fE", scope: !390, file: !389, line: 506, type: !974, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !981)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i32]", file: !2, size: 128, align: 64, elements: !978, templateParams: !23, identifier: "e558f8cebf02444c46b3d01510c8747d")
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !977, file: !2, baseType: !245, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !977, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!981 = !{!982}
!982 = !DILocalVariable(name: "self", arg: 1, scope: !973, file: !389, line: 506, type: !977)
!983 = !DILocation(line: 506, column: 29, scope: !973)
!984 = !DILocation(line: 507, column: 9, scope: !973)
!985 = !DILocation(line: 508, column: 6, scope: !973)
!986 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h619f0f691c4c3fbbE", scope: !394, file: !987, line: 88, type: !392, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !988)
!987 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "36678af40fdc22d7150f6f91e11271b3")
!988 = !{!989, !990, !992}
!989 = !DILocalVariable(name: "slice", arg: 1, scope: !986, file: !987, line: 88, type: !242)
!990 = !DILocalVariable(name: "ptr", scope: !991, file: !987, line: 89, type: !403, align: 8)
!991 = distinct !DILexicalBlock(scope: !986, file: !987, line: 89, column: 9)
!992 = !DILocalVariable(name: "end", scope: !993, file: !987, line: 94, type: !403, align: 8)
!993 = distinct !DILexicalBlock(scope: !991, file: !987, line: 94, column: 13)
!994 = !DILocation(line: 88, column: 23, scope: !986)
!995 = !DILocation(line: 94, column: 17, scope: !993)
!996 = !DILocalVariable(name: "metadata", scope: !997, file: !987, line: 92, type: !7, align: 1)
!997 = !DILexicalBlockFile(scope: !998, file: !987, discriminator: 0)
!998 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h3c221ed07d6d67d2E", scope: !1000, file: !999, line: 110, type: !1001, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !1005, retainedNodes: !1003)
!999 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!1000 = !DINamespace(name: "metadata", scope: !400)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!163, !6, !7}
!1003 = !{!1004, !996}
!1004 = !DILocalVariable(name: "data_address", scope: !997, file: !987, line: 92, type: !6, align: 8)
!1005 = !{!1006}
!1006 = !DITemplateTypeParameter(name: "T", type: !113)
!1007 = !DILocation(line: 92, column: 21, scope: !997, inlinedAt: !1008)
!1008 = !DILocation(line: 513, column: 5, scope: !1009, inlinedAt: !1012)
!1009 = distinct !DISubprogram(name: "null<u8>", linkageName: "_ZN4core3ptr4null17h3c9ee2079cc20179E", scope: !400, file: !668, line: 512, type: !1010, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !1005, retainedNodes: !23)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!163}
!1012 = !DILocation(line: 39, column: 43, scope: !1013, inlinedAt: !1022)
!1013 = distinct !DISubprogram(name: "is_null<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17hb057e88f458650a9E", scope: !1015, file: !1014, line: 36, type: !1017, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, templateParams: !285, retainedNodes: !1019)
!1014 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!1015 = !DINamespace(name: "{impl#0}", scope: !1016)
!1016 = !DINamespace(name: "const_ptr", scope: !400)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!444, !403}
!1019 = !{!1020}
!1020 = !DILocalVariable(name: "self", scope: !1021, file: !987, line: 92, type: !403, align: 8)
!1021 = !DILexicalBlockFile(scope: !1013, file: !987, discriminator: 0)
!1022 = !DILocation(line: 92, column: 21, scope: !991)
