; ModuleID = '1hgguzirg7c3m196'
source_filename = "1hgguzirg7c3m196"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_uninitialized.rs:11:1: 23:2]" = type {}
%"[closure@src/test_quicksort.rs:46:1: 61:2]" = type {}
%"[closure@src/test_typedef.rs:11:1: 27:2]" = type {}
%"[closure@src/test_memory.rs:31:1: 43:2]" = type {}
%"[closure@src/test_exprs.rs:12:1: 24:2]" = type {}
%"[closure@src/test_lvalues.rs:12:1: 24:2]" = type {}
%"[closure@src/test_quicksort.rs:14:1: 28:2]" = type {}
%"[closure@src/test_shadowing.rs:14:1: 21:2]" = type {}
%"[closure@src/test_sizeofs.rs:14:1: 26:2]" = type {}
%"[closure@src/test_memory.rs:16:1: 28:2]" = type {}
%"[closure@src/test_shadowing.rs:24:1: 36:2]" = type {}
%"[closure@src/test_quicksort.rs:31:1: 43:2]" = type {}
%"[closure@src/test_uninitialized.rs:26:1: 39:2]" = type {}
%"alloc::vec::Vec<i32>" = type { { i32*, i64 }, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&[i32; 10] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 10] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "52e8b284be8e9634c9ba80284e386ef6")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 10]", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 320, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 10, lowerBound: 0)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !49, vtableHolder: !54, templateParams: !23, identifier: "b20b0bf2611b1d374904c8fc83165c49")
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !48, file: !2, baseType: !6, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !48, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !48, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "<&[i32; 3] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 3] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !58, vtableHolder: !63, templateParams: !23, identifier: "3da2013896f53f976662a733a7625295")
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !57, file: !2, baseType: !6, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !57, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !57, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 3]", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, align: 32, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3, lowerBound: 0)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "<&[i32; 1] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 1] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !70, vtableHolder: !75, templateParams: !23, identifier: "8c376f87b4817cf69c8f30bcf302b960")
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !69, file: !2, baseType: !6, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !69, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !69, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !69, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 1]", baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, align: 32, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1, lowerBound: 0)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "<&[i32; 5] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 5] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !82, vtableHolder: !87, templateParams: !23, identifier: "c4ed3819c7760df720707546a9c96eb7")
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !81, file: !2, baseType: !6, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !81, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !81, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 5]", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 5, lowerBound: 0)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "<&[i32; 6] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 6] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !94, vtableHolder: !99, templateParams: !23, identifier: "358d88facf61ead4530386abd50fe857")
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !93, file: !2, baseType: !6, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !93, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !93, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 6]", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, align: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 6, lowerBound: 0)
!103 = !{i32 7, !"PIC Level", i32 2}
!104 = !{i32 7, !"PIE Level", i32 2}
!105 = !{i32 2, !"RtLibUseGOT", i32 1}
!106 = !{i32 2, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !109, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, globals: !215)
!109 = !DIFile(filename: "src/lib.rs/@/1hgguzirg7c3m196", directory: "/home/calvin/git/c2rust/tests/misc")
!110 = !{!111, !181, !191, !198, !203, !209}
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !112, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagEnumClass, elements: !116)
!112 = !DINamespace(name: "valid_align", scope: !113)
!113 = !DINamespace(name: "mem", scope: !114)
!114 = !DINamespace(name: "core", scope: null)
!115 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!117 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !182, file: !2, baseType: !185, size: 8, align: 8, flags: DIFlagEnumClass, elements: !186)
!182 = !DINamespace(name: "v1", scope: !183)
!183 = !DINamespace(name: "rt", scope: !184)
!184 = !DINamespace(name: "fmt", scope: !114)
!185 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!186 = !{!187, !188, !189, !190}
!187 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!188 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!189 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!190 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !192, file: !2, baseType: !193, size: 8, align: 8, flags: DIFlagEnumClass, elements: !194)
!192 = !DINamespace(name: "cmp", scope: !114)
!193 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!194 = !{!195, !196, !197}
!195 = !DIEnumerator(name: "Less", value: 255)
!196 = !DIEnumerator(name: "Equal", value: 0)
!197 = !DIEnumerator(name: "Greater", value: 1)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !199, file: !2, baseType: !185, size: 8, align: 8, flags: DIFlagEnumClass, elements: !200)
!199 = !DINamespace(name: "ffi", scope: !114)
!200 = !{!201, !202}
!201 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!202 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !204, file: !2, baseType: !185, size: 8, align: 8, flags: DIFlagEnumClass, elements: !205)
!204 = !DINamespace(name: "panicking", scope: !114)
!205 = !{!206, !207, !208}
!206 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!207 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!208 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !210, file: !2, baseType: !185, size: 8, align: 8, flags: DIFlagEnumClass, elements: !212)
!210 = !DINamespace(name: "raw_vec", scope: !211)
!211 = !DINamespace(name: "alloc", scope: null)
!212 = !{!213, !214}
!213 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!214 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!215 = !{!0, !24, !34, !46, !55, !67, !79, !91}
!216 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..non_null..NonNull$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..unique..Unique$LT$T$GT$$GT$$GT$4from17h8102e8b4a9951160E", scope: !218, file: !217, line: 770, type: !221, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !227, retainedNodes: !236)
!217 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "856acc92efd7925b83dd1e3c577ddbdc")
!218 = !DINamespace(name: "{impl#16}", scope: !219)
!219 = !DINamespace(name: "non_null", scope: !220)
!220 = !DINamespace(name: "ptr", scope: !114)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !229}
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !219, file: !2, size: 64, align: 64, elements: !224, templateParams: !227, identifier: "3160283ea80cecf6149fff38a2e996de")
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !223, file: !2, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !{!228}
!228 = !DITemplateTypeParameter(name: "T", type: !185)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !230, file: !2, size: 64, align: 64, elements: !231, templateParams: !227, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!230 = !DINamespace(name: "unique", scope: !220)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !229, file: !2, baseType: !223, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !229, file: !2, baseType: !234, align: 8)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !235, file: !2, align: 8, elements: !23, templateParams: !227, identifier: "e338a8151f1037c76eadd10ab3c53972")
!235 = !DINamespace(name: "marker", scope: !114)
!236 = !{!237}
!237 = !DILocalVariable(name: "unique", arg: 1, scope: !216, file: !217, line: 770, type: !229)
!238 = !DILocation(line: 770, column: 13, scope: !216)
!239 = !DILocation(line: 773, column: 41, scope: !216)
!240 = !DILocalVariable(name: "self", scope: !241, file: !217, line: 773, type: !229, align: 8)
!241 = !DILexicalBlockFile(scope: !242, file: !217, discriminator: 0)
!242 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17ha3c07247193dff86E", scope: !229, file: !243, line: 103, type: !244, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !227, retainedNodes: !247)
!243 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/unique.rs", directory: "", checksumkind: CSK_MD5, checksum: "acdefab5f14df6e5aef1141fd6b768c9")
!244 = !DISubroutineType(types: !245)
!245 = !{!246, !229}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!247 = !{!240}
!248 = !DILocation(line: 773, column: 41, scope: !241, inlinedAt: !239)
!249 = !DILocalVariable(name: "self", scope: !250, file: !217, line: 773, type: !223, align: 8)
!250 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17hcc8c90d2a00f914dE", scope: !223, file: !217, line: 330, type: !251, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !227, retainedNodes: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{!246, !223}
!253 = !{!249}
!254 = !DILocation(line: 773, column: 41, scope: !250, inlinedAt: !255)
!255 = !DILocation(line: 104, column: 9, scope: !242, inlinedAt: !239)
!256 = !DILocalVariable(name: "ptr", scope: !257, file: !217, line: 773, type: !246, align: 8)
!257 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h1676b77ae4055e3cE", scope: !223, file: !217, line: 196, type: !258, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !227, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!223, !246}
!260 = !{!256}
!261 = !DILocation(line: 773, column: 18, scope: !257, inlinedAt: !262)
!262 = !DILocation(line: 773, column: 18, scope: !216)
!263 = !DILocation(line: 774, column: 6, scope: !216)
!264 = distinct !DISubprogram(name: "from", linkageName: "_ZN122_$LT$alloc..collections..TryReserveError$u20$as$u20$core..convert..From$LT$alloc..collections..TryReserveErrorKind$GT$$GT$4from17hf590d0dc0bf2911aE", scope: !266, file: !265, line: 116, type: !268, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !294)
!265 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/alloc/src/collections/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "9cfb71cd3b32f7eb830f45a756b00675")
!266 = !DINamespace(name: "{impl#1}", scope: !267)
!267 = !DINamespace(name: "collections", scope: !211)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !273}
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryReserveError", scope: !267, file: !2, size: 128, align: 64, elements: !271, templateParams: !23, identifier: "9329beb58cfce2a468bff9d53d352901")
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !270, file: !2, baseType: !273, size: 128, align: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryReserveErrorKind", scope: !267, file: !2, size: 128, align: 64, elements: !274, templateParams: !23, identifier: "b80f03a2018170445eea4dcb9e8ba251")
!274 = !{!275}
!275 = !DICompositeType(tag: DW_TAG_variant_part, scope: !273, file: !2, size: 128, align: 64, elements: !276, templateParams: !23, identifier: "dd437972ee979c0cb5a8f1e81729b7e4", discriminator: !293)
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "CapacityOverflow", scope: !275, file: !2, baseType: !278, size: 128, align: 64, extraData: i64 0)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "CapacityOverflow", scope: !273, file: !2, size: 128, align: 64, elements: !23, identifier: "9b997f4b8909a73a8576324b89f9b258")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "AllocError", scope: !275, file: !2, baseType: !280, size: 128, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !273, file: !2, size: 128, align: 64, elements: !281, templateParams: !23, identifier: "43ad075de287371ebe4e53de3e5ecf3d")
!281 = !{!282, !292}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !280, file: !2, baseType: !283, size: 128, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !284, file: !2, size: 128, align: 64, elements: !286, templateParams: !23, identifier: "6727bf1318ffccbbbfc5e6dc0dfc8722")
!284 = !DINamespace(name: "layout", scope: !285)
!285 = !DINamespace(name: "alloc", scope: !114)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !283, file: !2, baseType: !9, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !283, file: !2, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "ValidAlign", scope: !112, file: !2, size: 64, align: 64, elements: !290, templateParams: !23, identifier: "e392ecbcb8f7df9e6beb2b20857b4b5a")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !289, file: !2, baseType: !111, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "non_exhaustive", scope: !280, file: !2, baseType: !7, align: 8)
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !2, baseType: !115, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!294 = !{!295}
!295 = !DILocalVariable(name: "kind", arg: 1, scope: !264, file: !265, line: 116, type: !273)
!296 = !DILocation(line: 116, column: 13, scope: !264)
!297 = !DILocation(line: 117, column: 9, scope: !264)
!298 = !DILocation(line: 118, column: 6, scope: !264)
!299 = !{i64 0, i64 -9223372036854775807}
!300 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h11418466094ac077E", scope: !302, file: !301, line: 118, type: !304, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !310, retainedNodes: !306)
!301 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!302 = !DINamespace(name: "backtrace", scope: !303)
!303 = !DINamespace(name: "sys_common", scope: !17)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !20}
!306 = !{!307, !308}
!307 = !DILocalVariable(name: "f", arg: 1, scope: !300, file: !301, line: 118, type: !20)
!308 = !DILocalVariable(name: "result", scope: !309, file: !301, line: 122, type: !7, align: 1)
!309 = distinct !DILexicalBlock(scope: !300, file: !301, line: 122, column: 5)
!310 = !{!311, !312}
!311 = !DITemplateTypeParameter(name: "F", type: !20)
!312 = !DITemplateTypeParameter(name: "T", type: !7)
!313 = !DILocation(line: 122, column: 9, scope: !309)
!314 = !DILocation(line: 118, column: 43, scope: !300)
!315 = !DILocalVariable(name: "dummy", scope: !316, file: !301, line: 125, type: !7, align: 1)
!316 = !DILexicalBlockFile(scope: !317, file: !301, discriminator: 0)
!317 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h3e0b8fc8971f09a8E", scope: !319, file: !318, line: 225, type: !320, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !323, retainedNodes: !322)
!318 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!319 = !DINamespace(name: "hint", scope: !114)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !7}
!322 = !{!315}
!323 = !{!312}
!324 = !DILocation(line: 125, column: 5, scope: !316, inlinedAt: !325)
!325 = !DILocation(line: 125, column: 5, scope: !309)
!326 = !DILocation(line: 122, column: 18, scope: !300)
!327 = !{i32 3372254}
!328 = !DILocation(line: 128, column: 2, scope: !300)
!329 = !DILocation(line: 128, column: 1, scope: !300)
!330 = !DILocation(line: 118, column: 1, scope: !300)
!331 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17hc5c05a1a5be45ca5E", scope: !16, file: !332, line: 139, type: !333, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !323, retainedNodes: !337)
!332 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !20, !335, !336}
!335 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !{!338, !339, !340, !341}
!338 = !DILocalVariable(name: "main", arg: 1, scope: !331, file: !332, line: 140, type: !20)
!339 = !DILocalVariable(name: "argc", arg: 2, scope: !331, file: !332, line: 141, type: !335)
!340 = !DILocalVariable(name: "argv", arg: 3, scope: !331, file: !332, line: 142, type: !336)
!341 = !DILocalVariable(name: "v", scope: !342, file: !332, line: 144, type: !335, align: 8)
!342 = distinct !DILexicalBlock(scope: !331, file: !332, line: 144, column: 5)
!343 = !DILocation(line: 140, column: 5, scope: !331)
!344 = !DILocation(line: 141, column: 5, scope: !331)
!345 = !DILocation(line: 142, column: 5, scope: !331)
!346 = !DILocation(line: 145, column: 10, scope: !331)
!347 = !DILocation(line: 145, column: 9, scope: !331)
!348 = !DILocation(line: 144, column: 17, scope: !331)
!349 = !DILocation(line: 144, column: 12, scope: !331)
!350 = !DILocation(line: 144, column: 12, scope: !342)
!351 = !DILocation(line: 150, column: 2, scope: !331)
!352 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h9976755c369c8586E", scope: !15, file: !332, line: 145, type: !353, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !323, retainedNodes: !356)
!353 = !DISubroutineType(types: !354)
!354 = !{!33, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!356 = !{!357}
!357 = !DILocalVariable(name: "main", scope: !352, file: !332, line: 140, type: !20, align: 8)
!358 = !{i64 8}
!359 = !DILocation(line: 140, column: 5, scope: !352)
!360 = !DILocalVariable(name: "self", scope: !361, file: !332, line: 145, type: !364, align: 1)
!361 = !DILexicalBlockFile(scope: !362, file: !332, discriminator: 0)
!362 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hb17ca7004e0a6245E", scope: !364, file: !363, line: 1808, type: !375, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !377)
!363 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !365, file: !2, size: 8, align: 8, elements: !366, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!365 = !DINamespace(name: "process", scope: !17)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !364, file: !2, baseType: !368, size: 8, align: 8)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !369, file: !2, size: 8, align: 8, elements: !373, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!369 = !DINamespace(name: "process_common", scope: !370)
!370 = !DINamespace(name: "process", scope: !371)
!371 = !DINamespace(name: "unix", scope: !372)
!372 = !DINamespace(name: "sys", scope: !17)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !368, file: !2, baseType: !185, size: 8, align: 8)
!375 = !DISubroutineType(types: !376)
!376 = !{!33, !364}
!377 = !{!360}
!378 = !DILocation(line: 145, column: 18, scope: !361, inlinedAt: !379)
!379 = !DILocation(line: 145, column: 18, scope: !352)
!380 = !DILocation(line: 145, column: 77, scope: !352)
!381 = !DILocalVariable(name: "self", scope: !382, file: !332, line: 145, type: !387, align: 8)
!382 = !DILexicalBlockFile(scope: !383, file: !332, discriminator: 0)
!383 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h564517f95c312c49E", scope: !368, file: !384, line: 485, type: !385, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !388)
!384 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!385 = !DISubroutineType(types: !386)
!386 = !{!33, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !368, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !{!381}
!389 = !DILocation(line: 145, column: 18, scope: !382, inlinedAt: !390)
!390 = !DILocation(line: 1809, column: 9, scope: !362, inlinedAt: !379)
!391 = !DILocation(line: 145, column: 17, scope: !352)
!392 = distinct !DISubprogram(name: "fmt<[i32; 1]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h133358f10bce4bc6E", scope: !394, file: !393, line: 2361, type: !395, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !451, retainedNodes: !448)
!393 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!394 = !DINamespace(name: "{impl#59}", scope: !184)
!395 = !DISubroutineType(types: !396)
!396 = !{!397, !414, !415}
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !398, file: !2, size: 8, align: 8, elements: !399, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!398 = !DINamespace(name: "result", scope: !114)
!399 = !{!400}
!400 = !DICompositeType(tag: DW_TAG_variant_part, scope: !397, file: !2, size: 8, align: 8, elements: !401, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !413)
!401 = !{!402, !409}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !400, file: !2, baseType: !403, size: 8, align: 8, extraData: i64 0)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !397, file: !2, size: 8, align: 8, elements: !404, templateParams: !406, identifier: "cea751326735c343faf647063a65ad14")
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !403, file: !2, baseType: !7, align: 8, offset: 8)
!406 = !{!312, !407}
!407 = !DITemplateTypeParameter(name: "E", type: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !184, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !400, file: !2, baseType: !410, size: 8, align: 8, extraData: i64 1)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !397, file: !2, size: 8, align: 8, elements: !411, templateParams: !406, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !2, baseType: !408, align: 8, offset: 8)
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !2, baseType: !185, size: 8, align: 8, flags: DIFlagArtificial)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 1]", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !184, file: !2, size: 512, align: 64, elements: !417, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!417 = !{!418, !420, !422, !423, !438, !439}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !416, file: !2, baseType: !419, size: 32, align: 32, offset: 384)
!419 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !416, file: !2, baseType: !421, size: 32, align: 32, offset: 416)
!421 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !416, file: !2, baseType: !181, size: 8, align: 8, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !416, file: !2, baseType: !424, size: 128, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !425, file: !2, size: 128, align: 64, elements: !426, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!425 = !DINamespace(name: "option", scope: !114)
!426 = !{!427}
!427 = !DICompositeType(tag: DW_TAG_variant_part, scope: !424, file: !2, size: 128, align: 64, elements: !428, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !437)
!428 = !{!429, !433}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !427, file: !2, baseType: !430, size: 128, align: 64, extraData: i64 0)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !424, file: !2, size: 128, align: 64, elements: !23, templateParams: !431, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!431 = !{!432}
!432 = !DITemplateTypeParameter(name: "T", type: !9)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !427, file: !2, baseType: !434, size: 128, align: 64, extraData: i64 1)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !424, file: !2, size: 128, align: 64, elements: !435, templateParams: !431, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !434, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, scope: !424, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !416, file: !2, baseType: !424, size: 128, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !416, file: !2, baseType: !440, size: 128, align: 64, offset: 256)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !441, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!441 = !{!442, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !440, file: !2, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !440, file: !2, baseType: !446, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !447, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !65)
!448 = !{!449, !450}
!449 = !DILocalVariable(name: "self", arg: 1, scope: !392, file: !393, line: 2361, type: !414)
!450 = !DILocalVariable(name: "f", arg: 2, scope: !392, file: !393, line: 2361, type: !415)
!451 = !{!452}
!452 = !DITemplateTypeParameter(name: "T", type: !76)
!453 = !DILocation(line: 2361, column: 20, scope: !392)
!454 = !DILocation(line: 2361, column: 27, scope: !392)
!455 = !DILocation(line: 2361, column: 71, scope: !392)
!456 = !{i64 4}
!457 = !DILocation(line: 2361, column: 62, scope: !392)
!458 = !DILocation(line: 2361, column: 84, scope: !392)
!459 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h325bf7e19275887aE", scope: !394, file: !393, line: 2361, type: !460, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !463)
!460 = !DISubroutineType(types: !461)
!461 = !{!397, !462, !415}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!463 = !{!464, !465}
!464 = !DILocalVariable(name: "self", arg: 1, scope: !459, file: !393, line: 2361, type: !462)
!465 = !DILocalVariable(name: "f", arg: 2, scope: !459, file: !393, line: 2361, type: !415)
!466 = !{!467}
!467 = !DITemplateTypeParameter(name: "T", type: !33)
!468 = !DILocation(line: 2361, column: 20, scope: !459)
!469 = !DILocation(line: 2361, column: 27, scope: !459)
!470 = !DILocation(line: 2361, column: 71, scope: !459)
!471 = !DILocation(line: 2361, column: 62, scope: !459)
!472 = !DILocation(line: 2361, column: 84, scope: !459)
!473 = distinct !DISubprogram(name: "fmt<[i32; 3]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h588532a1b3e46bfcE", scope: !394, file: !393, line: 2361, type: !474, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !480, retainedNodes: !477)
!474 = !DISubroutineType(types: !475)
!475 = !{!397, !476, !415}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 3]", baseType: !63, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !{!478, !479}
!478 = !DILocalVariable(name: "self", arg: 1, scope: !473, file: !393, line: 2361, type: !476)
!479 = !DILocalVariable(name: "f", arg: 2, scope: !473, file: !393, line: 2361, type: !415)
!480 = !{!481}
!481 = !DITemplateTypeParameter(name: "T", type: !64)
!482 = !DILocation(line: 2361, column: 20, scope: !473)
!483 = !DILocation(line: 2361, column: 27, scope: !473)
!484 = !DILocation(line: 2361, column: 71, scope: !473)
!485 = !DILocation(line: 2361, column: 62, scope: !473)
!486 = !DILocation(line: 2361, column: 84, scope: !473)
!487 = distinct !DISubprogram(name: "fmt<()>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h70f892cf23d84968E", scope: !394, file: !393, line: 2361, type: !488, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !323, retainedNodes: !491)
!488 = !DISubroutineType(types: !489)
!489 = !{!397, !490, !415}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&()", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!491 = !{!492, !493}
!492 = !DILocalVariable(name: "self", arg: 1, scope: !487, file: !393, line: 2361, type: !490)
!493 = !DILocalVariable(name: "f", arg: 2, scope: !487, file: !393, line: 2361, type: !415)
!494 = !DILocation(line: 2361, column: 20, scope: !487)
!495 = !DILocation(line: 2361, column: 27, scope: !487)
!496 = !DILocation(line: 2361, column: 71, scope: !487)
!497 = !{i64 1}
!498 = !DILocation(line: 2361, column: 62, scope: !487)
!499 = !DILocation(line: 2361, column: 84, scope: !487)
!500 = distinct !DISubprogram(name: "fmt<[i32; 10]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h8453208e0de1799fE", scope: !394, file: !393, line: 2361, type: !501, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !507, retainedNodes: !504)
!501 = !DISubroutineType(types: !502)
!502 = !{!397, !503, !415}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 10]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!504 = !{!505, !506}
!505 = !DILocalVariable(name: "self", arg: 1, scope: !500, file: !393, line: 2361, type: !503)
!506 = !DILocalVariable(name: "f", arg: 2, scope: !500, file: !393, line: 2361, type: !415)
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "T", type: !43)
!509 = !DILocation(line: 2361, column: 20, scope: !500)
!510 = !DILocation(line: 2361, column: 27, scope: !500)
!511 = !DILocation(line: 2361, column: 71, scope: !500)
!512 = !DILocation(line: 2361, column: 62, scope: !500)
!513 = !DILocation(line: 2361, column: 84, scope: !500)
!514 = distinct !DISubprogram(name: "fmt<[i32; 6]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17ha853fb7d2d322f68E", scope: !394, file: !393, line: 2361, type: !515, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !521, retainedNodes: !518)
!515 = !DISubroutineType(types: !516)
!516 = !{!397, !517, !415}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 6]", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !{!519, !520}
!519 = !DILocalVariable(name: "self", arg: 1, scope: !514, file: !393, line: 2361, type: !517)
!520 = !DILocalVariable(name: "f", arg: 2, scope: !514, file: !393, line: 2361, type: !415)
!521 = !{!522}
!522 = !DITemplateTypeParameter(name: "T", type: !100)
!523 = !DILocation(line: 2361, column: 20, scope: !514)
!524 = !DILocation(line: 2361, column: 27, scope: !514)
!525 = !DILocation(line: 2361, column: 71, scope: !514)
!526 = !DILocation(line: 2361, column: 62, scope: !514)
!527 = !DILocation(line: 2361, column: 84, scope: !514)
!528 = distinct !DISubprogram(name: "fmt<[i32; 5]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hb4053abcc1bbde9bE", scope: !394, file: !393, line: 2361, type: !529, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !535, retainedNodes: !532)
!529 = !DISubroutineType(types: !530)
!530 = !{!397, !531, !415}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 5]", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !{!533, !534}
!533 = !DILocalVariable(name: "self", arg: 1, scope: !528, file: !393, line: 2361, type: !531)
!534 = !DILocalVariable(name: "f", arg: 2, scope: !528, file: !393, line: 2361, type: !415)
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !88)
!537 = !DILocation(line: 2361, column: 20, scope: !528)
!538 = !DILocation(line: 2361, column: 27, scope: !528)
!539 = !DILocation(line: 2361, column: 71, scope: !528)
!540 = !DILocation(line: 2361, column: 62, scope: !528)
!541 = !DILocation(line: 2361, column: 84, scope: !528)
!542 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hfef8a23a17576969E", scope: !394, file: !393, line: 2361, type: !543, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !551)
!543 = !DISubroutineType(types: !544)
!544 = !{!397, !545, !415}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !546, size: 64, align: 64, dwarfAddressSpace: 0)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !547, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!547 = !{!548, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !546, file: !2, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !546, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!551 = !{!552, !553}
!552 = !DILocalVariable(name: "self", arg: 1, scope: !542, file: !393, line: 2361, type: !545)
!553 = !DILocalVariable(name: "f", arg: 2, scope: !542, file: !393, line: 2361, type: !415)
!554 = !DILocation(line: 2361, column: 20, scope: !542)
!555 = !DILocation(line: 2361, column: 27, scope: !542)
!556 = !DILocation(line: 2361, column: 71, scope: !542)
!557 = !DILocation(line: 2361, column: 62, scope: !542)
!558 = !DILocation(line: 2361, column: 84, scope: !542)
!559 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN45_$LT$$LP$$RP$$u20$as$u20$core..fmt..Debug$GT$3fmt17hcd3e8f8771e87a4cE", scope: !560, file: !393, line: 2594, type: !561, scopeLine: 2594, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !563)
!560 = !DINamespace(name: "{impl#27}", scope: !184)
!561 = !DISubroutineType(types: !562)
!562 = !{!397, !54, !415}
!563 = !{!564, !565}
!564 = !DILocalVariable(name: "self", arg: 1, scope: !559, file: !393, line: 2594, type: !54)
!565 = !DILocalVariable(name: "f", arg: 2, scope: !559, file: !393, line: 2594, type: !415)
!566 = !DILocation(line: 2594, column: 12, scope: !559)
!567 = !DILocation(line: 2594, column: 19, scope: !559)
!568 = !DILocation(line: 2595, column: 9, scope: !559)
!569 = !DILocation(line: 2596, column: 6, scope: !559)
!570 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN47_$LT$i32$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17h07e2e83ce07bcf79E", scope: !572, file: !571, line: 189, type: !575, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !577)
!571 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "a5e6372fb466d62a237d46ecffb4676a")
!572 = !DINamespace(name: "{impl#34}", scope: !573)
!573 = !DINamespace(name: "range", scope: !574)
!574 = !DINamespace(name: "iter", scope: !114)
!575 = !DISubroutineType(types: !576)
!576 = !{!33, !33, !9}
!577 = !{!578, !579}
!578 = !DILocalVariable(name: "start", arg: 1, scope: !570, file: !571, line: 189, type: !33)
!579 = !DILocalVariable(name: "n", arg: 2, scope: !570, file: !571, line: 189, type: !9)
!580 = !DILocation(line: 189, column: 37, scope: !570)
!581 = !DILocation(line: 189, column: 50, scope: !570)
!582 = !DILocation(line: 191, column: 22, scope: !570)
!583 = !DILocalVariable(name: "self", scope: !584, file: !571, line: 191, type: !33, align: 4)
!584 = !DILexicalBlockFile(scope: !585, file: !571, discriminator: 0)
!585 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$i32$GT$13unchecked_add17h38773511627d7785E", scope: !587, file: !586, line: 453, type: !589, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !591)
!586 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/int_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d4cee595ea848b5e7eb7a8ae38f492d")
!587 = !DINamespace(name: "{impl#2}", scope: !588)
!588 = !DINamespace(name: "num", scope: !114)
!589 = !DISubroutineType(types: !590)
!590 = !{!33, !33, !33}
!591 = !{!583, !592}
!592 = !DILocalVariable(name: "rhs", scope: !584, file: !571, line: 191, type: !33, align: 4)
!593 = !DILocation(line: 191, column: 22, scope: !584, inlinedAt: !582)
!594 = !DILocation(line: 191, column: 42, scope: !570)
!595 = !DILocation(line: 192, column: 10, scope: !570)
!596 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17hf1ad82ba7d10e26aE", scope: !597, file: !393, line: 2586, type: !598, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !600)
!597 = !DINamespace(name: "{impl#26}", scope: !184)
!598 = !DISubroutineType(types: !599)
!599 = !{!397, !546, !415}
!600 = !{!601, !602}
!601 = !DILocalVariable(name: "self", arg: 1, scope: !596, file: !393, line: 2586, type: !546)
!602 = !DILocalVariable(name: "f", arg: 2, scope: !596, file: !393, line: 2586, type: !415)
!603 = !DILocation(line: 2586, column: 12, scope: !596)
!604 = !DILocation(line: 2586, column: 19, scope: !596)
!605 = !DILocation(line: 2587, column: 9, scope: !596)
!606 = !DILocation(line: 2587, column: 32, scope: !596)
!607 = !DILocalVariable(name: "self", scope: !608, file: !393, line: 2587, type: !546, align: 8)
!608 = !DILexicalBlockFile(scope: !609, file: !393, discriminator: 0)
!609 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17h356e437823ae69e3E", scope: !611, file: !610, line: 734, type: !613, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !628)
!610 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!611 = !DINamespace(name: "{impl#0}", scope: !612)
!612 = !DINamespace(name: "slice", scope: !114)
!613 = !DISubroutineType(types: !614)
!614 = !{!615, !546}
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !616, file: !2, size: 128, align: 64, elements: !617, templateParams: !466, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!616 = !DINamespace(name: "iter", scope: !612)
!617 = !{!618, !623, !624}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !615, file: !2, baseType: !619, size: 64, align: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !219, file: !2, size: 64, align: 64, elements: !620, templateParams: !466, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !619, file: !2, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !615, file: !2, baseType: !622, size: 64, align: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !615, file: !2, baseType: !625, align: 8)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !235, file: !2, align: 8, elements: !23, templateParams: !626, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!626 = !{!627}
!627 = !DITemplateTypeParameter(name: "T", type: !32)
!628 = !{!607}
!629 = !DILocation(line: 2587, column: 32, scope: !608, inlinedAt: !606)
!630 = !DILocation(line: 2588, column: 6, scope: !596)
!631 = distinct !DISubprogram(name: "clone<i32, 4>", linkageName: "_ZN49_$LT$T$u20$as$u20$core..array..SpecArrayClone$GT$5clone17h07d9554687c29659E", scope: !633, file: !632, line: 366, type: !635, scopeLine: 366, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !641)
!632 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e237aff39bff30ac55984ee183267020")
!633 = !DINamespace(name: "{impl#22}", scope: !634)
!634 = !DINamespace(name: "array", scope: !114)
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !640}
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, align: 32, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 4, lowerBound: 0)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 4]", baseType: !637, size: 64, align: 64, dwarfAddressSpace: 0)
!641 = !{!642}
!642 = !DILocalVariable(name: "array", arg: 1, scope: !631, file: !632, line: 366, type: !640)
!643 = !DILocation(line: 366, column: 30, scope: !631)
!644 = !DILocation(line: 367, column: 9, scope: !631)
!645 = !DILocation(line: 368, column: 6, scope: !631)
!646 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN49_$LT$usize$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17h59e7e956e21d8993E", scope: !647, file: !571, line: 189, type: !648, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !650)
!647 = !DINamespace(name: "{impl#37}", scope: !573)
!648 = !DISubroutineType(types: !649)
!649 = !{!9, !9, !9}
!650 = !{!651, !652}
!651 = !DILocalVariable(name: "start", arg: 1, scope: !646, file: !571, line: 189, type: !9)
!652 = !DILocalVariable(name: "n", arg: 2, scope: !646, file: !571, line: 189, type: !9)
!653 = !DILocation(line: 189, column: 37, scope: !646)
!654 = !DILocation(line: 189, column: 50, scope: !646)
!655 = !DILocation(line: 191, column: 22, scope: !646)
!656 = !DILocalVariable(name: "self", scope: !657, file: !571, line: 191, type: !9, align: 8)
!657 = !DILexicalBlockFile(scope: !658, file: !571, discriminator: 0)
!658 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$13unchecked_add17h248c853f68583999E", scope: !660, file: !659, line: 463, type: !648, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !661)
!659 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "510cfe98475d713af9de72a29146058c")
!660 = !DINamespace(name: "{impl#11}", scope: !588)
!661 = !{!656, !662}
!662 = !DILocalVariable(name: "rhs", scope: !657, file: !571, line: 191, type: !9, align: 8)
!663 = !DILocation(line: 191, column: 22, scope: !657, inlinedAt: !655)
!664 = !DILocation(line: 191, column: 42, scope: !646)
!665 = !DILocation(line: 192, column: 10, scope: !646)
!666 = distinct !DISubprogram(name: "max<usize>", linkageName: "_ZN4core3cmp3Ord3max17hb944eef8168f423aE", scope: !668, file: !667, line: 800, type: !648, scopeLine: 800, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !672, retainedNodes: !669)
!667 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!668 = !DINamespace(name: "Ord", scope: !192)
!669 = !{!670, !671}
!670 = !DILocalVariable(name: "self", arg: 1, scope: !666, file: !667, line: 800, type: !9)
!671 = !DILocalVariable(name: "other", arg: 2, scope: !666, file: !667, line: 800, type: !9)
!672 = !{!673}
!673 = !DITemplateTypeParameter(name: "Self", type: !9)
!674 = !DILocation(line: 800, column: 12, scope: !666)
!675 = !DILocation(line: 800, column: 18, scope: !666)
!676 = !DILocation(line: 808, column: 15, scope: !666)
!677 = !{i8 -1, i8 2}
!678 = !DILocation(line: 812, column: 5, scope: !666)
!679 = !DILocation(line: 808, column: 9, scope: !666)
!680 = !{i8 0, i8 2}
!681 = !DILocation(line: 809, column: 49, scope: !666)
!682 = !DILocation(line: 810, column: 34, scope: !666)
!683 = !DILocation(line: 800, column: 5, scope: !666)
!684 = !DILocation(line: 812, column: 6, scope: !666)
!685 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls50_$LT$impl$u20$core..cmp..Ord$u20$for$u20$usize$GT$3cmp17h05ae9de739f93db7E", scope: !686, file: !667, line: 1436, type: !688, scopeLine: 1436, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !691)
!686 = !DINamespace(name: "{impl#55}", scope: !687)
!687 = !DINamespace(name: "impls", scope: !192)
!688 = !DISubroutineType(types: !689)
!689 = !{!191, !690, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!691 = !{!692, !693}
!692 = !DILocalVariable(name: "self", arg: 1, scope: !685, file: !667, line: 1436, type: !690)
!693 = !DILocalVariable(name: "other", arg: 2, scope: !685, file: !667, line: 1436, type: !690)
!694 = !DILocation(line: 1436, column: 24, scope: !685)
!695 = !DILocation(line: 1436, column: 31, scope: !685)
!696 = !DILocation(line: 1439, column: 24, scope: !685)
!697 = !DILocation(line: 1439, column: 32, scope: !685)
!698 = !DILocation(line: 1440, column: 29, scope: !685)
!699 = !DILocation(line: 1440, column: 38, scope: !685)
!700 = !DILocation(line: 1439, column: 41, scope: !685)
!701 = !DILocation(line: 1439, column: 21, scope: !685)
!702 = !DILocation(line: 1442, column: 18, scope: !685)
!703 = !DILocation(line: 1441, column: 28, scope: !685)
!704 = !DILocation(line: 1440, column: 26, scope: !685)
!705 = !DILocation(line: 1440, column: 47, scope: !685)
!706 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$i32$GT$2lt17h4a8da4c42e37e412E", scope: !707, file: !667, line: 1423, type: !708, scopeLine: 1423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !711)
!707 = !DINamespace(name: "{impl#72}", scope: !687)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !32, !32}
!710 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!711 = !{!712, !713}
!712 = !DILocalVariable(name: "self", arg: 1, scope: !706, file: !667, line: 1423, type: !32)
!713 = !DILocalVariable(name: "other", arg: 2, scope: !706, file: !667, line: 1423, type: !32)
!714 = !DILocation(line: 1423, column: 23, scope: !706)
!715 = !DILocation(line: 1423, column: 30, scope: !706)
!716 = !DILocation(line: 1423, column: 52, scope: !706)
!717 = !DILocation(line: 1423, column: 62, scope: !706)
!718 = !DILocation(line: 1423, column: 72, scope: !706)
!719 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls57_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$usize$GT$2lt17h803e94e7826b17f6E", scope: !720, file: !667, line: 1423, type: !721, scopeLine: 1423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !723)
!720 = !DINamespace(name: "{impl#54}", scope: !687)
!721 = !DISubroutineType(types: !722)
!722 = !{!710, !690, !690}
!723 = !{!724, !725}
!724 = !DILocalVariable(name: "self", arg: 1, scope: !719, file: !667, line: 1423, type: !690)
!725 = !DILocalVariable(name: "other", arg: 2, scope: !719, file: !667, line: 1423, type: !690)
!726 = !DILocation(line: 1423, column: 23, scope: !719)
!727 = !DILocation(line: 1423, column: 30, scope: !719)
!728 = !DILocation(line: 1423, column: 52, scope: !719)
!729 = !DILocation(line: 1423, column: 62, scope: !719)
!730 = !DILocation(line: 1423, column: 72, scope: !719)
!731 = distinct !DISubprogram(name: "eq", linkageName: "_ZN4core3cmp5impls59_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$$RP$$GT$2eq17h9b35e2cee4cb8532E", scope: !732, file: !667, line: 1345, type: !733, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !735)
!732 = !DINamespace(name: "{impl#0}", scope: !687)
!733 = !DISubroutineType(types: !734)
!734 = !{!710, !54, !54}
!735 = !{!736, !737}
!736 = !DILocalVariable(name: "self", arg: 1, scope: !731, file: !667, line: 1345, type: !54)
!737 = !DILocalVariable(name: "_other", arg: 2, scope: !731, file: !667, line: 1345, type: !54)
!738 = !DILocation(line: 1345, column: 15, scope: !731)
!739 = !DILocation(line: 1345, column: 22, scope: !731)
!740 = !DILocation(line: 1347, column: 10, scope: !731)
!741 = distinct !DISubprogram(name: "new_display<usize>", linkageName: "_ZN4core3fmt10ArgumentV111new_display17hdc27862aaaff6c82E", scope: !742, file: !393, line: 318, type: !752, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !754)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !184, file: !2, size: 128, align: 64, elements: !743, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!743 = !{!744, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !742, file: !2, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !746, size: 64, align: 64, dwarfAddressSpace: 0)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !747, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!747 = !DINamespace(name: "{extern#0}", scope: !184)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !742, file: !2, baseType: !749, size: 64, align: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !750, size: 64, align: 64, dwarfAddressSpace: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!397, !745, !415}
!752 = !DISubroutineType(types: !753)
!753 = !{!742, !690}
!754 = !{!755}
!755 = !DILocalVariable(name: "x", arg: 1, scope: !741, file: !393, line: 318, type: !690)
!756 = !DILocation(line: 318, column: 30, scope: !741)
!757 = !DILocation(line: 319, column: 23, scope: !741)
!758 = !DILocalVariable(name: "x", scope: !759, file: !393, line: 319, type: !690, align: 8)
!759 = distinct !DISubprogram(name: "new<usize>", linkageName: "_ZN4core3fmt10ArgumentV13new17h4bf2563cab0332e5E", scope: !742, file: !393, line: 329, type: !760, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !765)
!760 = !DISubroutineType(types: !761)
!761 = !{!742, !690, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&usize, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !763, size: 64, align: 64, dwarfAddressSpace: 0)
!763 = !DISubroutineType(types: !764)
!764 = !{!397, !690, !415}
!765 = !{!758, !766}
!766 = !DILocalVariable(name: "f", scope: !759, file: !393, line: 319, type: !762, align: 8)
!767 = !DILocation(line: 319, column: 13, scope: !759, inlinedAt: !768)
!768 = !DILocation(line: 319, column: 13, scope: !741)
!769 = !DILocation(line: 319, column: 26, scope: !741)
!770 = !DILocation(line: 320, column: 10, scope: !741)
!771 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hf0d3aeeaba475001E", scope: !773, file: !772, line: 185, type: !775, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !777)
!772 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!773 = !DINamespace(name: "{impl#80}", scope: !774)
!774 = !DINamespace(name: "num", scope: !184)
!775 = !DISubroutineType(types: !776)
!776 = !{!397, !32, !415}
!777 = !{!778, !779}
!778 = !DILocalVariable(name: "self", arg: 1, scope: !771, file: !772, line: 185, type: !32)
!779 = !DILocalVariable(name: "f", arg: 2, scope: !771, file: !772, line: 185, type: !415)
!780 = !DILocation(line: 185, column: 20, scope: !771)
!781 = !DILocation(line: 185, column: 27, scope: !771)
!782 = !DILocation(line: 186, column: 20, scope: !771)
!783 = !DILocation(line: 188, column: 27, scope: !771)
!784 = !DILocation(line: 187, column: 21, scope: !771)
!785 = !DILocation(line: 186, column: 17, scope: !771)
!786 = !DILocation(line: 193, column: 14, scope: !771)
!787 = !DILocation(line: 191, column: 21, scope: !771)
!788 = !DILocation(line: 189, column: 21, scope: !771)
!789 = !DILocation(line: 188, column: 24, scope: !771)
!790 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17he033867fae65c462E", scope: !792, file: !791, line: 637, type: !801, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !811, retainedNodes: !804)
!791 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !793, file: !2, size: 128, align: 64, elements: !794, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!793 = !DINamespace(name: "builders", scope: !184)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !792, file: !2, baseType: !796, size: 128, align: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !793, file: !2, size: 128, align: 64, elements: !797, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !796, file: !2, baseType: !415, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !796, file: !2, baseType: !397, size: 8, align: 8, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !796, file: !2, baseType: !710, size: 8, align: 8, offset: 72)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !803, !615}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !792, size: 64, align: 64, dwarfAddressSpace: 0)
!804 = !{!805, !806, !807, !809}
!805 = !DILocalVariable(name: "self", arg: 1, scope: !790, file: !791, line: 637, type: !803)
!806 = !DILocalVariable(name: "entries", arg: 2, scope: !790, file: !791, line: 637, type: !615)
!807 = !DILocalVariable(name: "iter", scope: !808, file: !791, line: 642, type: !615, align: 8)
!808 = distinct !DILexicalBlock(scope: !790, file: !791, line: 642, column: 9)
!809 = !DILocalVariable(name: "entry", scope: !810, file: !791, line: 642, type: !32, align: 8)
!810 = distinct !DILexicalBlock(scope: !808, file: !791, line: 642, column: 30)
!811 = !{!812, !813}
!812 = !DITemplateTypeParameter(name: "D", type: !32)
!813 = !DITemplateTypeParameter(name: "I", type: !615)
!814 = !DILocation(line: 637, column: 26, scope: !790)
!815 = !DILocation(line: 637, column: 37, scope: !790)
!816 = !DILocation(line: 642, column: 22, scope: !808)
!817 = !DILocation(line: 642, column: 13, scope: !810)
!818 = !DILocation(line: 642, column: 22, scope: !790)
!819 = !DILocation(line: 642, column: 9, scope: !808)
!820 = !DILocation(line: 642, column: 9, scope: !790)
!821 = !DILocation(line: 642, column: 13, scope: !808)
!822 = !DILocation(line: 643, column: 24, scope: !810)
!823 = !DILocation(line: 643, column: 13, scope: !810)
!824 = !DILocation(line: 644, column: 9, scope: !808)
!825 = !DILocation(line: 637, column: 5, scope: !790)
!826 = !DILocation(line: 646, column: 6, scope: !790)
!827 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h090b18600dc0d53dE", scope: !828, file: !393, line: 390, type: !892, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !23, retainedNodes: !894)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !184, file: !2, size: 384, align: 64, elements: !829, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!829 = !{!830, !841, !886}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !828, file: !2, baseType: !831, size: 128, align: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !832, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!832 = !{!833, !840}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !831, file: !2, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64, dwarfAddressSpace: 0)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !836, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!836 = !{!837, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !835, file: !2, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !835, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !831, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !828, file: !2, baseType: !842, size: 128, align: 64, offset: 128)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !425, file: !2, size: 128, align: 64, elements: !843, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!843 = !{!844}
!844 = !DICompositeType(tag: DW_TAG_variant_part, scope: !842, file: !2, size: 128, align: 64, elements: !845, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !885)
!845 = !{!846, !881}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !844, file: !2, baseType: !847, size: 128, align: 64, extraData: i64 0)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !842, file: !2, size: 128, align: 64, elements: !23, templateParams: !848, identifier: "742dbe7e160661d8ca36fcfff2574850")
!848 = !{!849}
!849 = !DITemplateTypeParameter(name: "T", type: !850)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !851, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!851 = !{!852, !880}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !850, file: !2, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64, dwarfAddressSpace: 0)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !182, file: !2, size: 448, align: 64, elements: !855, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !854, file: !2, baseType: !9, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !854, file: !2, baseType: !858, size: 384, align: 64, offset: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !182, file: !2, size: 384, align: 64, elements: !859, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!859 = !{!860, !861, !862, !863, !879}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !858, file: !2, baseType: !421, size: 32, align: 32, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !858, file: !2, baseType: !181, size: 8, align: 8, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !858, file: !2, baseType: !419, size: 32, align: 32, offset: 288)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !858, file: !2, baseType: !864, size: 128, align: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !182, file: !2, size: 128, align: 64, elements: !865, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!865 = !{!866}
!866 = !DICompositeType(tag: DW_TAG_variant_part, scope: !864, file: !2, size: 128, align: 64, elements: !867, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !878)
!867 = !{!868, !872, !876}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !866, file: !2, baseType: !869, size: 128, align: 64, extraData: i64 0)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !864, file: !2, size: 128, align: 64, elements: !870, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !869, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !866, file: !2, baseType: !873, size: 128, align: 64, extraData: i64 1)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !864, file: !2, size: 128, align: 64, elements: !874, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !873, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !866, file: !2, baseType: !877, size: 128, align: 64, extraData: i64 2)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !864, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!878 = !DIDerivedType(tag: DW_TAG_member, scope: !864, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !858, file: !2, baseType: !864, size: 128, align: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !850, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !844, file: !2, baseType: !882, size: 128, align: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !842, file: !2, size: 128, align: 64, elements: !883, templateParams: !848, identifier: "17f2fc106094349c7673abca4839c97a")
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !882, file: !2, baseType: !850, size: 128, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, scope: !842, file: !2, baseType: !115, size: 64, align: 64, flags: DIFlagArtificial)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !828, file: !2, baseType: !887, size: 128, align: 64, offset: 256)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !888, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!888 = !{!889, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !887, file: !2, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64, dwarfAddressSpace: 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !887, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!828, !831, !887}
!894 = !{!895, !896}
!895 = !DILocalVariable(name: "pieces", arg: 1, scope: !827, file: !393, line: 390, type: !831)
!896 = !DILocalVariable(name: "args", arg: 2, scope: !827, file: !393, line: 390, type: !887)
!897 = !DILocation(line: 390, column: 25, scope: !827)
!898 = !DILocation(line: 390, column: 53, scope: !827)
!899 = !DILocation(line: 391, column: 12, scope: !827)
!900 = !DILocation(line: 391, column: 56, scope: !827)
!901 = !DILocation(line: 391, column: 41, scope: !827)
!902 = !DILocation(line: 394, column: 34, scope: !827)
!903 = !DILocation(line: 394, column: 9, scope: !827)
!904 = !DILocation(line: 395, column: 6, scope: !827)
!905 = !DILocation(line: 392, column: 13, scope: !827)
!906 = distinct !DISubprogram(name: "replace<usize>", linkageName: "_ZN4core3mem7replace17h6c3152bae60ef064E", scope: !113, file: !907, line: 913, type: !908, scopeLine: 913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !911)
!907 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "27c8869548c9dcb65186c5584c2586f6")
!908 = !DISubroutineType(types: !909)
!909 = !{!9, !910, !9}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!911 = !{!912, !913, !914}
!912 = !DILocalVariable(name: "dest", arg: 1, scope: !906, file: !907, line: 913, type: !910)
!913 = !DILocalVariable(name: "src", arg: 2, scope: !906, file: !907, line: 913, type: !9)
!914 = !DILocalVariable(name: "result", scope: !915, file: !907, line: 918, type: !9, align: 8)
!915 = distinct !DILexicalBlock(scope: !906, file: !907, line: 918, column: 9)
!916 = !DILocation(line: 913, column: 25, scope: !906)
!917 = !DILocation(line: 913, column: 39, scope: !906)
!918 = !DILocalVariable(name: "src", scope: !919, file: !907, line: 919, type: !9, align: 8)
!919 = !DILexicalBlockFile(scope: !920, file: !907, discriminator: 0)
!920 = distinct !DISubprogram(name: "write<usize>", linkageName: "_ZN4core3ptr5write17ha69019febed2e8d3E", scope: !220, file: !921, line: 1296, type: !922, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !925)
!921 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!922 = !DISubroutineType(types: !923)
!923 = !{null, !924, !9}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!925 = !{!926, !918}
!926 = !DILocalVariable(name: "dst", scope: !919, file: !907, line: 919, type: !924, align: 8)
!927 = !DILocation(line: 919, column: 9, scope: !919, inlinedAt: !928)
!928 = !DILocation(line: 919, column: 9, scope: !915)
!929 = !DILocalVariable(name: "tmp", scope: !930, file: !907, line: 918, type: !939, align: 8)
!930 = !DILexicalBlockFile(scope: !931, file: !907, discriminator: 0)
!931 = distinct !DILexicalBlock(scope: !932, file: !921, line: 1107, column: 5)
!932 = distinct !DISubprogram(name: "read<usize>", linkageName: "_ZN4core3ptr4read17he3da97547a93ec4cE", scope: !220, file: !921, line: 1099, type: !933, scopeLine: 1099, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !936)
!933 = !DISubroutineType(types: !934)
!934 = !{!9, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!936 = !{!937, !929}
!937 = !DILocalVariable(name: "src", scope: !938, file: !907, line: 918, type: !935, align: 8)
!938 = !DILexicalBlockFile(scope: !932, file: !907, discriminator: 0)
!939 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<usize>", scope: !940, file: !2, size: 64, align: 64, elements: !941, templateParams: !431, identifier: "d5eca075936c223cc2b20ecedd1e4e46")
!940 = !DINamespace(name: "maybe_uninit", scope: !113)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !939, file: !2, baseType: !7, align: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !939, file: !2, baseType: !944, size: 64, align: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<usize>", scope: !945, file: !2, size: 64, align: 64, elements: !946, templateParams: !431, identifier: "446cb116741bbe0e5138064f6b058dad")
!945 = !DINamespace(name: "manually_drop", scope: !113)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !944, file: !2, baseType: !9, size: 64, align: 64)
!948 = !DILocation(line: 918, column: 22, scope: !930, inlinedAt: !949)
!949 = !DILocation(line: 918, column: 22, scope: !906)
!950 = !DILocation(line: 918, column: 32, scope: !906)
!951 = !DILocation(line: 918, column: 22, scope: !938, inlinedAt: !949)
!952 = !DILocation(line: 918, column: 22, scope: !953, inlinedAt: !958)
!953 = !DILexicalBlockFile(scope: !954, file: !907, discriminator: 0)
!954 = distinct !DISubprogram(name: "uninit<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17h2e745e384a604ae1E", scope: !939, file: !955, line: 320, type: !956, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !23)
!955 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "d75c93d9a93fe65ef19edc0e8e272278")
!956 = !DISubroutineType(types: !957)
!957 = !{!939}
!958 = !DILocation(line: 1107, column: 19, scope: !932, inlinedAt: !949)
!959 = !DILocalVariable(name: "self", scope: !960, file: !907, line: 918, type: !964, align: 8)
!960 = !DILexicalBlockFile(scope: !961, file: !907, discriminator: 0)
!961 = distinct !DISubprogram(name: "as_mut_ptr<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17h864a4117a448ea1cE", scope: !939, file: !955, line: 574, type: !962, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !965)
!962 = !DISubroutineType(types: !963)
!963 = !{!924, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<usize>", baseType: !939, size: 64, align: 64, dwarfAddressSpace: 0)
!965 = !{!959}
!966 = !DILocation(line: 918, column: 22, scope: !960, inlinedAt: !967)
!967 = !DILocation(line: 1115, column: 34, scope: !931, inlinedAt: !949)
!968 = !DILocalVariable(name: "self", scope: !969, file: !907, line: 918, type: !939, align: 8)
!969 = !DILexicalBlockFile(scope: !970, file: !907, discriminator: 0)
!970 = distinct !DISubprogram(name: "assume_init<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$11assume_init17had40c6e5fc3b57d7E", scope: !939, file: !955, line: 629, type: !971, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !981)
!971 = !DISubroutineType(types: !972)
!972 = !{!9, !939, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !974, size: 64, align: 64, dwarfAddressSpace: 0)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !975, file: !2, size: 192, align: 64, elements: !977, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!975 = !DINamespace(name: "location", scope: !976)
!976 = !DINamespace(name: "panic", scope: !114)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !974, file: !2, baseType: !835, size: 128, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !974, file: !2, baseType: !419, size: 32, align: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !974, file: !2, baseType: !419, size: 32, align: 32, offset: 160)
!981 = !{!968}
!982 = !DILocation(line: 918, column: 22, scope: !969, inlinedAt: !983)
!983 = !DILocation(line: 1116, column: 9, scope: !931, inlinedAt: !949)
!984 = !DILocalVariable(name: "slot", scope: !985, file: !907, line: 918, type: !944, align: 8)
!985 = !DILexicalBlockFile(scope: !986, file: !907, discriminator: 0)
!986 = distinct !DISubprogram(name: "into_inner<usize>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$10into_inner17h28a3c4dad5feecefE", scope: !944, file: !987, line: 88, type: !988, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !431, retainedNodes: !990)
!987 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!988 = !DISubroutineType(types: !989)
!989 = !{!9, !944}
!990 = !{!984}
!991 = !DILocation(line: 918, column: 22, scope: !985, inlinedAt: !992)
!992 = !DILocation(line: 634, column: 13, scope: !970, inlinedAt: !983)
!993 = !DILocation(line: 918, column: 13, scope: !915)
!994 = !DILocation(line: 919, column: 20, scope: !915)
!995 = !DILocation(line: 919, column: 26, scope: !915)
!996 = !DILocation(line: 922, column: 2, scope: !906)
!997 = !DILocation(line: 922, column: 1, scope: !906)
!998 = !DILocation(line: 913, column: 1, scope: !906)
!999 = distinct !DISubprogram(name: "replace<i32>", linkageName: "_ZN4core3mem7replace17hf1ca98093c8ae647E", scope: !113, file: !907, line: 913, type: !1000, scopeLine: 913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !1003)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!33, !1002, !33}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!1003 = !{!1004, !1005, !1006}
!1004 = !DILocalVariable(name: "dest", arg: 1, scope: !999, file: !907, line: 913, type: !1002)
!1005 = !DILocalVariable(name: "src", arg: 2, scope: !999, file: !907, line: 913, type: !33)
!1006 = !DILocalVariable(name: "result", scope: !1007, file: !907, line: 918, type: !33, align: 4)
!1007 = distinct !DILexicalBlock(scope: !999, file: !907, line: 918, column: 9)
!1008 = !DILocation(line: 913, column: 25, scope: !999)
!1009 = !DILocation(line: 913, column: 39, scope: !999)
!1010 = !DILocalVariable(name: "src", scope: !1011, file: !907, line: 919, type: !33, align: 4)
!1011 = !DILexicalBlockFile(scope: !1012, file: !907, discriminator: 0)
!1012 = distinct !DISubprogram(name: "write<i32>", linkageName: "_ZN4core3ptr5write17h34dd7d16af99f1a1E", scope: !220, file: !921, line: 1296, type: !1013, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !1016)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !1015, !33}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!1016 = !{!1017, !1010}
!1017 = !DILocalVariable(name: "dst", scope: !1011, file: !907, line: 919, type: !1015, align: 8)
!1018 = !DILocation(line: 919, column: 9, scope: !1011, inlinedAt: !1019)
!1019 = !DILocation(line: 919, column: 9, scope: !1007)
!1020 = !DILocalVariable(name: "tmp", scope: !1021, file: !907, line: 918, type: !1029, align: 4)
!1021 = !DILexicalBlockFile(scope: !1022, file: !907, discriminator: 0)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !921, line: 1107, column: 5)
!1023 = distinct !DISubprogram(name: "read<i32>", linkageName: "_ZN4core3ptr4read17h81cecb1df271a62bE", scope: !220, file: !921, line: 1099, type: !1024, scopeLine: 1099, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!33, !622}
!1026 = !{!1027, !1020}
!1027 = !DILocalVariable(name: "src", scope: !1028, file: !907, line: 918, type: !622, align: 8)
!1028 = !DILexicalBlockFile(scope: !1023, file: !907, discriminator: 0)
!1029 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<i32>", scope: !940, file: !2, size: 32, align: 32, elements: !1030, templateParams: !466, identifier: "749ff49970c59f5b542753e50e0baaa5")
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1029, file: !2, baseType: !7, align: 8)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1029, file: !2, baseType: !1033, size: 32, align: 32)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<i32>", scope: !945, file: !2, size: 32, align: 32, elements: !1034, templateParams: !466, identifier: "1f7a761321d649b733dfe180fca72385")
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1033, file: !2, baseType: !33, size: 32, align: 32)
!1036 = !DILocation(line: 918, column: 22, scope: !1021, inlinedAt: !1037)
!1037 = !DILocation(line: 918, column: 22, scope: !999)
!1038 = !DILocation(line: 918, column: 32, scope: !999)
!1039 = !DILocation(line: 918, column: 22, scope: !1028, inlinedAt: !1037)
!1040 = !DILocation(line: 918, column: 22, scope: !1041, inlinedAt: !1045)
!1041 = !DILexicalBlockFile(scope: !1042, file: !907, discriminator: 0)
!1042 = distinct !DISubprogram(name: "uninit<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17hd52702ddf19f108cE", scope: !1029, file: !955, line: 320, type: !1043, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !23)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1029}
!1045 = !DILocation(line: 1107, column: 19, scope: !1023, inlinedAt: !1037)
!1046 = !DILocalVariable(name: "self", scope: !1047, file: !907, line: 918, type: !1051, align: 8)
!1047 = !DILexicalBlockFile(scope: !1048, file: !907, discriminator: 0)
!1048 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17ha2a1326d5c6a0404E", scope: !1029, file: !955, line: 574, type: !1049, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !1052)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1015, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<i32>", baseType: !1029, size: 64, align: 64, dwarfAddressSpace: 0)
!1052 = !{!1046}
!1053 = !DILocation(line: 918, column: 22, scope: !1047, inlinedAt: !1054)
!1054 = !DILocation(line: 1115, column: 34, scope: !1022, inlinedAt: !1037)
!1055 = !DILocalVariable(name: "self", scope: !1056, file: !907, line: 918, type: !1029, align: 4)
!1056 = !DILexicalBlockFile(scope: !1057, file: !907, discriminator: 0)
!1057 = distinct !DISubprogram(name: "assume_init<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$11assume_init17hb002ff42b27ee5f3E", scope: !1029, file: !955, line: 629, type: !1058, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!33, !1029, !973}
!1060 = !{!1055}
!1061 = !DILocation(line: 918, column: 22, scope: !1056, inlinedAt: !1062)
!1062 = !DILocation(line: 1116, column: 9, scope: !1022, inlinedAt: !1037)
!1063 = !DILocalVariable(name: "slot", scope: !1064, file: !907, line: 918, type: !1033, align: 4)
!1064 = !DILexicalBlockFile(scope: !1065, file: !907, discriminator: 0)
!1065 = distinct !DISubprogram(name: "into_inner<i32>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$10into_inner17hf5d3e78ce9737930E", scope: !1033, file: !987, line: 88, type: !1066, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !108, templateParams: !466, retainedNodes: !1068)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!33, !1033}
!1068 = !{!1063}
!1069 = !DILocation(line: 918, column: 22, scope: !1064, inlinedAt: !1070)
!1070 = !DILocation(line: 634, column: 13, scope: !1057, inlinedAt: !1062)
!1071 = !DILocation(line: 918, column: 13, scope: !1007)
!1072 = !DILocation(line: 919, column: 20, scope: !1007)
!1073 = !DILocation(line: 919, column: 26, scope: !1007)
!1074 = !DILocation(line: 922, column: 2, scope: !999)
!1075 = !DILocation(line: 922, column: 1, scope: !999)
!1076 = !DILocation(line: 913, column: 1, scope: !999)
