; ModuleID = 'm6c0v32d04g1g1z'
source_filename = "m6c0v32d04g1g1z"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_casts.rs:43:1: 64:2]" = type {}
%"[closure@src/test_casts.rs:22:1: 27:2]" = type {}
%"[closure@src/test_casts.rs:30:1: 40:2]" = type {}
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"core::ops::range::RangeFull" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }
%"test::types::TestName" = type { i8, [39 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&[i32; 1] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 1] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "8c376f87b4817cf69c8f30bcf302b960")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 1]", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 1, lowerBound: 0)
!46 = !{i32 7, !"PIC Level", i32 2}
!47 = !{i32 7, !"PIE Level", i32 2}
!48 = !{i32 2, !"RtLibUseGOT", i32 1}
!49 = !{i32 2, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !52, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !53, globals: !76)
!52 = !DIFile(filename: "src/lib.rs/@/m6c0v32d04g1g1z", directory: "/home/calvin/git/c2rust/tests/casts")
!53 = !{!54, !65, !70}
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !55, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !60)
!55 = !DINamespace(name: "v1", scope: !56)
!56 = !DINamespace(name: "rt", scope: !57)
!57 = !DINamespace(name: "fmt", scope: !58)
!58 = !DINamespace(name: "core", scope: null)
!59 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64}
!61 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !66, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !67)
!66 = !DINamespace(name: "ffi", scope: !58)
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !71, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !72)
!71 = !DINamespace(name: "panicking", scope: !58)
!72 = !{!73, !74, !75}
!73 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!76 = !{!0, !24, !34}
!77 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h79a78290e78f0b62E", scope: !79, file: !78, line: 118, type: !81, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !87, retainedNodes: !83)
!78 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!79 = !DINamespace(name: "backtrace", scope: !80)
!80 = !DINamespace(name: "sys_common", scope: !17)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !20}
!83 = !{!84, !85}
!84 = !DILocalVariable(name: "f", arg: 1, scope: !77, file: !78, line: 118, type: !20)
!85 = !DILocalVariable(name: "result", scope: !86, file: !78, line: 122, type: !7, align: 1)
!86 = distinct !DILexicalBlock(scope: !77, file: !78, line: 122, column: 5)
!87 = !{!88, !89}
!88 = !DITemplateTypeParameter(name: "F", type: !20)
!89 = !DITemplateTypeParameter(name: "T", type: !7)
!90 = !DILocation(line: 122, column: 9, scope: !86)
!91 = !DILocation(line: 118, column: 43, scope: !77)
!92 = !DILocalVariable(name: "dummy", scope: !93, file: !78, line: 125, type: !7, align: 1)
!93 = !DILexicalBlockFile(scope: !94, file: !78, discriminator: 0)
!94 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hd5064bf98f7fc253E", scope: !96, file: !95, line: 225, type: !97, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !100, retainedNodes: !99)
!95 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!96 = !DINamespace(name: "hint", scope: !58)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !7}
!99 = !{!92}
!100 = !{!89}
!101 = !DILocation(line: 125, column: 5, scope: !93, inlinedAt: !102)
!102 = !DILocation(line: 125, column: 5, scope: !86)
!103 = !DILocation(line: 122, column: 18, scope: !77)
!104 = !{i32 3346205}
!105 = !DILocation(line: 128, column: 2, scope: !77)
!106 = !DILocation(line: 128, column: 1, scope: !77)
!107 = !DILocation(line: 118, column: 1, scope: !77)
!108 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h072e790ca12fae04E", scope: !16, file: !109, line: 139, type: !110, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !100, retainedNodes: !115)
!109 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !20, !112, !113}
!112 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !{!116, !117, !118, !119}
!116 = !DILocalVariable(name: "main", arg: 1, scope: !108, file: !109, line: 140, type: !20)
!117 = !DILocalVariable(name: "argc", arg: 2, scope: !108, file: !109, line: 141, type: !112)
!118 = !DILocalVariable(name: "argv", arg: 3, scope: !108, file: !109, line: 142, type: !113)
!119 = !DILocalVariable(name: "v", scope: !120, file: !109, line: 144, type: !112, align: 8)
!120 = distinct !DILexicalBlock(scope: !108, file: !109, line: 144, column: 5)
!121 = !DILocation(line: 140, column: 5, scope: !108)
!122 = !DILocation(line: 141, column: 5, scope: !108)
!123 = !DILocation(line: 142, column: 5, scope: !108)
!124 = !DILocation(line: 145, column: 10, scope: !108)
!125 = !DILocation(line: 145, column: 9, scope: !108)
!126 = !DILocation(line: 144, column: 17, scope: !108)
!127 = !DILocation(line: 144, column: 12, scope: !108)
!128 = !DILocation(line: 144, column: 12, scope: !120)
!129 = !DILocation(line: 150, column: 2, scope: !108)
!130 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h44f106a2a4fc35e9E", scope: !15, file: !109, line: 145, type: !131, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !100, retainedNodes: !134)
!131 = !DISubroutineType(types: !132)
!132 = !{!33, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !{!135}
!135 = !DILocalVariable(name: "main", scope: !130, file: !109, line: 140, type: !20, align: 8)
!136 = !{i64 8}
!137 = !DILocation(line: 140, column: 5, scope: !130)
!138 = !DILocalVariable(name: "self", scope: !139, file: !109, line: 145, type: !142, align: 1)
!139 = !DILexicalBlockFile(scope: !140, file: !109, discriminator: 0)
!140 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hfe7881056f80ccdcE", scope: !142, file: !141, line: 1808, type: !153, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !155)
!141 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !143, file: !2, size: 8, align: 8, elements: !144, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!143 = !DINamespace(name: "process", scope: !17)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !142, file: !2, baseType: !146, size: 8, align: 8)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !147, file: !2, size: 8, align: 8, elements: !151, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!147 = !DINamespace(name: "process_common", scope: !148)
!148 = !DINamespace(name: "process", scope: !149)
!149 = !DINamespace(name: "unix", scope: !150)
!150 = !DINamespace(name: "sys", scope: !17)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !146, file: !2, baseType: !59, size: 8, align: 8)
!153 = !DISubroutineType(types: !154)
!154 = !{!33, !142}
!155 = !{!138}
!156 = !DILocation(line: 145, column: 18, scope: !139, inlinedAt: !157)
!157 = !DILocation(line: 145, column: 18, scope: !130)
!158 = !DILocation(line: 145, column: 77, scope: !130)
!159 = !DILocalVariable(name: "self", scope: !160, file: !109, line: 145, type: !165, align: 8)
!160 = !DILexicalBlockFile(scope: !161, file: !109, discriminator: 0)
!161 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h96da8ba975619540E", scope: !146, file: !162, line: 485, type: !163, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !166)
!162 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!163 = !DISubroutineType(types: !164)
!164 = !{!33, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!166 = !{!159}
!167 = !DILocation(line: 145, column: 18, scope: !160, inlinedAt: !168)
!168 = !DILocation(line: 1809, column: 9, scope: !140, inlinedAt: !157)
!169 = !DILocation(line: 145, column: 17, scope: !130)
!170 = distinct !DISubprogram(name: "fmt<[i32; 1]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h83de856eec1c8d31E", scope: !172, file: !171, line: 2361, type: !173, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !229)
!171 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!172 = !DINamespace(name: "{impl#59}", scope: !57)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !192, !193}
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !176, file: !2, size: 8, align: 8, elements: !177, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!176 = !DINamespace(name: "result", scope: !58)
!177 = !{!178}
!178 = !DICompositeType(tag: DW_TAG_variant_part, scope: !175, file: !2, size: 8, align: 8, elements: !179, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !191)
!179 = !{!180, !187}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !178, file: !2, baseType: !181, size: 8, align: 8, extraData: i64 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !175, file: !2, size: 8, align: 8, elements: !182, templateParams: !184, identifier: "cea751326735c343faf647063a65ad14")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !181, file: !2, baseType: !7, align: 8, offset: 8)
!184 = !{!89, !185}
!185 = !DITemplateTypeParameter(name: "E", type: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !57, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !178, file: !2, baseType: !188, size: 8, align: 8, extraData: i64 1)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !175, file: !2, size: 8, align: 8, elements: !189, templateParams: !184, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !188, file: !2, baseType: !186, align: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !175, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagArtificial)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 1]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !57, file: !2, size: 512, align: 64, elements: !195, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!195 = !{!196, !198, !200, !201, !217, !218}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !2, baseType: !197, size: 32, align: 32, offset: 384)
!197 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !194, file: !2, baseType: !199, size: 32, align: 32, offset: 416)
!199 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !194, file: !2, baseType: !54, size: 8, align: 8, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !194, file: !2, baseType: !202, size: 128, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !203, file: !2, size: 128, align: 64, elements: !204, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!203 = !DINamespace(name: "option", scope: !58)
!204 = !{!205}
!205 = !DICompositeType(tag: DW_TAG_variant_part, scope: !202, file: !2, size: 128, align: 64, elements: !206, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !215)
!206 = !{!207, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !205, file: !2, baseType: !208, size: 128, align: 64, extraData: i64 0)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !202, file: !2, size: 128, align: 64, elements: !23, templateParams: !209, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!209 = !{!210}
!210 = !DITemplateTypeParameter(name: "T", type: !9)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !205, file: !2, baseType: !212, size: 128, align: 64, extraData: i64 1)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !202, file: !2, size: 128, align: 64, elements: !213, templateParams: !209, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !2, baseType: !216, size: 64, align: 64, flags: DIFlagArtificial)
!216 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !194, file: !2, baseType: !202, size: 128, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !194, file: !2, baseType: !219, size: 128, align: 64, offset: 256)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !220, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!220 = !{!221, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !219, file: !2, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !219, file: !2, baseType: !225, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3, lowerBound: 0)
!229 = !{!230, !231}
!230 = !DILocalVariable(name: "self", arg: 1, scope: !170, file: !171, line: 2361, type: !192)
!231 = !DILocalVariable(name: "f", arg: 2, scope: !170, file: !171, line: 2361, type: !193)
!232 = !{!233}
!233 = !DITemplateTypeParameter(name: "T", type: !43)
!234 = !DILocation(line: 2361, column: 20, scope: !170)
!235 = !DILocation(line: 2361, column: 27, scope: !170)
!236 = !DILocation(line: 2361, column: 71, scope: !170)
!237 = !{i64 4}
!238 = !DILocation(line: 2361, column: 62, scope: !170)
!239 = !DILocation(line: 2361, column: 84, scope: !170)
!240 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h9286560ee91a41b6E", scope: !172, file: !171, line: 2361, type: !241, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !244)
!241 = !DISubroutineType(types: !242)
!242 = !{!175, !243, !193}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !{!245, !246}
!245 = !DILocalVariable(name: "self", arg: 1, scope: !240, file: !171, line: 2361, type: !243)
!246 = !DILocalVariable(name: "f", arg: 2, scope: !240, file: !171, line: 2361, type: !193)
!247 = !{!248}
!248 = !DITemplateTypeParameter(name: "T", type: !33)
!249 = !DILocation(line: 2361, column: 20, scope: !240)
!250 = !DILocation(line: 2361, column: 27, scope: !240)
!251 = !DILocation(line: 2361, column: 71, scope: !240)
!252 = !DILocation(line: 2361, column: 62, scope: !240)
!253 = !DILocation(line: 2361, column: 84, scope: !240)
!254 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hcb7f52ea76aec3a6E", scope: !172, file: !171, line: 2361, type: !255, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !263)
!255 = !DISubroutineType(types: !256)
!256 = !{!175, !257, !193}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !258, size: 64, align: 64, dwarfAddressSpace: 0)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !259, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!259 = !{!260, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !258, file: !2, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !258, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!263 = !{!264, !265}
!264 = !DILocalVariable(name: "self", arg: 1, scope: !254, file: !171, line: 2361, type: !257)
!265 = !DILocalVariable(name: "f", arg: 2, scope: !254, file: !171, line: 2361, type: !193)
!266 = !DILocation(line: 2361, column: 20, scope: !254)
!267 = !DILocation(line: 2361, column: 27, scope: !254)
!268 = !DILocation(line: 2361, column: 71, scope: !254)
!269 = !DILocation(line: 2361, column: 62, scope: !254)
!270 = !DILocation(line: 2361, column: 84, scope: !254)
!271 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN47_$LT$i32$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17hc9f9f5140a44c15dE", scope: !273, file: !272, line: 189, type: !276, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !278)
!272 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "a5e6372fb466d62a237d46ecffb4676a")
!273 = !DINamespace(name: "{impl#34}", scope: !274)
!274 = !DINamespace(name: "range", scope: !275)
!275 = !DINamespace(name: "iter", scope: !58)
!276 = !DISubroutineType(types: !277)
!277 = !{!33, !33, !9}
!278 = !{!279, !280}
!279 = !DILocalVariable(name: "start", arg: 1, scope: !271, file: !272, line: 189, type: !33)
!280 = !DILocalVariable(name: "n", arg: 2, scope: !271, file: !272, line: 189, type: !9)
!281 = !DILocation(line: 189, column: 37, scope: !271)
!282 = !DILocation(line: 189, column: 50, scope: !271)
!283 = !DILocation(line: 191, column: 22, scope: !271)
!284 = !DILocalVariable(name: "self", scope: !285, file: !272, line: 191, type: !33, align: 4)
!285 = !DILexicalBlockFile(scope: !286, file: !272, discriminator: 0)
!286 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$i32$GT$13unchecked_add17h38773511627d7785E", scope: !288, file: !287, line: 453, type: !290, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !292)
!287 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/int_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d4cee595ea848b5e7eb7a8ae38f492d")
!288 = !DINamespace(name: "{impl#2}", scope: !289)
!289 = !DINamespace(name: "num", scope: !58)
!290 = !DISubroutineType(types: !291)
!291 = !{!33, !33, !33}
!292 = !{!284, !293}
!293 = !DILocalVariable(name: "rhs", scope: !285, file: !272, line: 191, type: !33, align: 4)
!294 = !DILocation(line: 191, column: 22, scope: !285, inlinedAt: !283)
!295 = !DILocation(line: 191, column: 42, scope: !271)
!296 = !DILocation(line: 192, column: 10, scope: !271)
!297 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17ha19edd5ed918cbbdE", scope: !298, file: !171, line: 2586, type: !299, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !301)
!298 = !DINamespace(name: "{impl#26}", scope: !57)
!299 = !DISubroutineType(types: !300)
!300 = !{!175, !258, !193}
!301 = !{!302, !303}
!302 = !DILocalVariable(name: "self", arg: 1, scope: !297, file: !171, line: 2586, type: !258)
!303 = !DILocalVariable(name: "f", arg: 2, scope: !297, file: !171, line: 2586, type: !193)
!304 = !DILocation(line: 2586, column: 12, scope: !297)
!305 = !DILocation(line: 2586, column: 19, scope: !297)
!306 = !DILocation(line: 2587, column: 9, scope: !297)
!307 = !DILocation(line: 2587, column: 32, scope: !297)
!308 = !DILocalVariable(name: "self", scope: !309, file: !171, line: 2587, type: !258, align: 8)
!309 = !DILexicalBlockFile(scope: !310, file: !171, discriminator: 0)
!310 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17h6ab32efc88dcf6d9E", scope: !312, file: !311, line: 734, type: !314, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !332)
!311 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!312 = !DINamespace(name: "{impl#0}", scope: !313)
!313 = !DINamespace(name: "slice", scope: !58)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !258}
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !317, file: !2, size: 128, align: 64, elements: !318, templateParams: !247, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!317 = !DINamespace(name: "iter", scope: !313)
!318 = !{!319, !326, !327}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !316, file: !2, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !321, file: !2, size: 64, align: 64, elements: !323, templateParams: !247, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!321 = !DINamespace(name: "non_null", scope: !322)
!322 = !DINamespace(name: "ptr", scope: !58)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !320, file: !2, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !316, file: !2, baseType: !325, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !316, file: !2, baseType: !328, align: 8)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !329, file: !2, align: 8, elements: !23, templateParams: !330, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!329 = !DINamespace(name: "marker", scope: !58)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !32)
!332 = !{!308}
!333 = !DILocation(line: 2587, column: 32, scope: !309, inlinedAt: !307)
!334 = !DILocation(line: 2588, column: 6, scope: !297)
!335 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$i32$GT$2lt17hb8466b8f3c2a7f40E", scope: !337, file: !336, line: 1423, type: !340, scopeLine: 1423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !343)
!336 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!337 = !DINamespace(name: "{impl#72}", scope: !338)
!338 = !DINamespace(name: "impls", scope: !339)
!339 = !DINamespace(name: "cmp", scope: !58)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !32, !32}
!342 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!343 = !{!344, !345}
!344 = !DILocalVariable(name: "self", arg: 1, scope: !335, file: !336, line: 1423, type: !32)
!345 = !DILocalVariable(name: "other", arg: 2, scope: !335, file: !336, line: 1423, type: !32)
!346 = !DILocation(line: 1423, column: 23, scope: !335)
!347 = !DILocation(line: 1423, column: 30, scope: !335)
!348 = !DILocation(line: 1423, column: 52, scope: !335)
!349 = !DILocation(line: 1423, column: 62, scope: !335)
!350 = !DILocation(line: 1423, column: 72, scope: !335)
!351 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h4556c415d6d5505bE", scope: !353, file: !352, line: 185, type: !355, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !357)
!352 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!353 = !DINamespace(name: "{impl#80}", scope: !354)
!354 = !DINamespace(name: "num", scope: !57)
!355 = !DISubroutineType(types: !356)
!356 = !{!175, !32, !193}
!357 = !{!358, !359}
!358 = !DILocalVariable(name: "self", arg: 1, scope: !351, file: !352, line: 185, type: !32)
!359 = !DILocalVariable(name: "f", arg: 2, scope: !351, file: !352, line: 185, type: !193)
!360 = !DILocation(line: 185, column: 20, scope: !351)
!361 = !DILocation(line: 185, column: 27, scope: !351)
!362 = !DILocation(line: 186, column: 20, scope: !351)
!363 = !DILocation(line: 188, column: 27, scope: !351)
!364 = !DILocation(line: 187, column: 21, scope: !351)
!365 = !DILocation(line: 186, column: 17, scope: !351)
!366 = !DILocation(line: 193, column: 14, scope: !351)
!367 = !{i8 0, i8 2}
!368 = !DILocation(line: 191, column: 21, scope: !351)
!369 = !DILocation(line: 189, column: 21, scope: !351)
!370 = !DILocation(line: 188, column: 24, scope: !351)
!371 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hbf9e598ad77f9931E", scope: !373, file: !372, line: 637, type: !382, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !392, retainedNodes: !385)
!372 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !374, file: !2, size: 128, align: 64, elements: !375, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!374 = !DINamespace(name: "builders", scope: !57)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !373, file: !2, baseType: !377, size: 128, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !374, file: !2, size: 128, align: 64, elements: !378, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !377, file: !2, baseType: !193, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !377, file: !2, baseType: !175, size: 8, align: 8, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !377, file: !2, baseType: !342, size: 8, align: 8, offset: 72)
!382 = !DISubroutineType(types: !383)
!383 = !{!384, !384, !316}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !373, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !{!386, !387, !388, !390}
!386 = !DILocalVariable(name: "self", arg: 1, scope: !371, file: !372, line: 637, type: !384)
!387 = !DILocalVariable(name: "entries", arg: 2, scope: !371, file: !372, line: 637, type: !316)
!388 = !DILocalVariable(name: "iter", scope: !389, file: !372, line: 642, type: !316, align: 8)
!389 = distinct !DILexicalBlock(scope: !371, file: !372, line: 642, column: 9)
!390 = !DILocalVariable(name: "entry", scope: !391, file: !372, line: 642, type: !32, align: 8)
!391 = distinct !DILexicalBlock(scope: !389, file: !372, line: 642, column: 30)
!392 = !{!393, !394}
!393 = !DITemplateTypeParameter(name: "D", type: !32)
!394 = !DITemplateTypeParameter(name: "I", type: !316)
!395 = !DILocation(line: 637, column: 26, scope: !371)
!396 = !DILocation(line: 637, column: 37, scope: !371)
!397 = !DILocation(line: 642, column: 22, scope: !389)
!398 = !DILocation(line: 642, column: 13, scope: !391)
!399 = !DILocation(line: 642, column: 22, scope: !371)
!400 = !DILocation(line: 642, column: 9, scope: !389)
!401 = !DILocation(line: 642, column: 9, scope: !371)
!402 = !DILocation(line: 642, column: 13, scope: !389)
!403 = !DILocation(line: 643, column: 24, scope: !391)
!404 = !DILocation(line: 643, column: 13, scope: !391)
!405 = !DILocation(line: 644, column: 9, scope: !389)
!406 = !DILocation(line: 637, column: 5, scope: !371)
!407 = !DILocation(line: 646, column: 6, scope: !371)
!408 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h88a4905cd0c2fb77E", scope: !409, file: !171, line: 390, type: !483, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !485)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !57, file: !2, size: 384, align: 64, elements: !410, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!410 = !{!411, !422, !467}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !409, file: !2, baseType: !412, size: 128, align: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !413, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!413 = !{!414, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !412, file: !2, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !417, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !416, file: !2, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !416, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !409, file: !2, baseType: !423, size: 128, align: 64, offset: 128)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !203, file: !2, size: 128, align: 64, elements: !424, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!424 = !{!425}
!425 = !DICompositeType(tag: DW_TAG_variant_part, scope: !423, file: !2, size: 128, align: 64, elements: !426, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !466)
!426 = !{!427, !462}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !425, file: !2, baseType: !428, size: 128, align: 64, extraData: i64 0)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !423, file: !2, size: 128, align: 64, elements: !23, templateParams: !429, identifier: "742dbe7e160661d8ca36fcfff2574850")
!429 = !{!430}
!430 = !DITemplateTypeParameter(name: "T", type: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !432, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!432 = !{!433, !461}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !431, file: !2, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64, dwarfAddressSpace: 0)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !55, file: !2, size: 448, align: 64, elements: !436, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !435, file: !2, baseType: !9, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !435, file: !2, baseType: !439, size: 384, align: 64, offset: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !55, file: !2, size: 384, align: 64, elements: !440, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!440 = !{!441, !442, !443, !444, !460}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !439, file: !2, baseType: !199, size: 32, align: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !439, file: !2, baseType: !54, size: 8, align: 8, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !439, file: !2, baseType: !197, size: 32, align: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !439, file: !2, baseType: !445, size: 128, align: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !55, file: !2, size: 128, align: 64, elements: !446, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!446 = !{!447}
!447 = !DICompositeType(tag: DW_TAG_variant_part, scope: !445, file: !2, size: 128, align: 64, elements: !448, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !459)
!448 = !{!449, !453, !457}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !447, file: !2, baseType: !450, size: 128, align: 64, extraData: i64 0)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !445, file: !2, size: 128, align: 64, elements: !451, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !450, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !447, file: !2, baseType: !454, size: 128, align: 64, extraData: i64 1)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !445, file: !2, size: 128, align: 64, elements: !455, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !447, file: !2, baseType: !458, size: 128, align: 64, extraData: i64 2)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !445, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!459 = !DIDerivedType(tag: DW_TAG_member, scope: !445, file: !2, baseType: !216, size: 64, align: 64, flags: DIFlagArtificial)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !439, file: !2, baseType: !445, size: 128, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !431, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !425, file: !2, baseType: !463, size: 128, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !423, file: !2, size: 128, align: 64, elements: !464, templateParams: !429, identifier: "17f2fc106094349c7673abca4839c97a")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !463, file: !2, baseType: !431, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, scope: !423, file: !2, baseType: !216, size: 64, align: 64, flags: DIFlagArtificial)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !409, file: !2, baseType: !468, size: 128, align: 64, offset: 256)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !469, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!469 = !{!470, !482}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !468, file: !2, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !57, file: !2, size: 128, align: 64, elements: !473, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!473 = !{!474, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !472, file: !2, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !476, size: 64, align: 64, dwarfAddressSpace: 0)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !477, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!477 = !DINamespace(name: "{extern#0}", scope: !57)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !472, file: !2, baseType: !479, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !480, size: 64, align: 64, dwarfAddressSpace: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{!175, !475, !193}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!409, !412, !468}
!485 = !{!486, !487}
!486 = !DILocalVariable(name: "pieces", arg: 1, scope: !408, file: !171, line: 390, type: !412)
!487 = !DILocalVariable(name: "args", arg: 2, scope: !408, file: !171, line: 390, type: !468)
!488 = !DILocation(line: 390, column: 25, scope: !408)
!489 = !DILocation(line: 390, column: 53, scope: !408)
!490 = !DILocation(line: 391, column: 12, scope: !408)
!491 = !DILocation(line: 391, column: 56, scope: !408)
!492 = !DILocation(line: 391, column: 41, scope: !408)
!493 = !DILocation(line: 394, column: 34, scope: !408)
!494 = !DILocation(line: 394, column: 9, scope: !408)
!495 = !DILocation(line: 395, column: 6, scope: !408)
!496 = !DILocation(line: 392, column: 13, scope: !408)
!497 = distinct !DISubprogram(name: "replace<i32>", linkageName: "_ZN4core3mem7replace17h3b26cbe452bb235dE", scope: !499, file: !498, line: 913, type: !500, scopeLine: 913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !503)
!498 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "27c8869548c9dcb65186c5584c2586f6")
!499 = !DINamespace(name: "mem", scope: !58)
!500 = !DISubroutineType(types: !501)
!501 = !{!33, !502, !33}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!503 = !{!504, !505, !506}
!504 = !DILocalVariable(name: "dest", arg: 1, scope: !497, file: !498, line: 913, type: !502)
!505 = !DILocalVariable(name: "src", arg: 2, scope: !497, file: !498, line: 913, type: !33)
!506 = !DILocalVariable(name: "result", scope: !507, file: !498, line: 918, type: !33, align: 4)
!507 = distinct !DILexicalBlock(scope: !497, file: !498, line: 918, column: 9)
!508 = !DILocation(line: 913, column: 25, scope: !497)
!509 = !DILocation(line: 913, column: 39, scope: !497)
!510 = !DILocalVariable(name: "src", scope: !511, file: !498, line: 919, type: !33, align: 4)
!511 = !DILexicalBlockFile(scope: !512, file: !498, discriminator: 0)
!512 = distinct !DISubprogram(name: "write<i32>", linkageName: "_ZN4core3ptr5write17hb9f980548e0c3d9aE", scope: !322, file: !513, line: 1296, type: !514, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !517)
!513 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!514 = !DISubroutineType(types: !515)
!515 = !{null, !516, !33}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!517 = !{!518, !510}
!518 = !DILocalVariable(name: "dst", scope: !511, file: !498, line: 919, type: !516, align: 8)
!519 = !DILocation(line: 919, column: 9, scope: !511, inlinedAt: !520)
!520 = !DILocation(line: 919, column: 9, scope: !507)
!521 = !DILocalVariable(name: "tmp", scope: !522, file: !498, line: 918, type: !530, align: 4)
!522 = !DILexicalBlockFile(scope: !523, file: !498, discriminator: 0)
!523 = distinct !DILexicalBlock(scope: !524, file: !513, line: 1107, column: 5)
!524 = distinct !DISubprogram(name: "read<i32>", linkageName: "_ZN4core3ptr4read17hd9708f0f88cf52a5E", scope: !322, file: !513, line: 1099, type: !525, scopeLine: 1099, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{!33, !325}
!527 = !{!528, !521}
!528 = !DILocalVariable(name: "src", scope: !529, file: !498, line: 918, type: !325, align: 8)
!529 = !DILexicalBlockFile(scope: !524, file: !498, discriminator: 0)
!530 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<i32>", scope: !531, file: !2, size: 32, align: 32, elements: !532, templateParams: !247, identifier: "749ff49970c59f5b542753e50e0baaa5")
!531 = !DINamespace(name: "maybe_uninit", scope: !499)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !530, file: !2, baseType: !7, align: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !530, file: !2, baseType: !535, size: 32, align: 32)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<i32>", scope: !536, file: !2, size: 32, align: 32, elements: !537, templateParams: !247, identifier: "1f7a761321d649b733dfe180fca72385")
!536 = !DINamespace(name: "manually_drop", scope: !499)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !535, file: !2, baseType: !33, size: 32, align: 32)
!539 = !DILocation(line: 918, column: 22, scope: !522, inlinedAt: !540)
!540 = !DILocation(line: 918, column: 22, scope: !497)
!541 = !DILocation(line: 918, column: 32, scope: !497)
!542 = !DILocation(line: 918, column: 22, scope: !529, inlinedAt: !540)
!543 = !DILocation(line: 918, column: 22, scope: !544, inlinedAt: !549)
!544 = !DILexicalBlockFile(scope: !545, file: !498, discriminator: 0)
!545 = distinct !DISubprogram(name: "uninit<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17hb96f2fd3e2c8ddf5E", scope: !530, file: !546, line: 320, type: !547, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !23)
!546 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "d75c93d9a93fe65ef19edc0e8e272278")
!547 = !DISubroutineType(types: !548)
!548 = !{!530}
!549 = !DILocation(line: 1107, column: 19, scope: !524, inlinedAt: !540)
!550 = !DILocalVariable(name: "self", scope: !551, file: !498, line: 918, type: !555, align: 8)
!551 = !DILexicalBlockFile(scope: !552, file: !498, discriminator: 0)
!552 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17hd06212f61667a0ceE", scope: !530, file: !546, line: 574, type: !553, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !556)
!553 = !DISubroutineType(types: !554)
!554 = !{!516, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<i32>", baseType: !530, size: 64, align: 64, dwarfAddressSpace: 0)
!556 = !{!550}
!557 = !DILocation(line: 918, column: 22, scope: !551, inlinedAt: !558)
!558 = !DILocation(line: 1115, column: 34, scope: !523, inlinedAt: !540)
!559 = !DILocalVariable(name: "self", scope: !560, file: !498, line: 918, type: !530, align: 4)
!560 = !DILexicalBlockFile(scope: !561, file: !498, discriminator: 0)
!561 = distinct !DISubprogram(name: "assume_init<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$11assume_init17h19fa1b07be285136E", scope: !530, file: !546, line: 629, type: !562, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !572)
!562 = !DISubroutineType(types: !563)
!563 = !{!33, !530, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !565, size: 64, align: 64, dwarfAddressSpace: 0)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !566, file: !2, size: 192, align: 64, elements: !568, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!566 = !DINamespace(name: "location", scope: !567)
!567 = !DINamespace(name: "panic", scope: !58)
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !565, file: !2, baseType: !416, size: 128, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !565, file: !2, baseType: !197, size: 32, align: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !565, file: !2, baseType: !197, size: 32, align: 32, offset: 160)
!572 = !{!559}
!573 = !DILocation(line: 918, column: 22, scope: !560, inlinedAt: !574)
!574 = !DILocation(line: 1116, column: 9, scope: !523, inlinedAt: !540)
!575 = !DILocalVariable(name: "slot", scope: !576, file: !498, line: 918, type: !535, align: 4)
!576 = !DILexicalBlockFile(scope: !577, file: !498, discriminator: 0)
!577 = distinct !DISubprogram(name: "into_inner<i32>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$10into_inner17h5585af04b5a23d1dE", scope: !535, file: !578, line: 88, type: !579, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !581)
!578 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!579 = !DISubroutineType(types: !580)
!580 = !{!33, !535}
!581 = !{!575}
!582 = !DILocation(line: 918, column: 22, scope: !576, inlinedAt: !583)
!583 = !DILocation(line: 634, column: 13, scope: !561, inlinedAt: !574)
!584 = !DILocation(line: 918, column: 13, scope: !507)
!585 = !DILocation(line: 919, column: 20, scope: !507)
!586 = !DILocation(line: 919, column: 26, scope: !507)
!587 = !DILocation(line: 922, column: 2, scope: !497)
!588 = !DILocation(line: 922, column: 1, scope: !497)
!589 = !DILocation(line: 913, column: 1, scope: !497)
!590 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hac02a43a8dca1fbdE", scope: !592, file: !591, line: 248, type: !595, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !601, retainedNodes: !598)
!591 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!592 = !DINamespace(name: "FnOnce", scope: !593)
!593 = !DINamespace(name: "function", scope: !594)
!594 = !DINamespace(name: "ops", scope: !58)
!595 = !DISubroutineType(types: !596)
!596 = !{!33, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!598 = !{!599, !600}
!599 = !DILocalVariable(arg: 1, scope: !590, file: !591, line: 248, type: !597)
!600 = !DILocalVariable(arg: 2, scope: !590, file: !591, line: 248, type: !7)
!601 = !{!602, !603}
!602 = !DITemplateTypeParameter(name: "Self", type: !14)
!603 = !DITemplateTypeParameter(name: "Args", type: !7)
!604 = !DILocation(line: 248, column: 5, scope: !590)
!605 = distinct !DISubprogram(name: "call_once<cast_tests::test_casts::test_identity::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h6ff6ee09dc5148aaE", scope: !592, file: !591, line: 248, type: !606, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !615, retainedNodes: !612)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !608}
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !609, file: !2, align: 8, elements: !23, identifier: "38b1afa6d0eacf527506103568ab4891")
!609 = !DINamespace(name: "test_identity", scope: !610)
!610 = !DINamespace(name: "test_casts", scope: !611)
!611 = !DINamespace(name: "cast_tests", scope: null)
!612 = !{!613, !614}
!613 = !DILocalVariable(arg: 1, scope: !605, file: !591, line: 248, type: !608)
!614 = !DILocalVariable(arg: 2, scope: !605, file: !591, line: 248, type: !7)
!615 = !{!616, !603}
!616 = !DITemplateTypeParameter(name: "Self", type: !608)
!617 = !DILocation(line: 248, column: 5, scope: !605)
!618 = distinct !DISubprogram(name: "call_once<cast_tests::test_casts::test_compiles::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he08c66db880f6f54E", scope: !592, file: !591, line: 248, type: !619, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !626, retainedNodes: !623)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !621}
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !622, file: !2, align: 8, elements: !23, identifier: "80c28e46df7d640b9b016fe92d8c8384")
!622 = !DINamespace(name: "test_compiles", scope: !610)
!623 = !{!624, !625}
!624 = !DILocalVariable(arg: 1, scope: !618, file: !591, line: 248, type: !621)
!625 = !DILocalVariable(arg: 2, scope: !618, file: !591, line: 248, type: !7)
!626 = !{!627, !603}
!627 = !DITemplateTypeParameter(name: "Self", type: !621)
!628 = !DILocation(line: 248, column: 5, scope: !618)
!629 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he3c17d0f3be39859E", scope: !592, file: !591, line: 248, type: !81, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !633, retainedNodes: !630)
!630 = !{!631, !632}
!631 = !DILocalVariable(arg: 1, scope: !629, file: !591, line: 248, type: !20)
!632 = !DILocalVariable(arg: 2, scope: !629, file: !591, line: 248, type: !7)
!633 = !{!634, !603}
!634 = !DITemplateTypeParameter(name: "Self", type: !20)
!635 = !DILocation(line: 248, column: 5, scope: !629)
!636 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf2306ea17cad641fE", scope: !592, file: !591, line: 248, type: !637, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !601, retainedNodes: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!33, !14}
!639 = !{!640, !641}
!640 = !DILocalVariable(arg: 1, scope: !636, file: !591, line: 248, type: !14)
!641 = !DILocalVariable(arg: 2, scope: !636, file: !591, line: 248, type: !7)
!642 = !DILocation(line: 248, column: 5, scope: !636)
!643 = distinct !DISubprogram(name: "call_once<cast_tests::test_casts::test_buffer::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf6580d7344fad050E", scope: !592, file: !591, line: 248, type: !644, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !651, retainedNodes: !648)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !646}
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !647, file: !2, align: 8, elements: !23, identifier: "91cc2f1bc1d4f1a07ecd352f6dd99967")
!647 = !DINamespace(name: "test_buffer", scope: !610)
!648 = !{!649, !650}
!649 = !DILocalVariable(arg: 1, scope: !643, file: !591, line: 248, type: !646)
!650 = !DILocalVariable(arg: 2, scope: !643, file: !591, line: 248, type: !7)
!651 = !{!652, !603}
!652 = !DITemplateTypeParameter(name: "Self", type: !646)
!653 = !DILocation(line: 248, column: 5, scope: !643)
!654 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17hd6ff8c04d971fdb1E", scope: !322, file: !513, line: 487, type: !655, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !330, retainedNodes: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!658 = !{!659}
!659 = !DILocalVariable(arg: 1, scope: !654, file: !513, line: 487, type: !657)
!660 = !DILocation(line: 487, column: 1, scope: !654)
!661 = distinct !DISubprogram(name: "drop_in_place<&[i32; 1]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$1$u5d$$GT$17h323055804ef359b9E", scope: !322, file: !513, line: 487, type: !662, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !667, retainedNodes: !665)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 1]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!665 = !{!666}
!666 = !DILocalVariable(arg: 1, scope: !661, file: !513, line: 487, type: !664)
!667 = !{!668}
!668 = !DITemplateTypeParameter(name: "T", type: !42)
!669 = !DILocation(line: 487, column: 1, scope: !661)
!670 = distinct !DISubprogram(name: "is_null<core::ffi::c_void>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null17hca93dd85f869cee6E", scope: !672, file: !671, line: 35, type: !674, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !679, retainedNodes: !677)
!671 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6672664af50614ec3c026afd55307af7")
!672 = !DINamespace(name: "{impl#0}", scope: !673)
!673 = !DINamespace(name: "mut_ptr", scope: !322)
!674 = !DISubroutineType(types: !675)
!675 = !{!342, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!677 = !{!678}
!678 = !DILocalVariable(name: "self", arg: 1, scope: !670, file: !671, line: 35, type: !676)
!679 = !{!680}
!680 = !DITemplateTypeParameter(name: "T", type: !65)
!681 = !DILocation(line: 35, column: 26, scope: !670)
!682 = !DILocalVariable(name: "metadata", scope: !683, file: !671, line: 38, type: !7, align: 1)
!683 = !DILexicalBlockFile(scope: !684, file: !671, discriminator: 0)
!684 = distinct !DISubprogram(name: "from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17hee43e5a53a8db2c8E", scope: !686, file: !685, line: 127, type: !687, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !693, retainedNodes: !691)
!685 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!686 = !DINamespace(name: "metadata", scope: !322)
!687 = !DISubroutineType(types: !688)
!688 = !{!689, !690, !7}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!691 = !{!692, !682}
!692 = !DILocalVariable(name: "data_address", scope: !683, file: !671, line: 38, type: !690, align: 8)
!693 = !{!694}
!694 = !DITemplateTypeParameter(name: "T", type: !59)
!695 = !DILocation(line: 38, column: 41, scope: !683, inlinedAt: !696)
!696 = !DILocation(line: 668, column: 5, scope: !697, inlinedAt: !700)
!697 = distinct !DISubprogram(name: "null_mut<u8>", linkageName: "_ZN4core3ptr8null_mut17hc724e0533c4b04baE", scope: !322, file: !513, line: 667, type: !698, scopeLine: 667, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !693, retainedNodes: !23)
!698 = !DISubroutineType(types: !699)
!699 = !{!689}
!700 = !DILocation(line: 38, column: 41, scope: !670)
!701 = !DILocation(line: 38, column: 9, scope: !670)
!702 = !DILocalVariable(name: "self", scope: !703, file: !671, line: 38, type: !689, align: 8)
!703 = distinct !DISubprogram(name: "guaranteed_eq<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$13guaranteed_eq17hf87d86195b92f00aE", scope: !672, file: !671, line: 707, type: !704, scopeLine: 707, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !693, retainedNodes: !706)
!704 = !DISubroutineType(types: !705)
!705 = !{!342, !689, !689}
!706 = !{!702, !707}
!707 = !DILocalVariable(name: "other", scope: !703, file: !671, line: 38, type: !689, align: 8)
!708 = !DILocation(line: 38, column: 9, scope: !703, inlinedAt: !701)
!709 = !DILocation(line: 38, column: 41, scope: !710, inlinedAt: !716)
!710 = !DILexicalBlockFile(scope: !711, file: !671, discriminator: 0)
!711 = distinct !DISubprogram(name: "invalid_mut<()>", linkageName: "_ZN4core3ptr11invalid_mut17h688427a764613198E", scope: !322, file: !513, line: 569, type: !712, scopeLine: 569, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !100, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{!690, !9}
!714 = !{!715}
!715 = !DILocalVariable(name: "addr", scope: !710, file: !671, line: 38, type: !9, align: 8)
!716 = !DILocation(line: 668, column: 24, scope: !697, inlinedAt: !700)
!717 = !DILocation(line: 39, column: 6, scope: !670)
!718 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h53c8e4adde443a75E", scope: !322, file: !513, line: 487, type: !719, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !723, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !597}
!721 = !{!722}
!722 = !DILocalVariable(arg: 1, scope: !718, file: !513, line: 487, type: !597)
!723 = !{!724}
!724 = !DITemplateTypeParameter(name: "T", type: !14)
!725 = !DILocation(line: 487, column: 1, scope: !718)
!726 = distinct !DISubprogram(name: "next<i32>", linkageName: "_ZN4core4iter5range101_$LT$impl$u20$core..iter..traits..iterator..Iterator$u20$for$u20$core..ops..range..Range$LT$A$GT$$GT$4next17h50410f35bb58d1ffE", scope: !727, file: !272, line: 710, type: !728, scopeLine: 710, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !751, retainedNodes: !749)
!727 = !DINamespace(name: "{impl#3}", scope: !274)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !741}
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<i32>", scope: !203, file: !2, size: 64, align: 32, elements: !731, templateParams: !23, identifier: "6bdf046ca244405c14a34b3e2d629599")
!731 = !{!732}
!732 = !DICompositeType(tag: DW_TAG_variant_part, scope: !730, file: !2, size: 64, align: 32, elements: !733, templateParams: !23, identifier: "559485cc0a180799d59c09b1983d68fc", discriminator: !740)
!733 = !{!734, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !732, file: !2, baseType: !735, size: 64, align: 32, extraData: i64 0)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !730, file: !2, size: 64, align: 32, elements: !23, templateParams: !247, identifier: "ac8a4a068b65e116120724915be2f37c")
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !732, file: !2, baseType: !737, size: 64, align: 32, extraData: i64 1)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !730, file: !2, size: 64, align: 32, elements: !738, templateParams: !247, identifier: "d6a544ac03d054cdd4d0bb540c69af89")
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !737, file: !2, baseType: !33, size: 32, align: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, scope: !730, file: !2, baseType: !197, size: 32, align: 32, flags: DIFlagArtificial)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ops::range::Range<i32>", baseType: !742, size: 64, align: 64, dwarfAddressSpace: 0)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<i32>", scope: !743, file: !2, size: 64, align: 32, elements: !744, templateParams: !747, identifier: "83ecdf3a91dfbabedf377a8d8dc77c39")
!743 = !DINamespace(name: "range", scope: !594)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !742, file: !2, baseType: !33, size: 32, align: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !742, file: !2, baseType: !33, size: 32, align: 32, offset: 32)
!747 = !{!748}
!748 = !DITemplateTypeParameter(name: "Idx", type: !33)
!749 = !{!750}
!750 = !DILocalVariable(name: "self", arg: 1, scope: !726, file: !272, line: 710, type: !741)
!751 = !{!752}
!752 = !DITemplateTypeParameter(name: "A", type: !33)
!753 = !DILocation(line: 710, column: 13, scope: !726)
!754 = !DILocation(line: 711, column: 9, scope: !726)
!755 = !DILocation(line: 712, column: 6, scope: !726)
!756 = distinct !DISubprogram(name: "fmt<i32, 1>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17hbb57126b9693a9caE", scope: !758, file: !757, line: 251, type: !760, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !762)
!757 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e237aff39bff30ac55984ee183267020")
!758 = !DINamespace(name: "{impl#12}", scope: !759)
!759 = !DINamespace(name: "array", scope: !58)
!760 = !DISubroutineType(types: !761)
!761 = !{!175, !42, !193}
!762 = !{!763, !764}
!763 = !DILocalVariable(name: "self", arg: 1, scope: !756, file: !757, line: 251, type: !42)
!764 = !DILocalVariable(name: "f", arg: 2, scope: !756, file: !757, line: 251, type: !193)
!765 = !DILocation(line: 251, column: 12, scope: !756)
!766 = !DILocation(line: 251, column: 19, scope: !756)
!767 = !DILocalVariable(name: "index", scope: !768, file: !757, line: 252, type: !772, align: 1)
!768 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 1>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17had3eec46b7891435E", scope: !769, file: !757, line: 285, type: !770, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !775, retainedNodes: !773)
!769 = !DINamespace(name: "{impl#15}", scope: !759)
!770 = !DISubroutineType(types: !771)
!771 = !{!258, !42, !772, !564}
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !743, file: !2, align: 8, elements: !23, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!773 = !{!774, !767}
!774 = !DILocalVariable(name: "self", scope: !768, file: !757, line: 252, type: !42, align: 8)
!775 = !{!248, !776}
!776 = !DITemplateTypeParameter(name: "I", type: !772)
!777 = !DILocation(line: 252, column: 27, scope: !768, inlinedAt: !778)
!778 = !DILocation(line: 252, column: 27, scope: !756)
!779 = !DILocalVariable(name: "index", scope: !780, file: !757, line: 252, type: !772, align: 1)
!780 = !DILexicalBlockFile(scope: !781, file: !757, discriminator: 0)
!781 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17h82f2bcab3e4699d0E", scope: !783, file: !782, line: 17, type: !785, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !775, retainedNodes: !787)
!782 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!783 = !DINamespace(name: "{impl#0}", scope: !784)
!784 = !DINamespace(name: "index", scope: !313)
!785 = !DISubroutineType(types: !786)
!786 = !{!258, !258, !772, !564}
!787 = !{!788, !779}
!788 = !DILocalVariable(name: "self", scope: !780, file: !757, line: 252, type: !258, align: 8)
!789 = !DILocation(line: 252, column: 27, scope: !780, inlinedAt: !790)
!790 = !DILocation(line: 286, column: 9, scope: !768, inlinedAt: !778)
!791 = !DILocalVariable(name: "self", scope: !792, file: !757, line: 252, type: !772, align: 1)
!792 = !DILexicalBlockFile(scope: !793, file: !757, discriminator: 0)
!793 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17h4468f724452de6d8E", scope: !794, file: !782, line: 432, type: !795, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !797)
!794 = !DINamespace(name: "{impl#6}", scope: !784)
!795 = !DISubroutineType(types: !796)
!796 = !{!258, !772, !258, !564}
!797 = !{!791, !798}
!798 = !DILocalVariable(name: "slice", scope: !792, file: !757, line: 252, type: !258, align: 8)
!799 = !DILocation(line: 252, column: 27, scope: !792, inlinedAt: !800)
!800 = !DILocation(line: 18, column: 9, scope: !781, inlinedAt: !790)
!801 = !DILocation(line: 252, column: 26, scope: !756)
!802 = !DILocation(line: 252, column: 9, scope: !756)
!803 = !DILocation(line: 253, column: 6, scope: !756)
!804 = distinct !DISubprogram(name: "eq<i32, i32, 1>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17h6fca5d61b7c0d2b6E", scope: !806, file: !805, line: 11, type: !808, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !813, retainedNodes: !810)
!805 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/equality.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b2a6ef978d2ec8f60a33a03ff9f5cb8")
!806 = !DINamespace(name: "{impl#0}", scope: !807)
!807 = !DINamespace(name: "equality", scope: !759)
!808 = !DISubroutineType(types: !809)
!809 = !{!342, !42, !42}
!810 = !{!811, !812}
!811 = !DILocalVariable(name: "self", arg: 1, scope: !804, file: !805, line: 11, type: !42)
!812 = !DILocalVariable(name: "other", arg: 2, scope: !804, file: !805, line: 11, type: !42)
!813 = !{!752, !814}
!814 = !DITemplateTypeParameter(name: "B", type: !33)
!815 = !DILocation(line: 11, column: 11, scope: !804)
!816 = !DILocation(line: 11, column: 18, scope: !804)
!817 = !DILocation(line: 12, column: 9, scope: !804)
!818 = !DILocation(line: 13, column: 6, scope: !804)
!819 = distinct !DISubprogram(name: "clone", linkageName: "_ZN4core5clone5impls52_$LT$impl$u20$core..clone..Clone$u20$for$u20$i32$GT$5clone17hbe9be07bb816f2bcE", scope: !821, file: !820, line: 189, type: !824, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !826)
!820 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/clone.rs", directory: "", checksumkind: CSK_MD5, checksum: "3792fef4e5cf0c1ef2457d8c192d163d")
!821 = !DINamespace(name: "{impl#14}", scope: !822)
!822 = !DINamespace(name: "impls", scope: !823)
!823 = !DINamespace(name: "clone", scope: !58)
!824 = !DISubroutineType(types: !825)
!825 = !{!33, !32}
!826 = !{!827}
!827 = !DILocalVariable(name: "self", arg: 1, scope: !819, file: !820, line: 189, type: !32)
!828 = !DILocation(line: 189, column: 30, scope: !819)
!829 = !DILocation(line: 190, column: 25, scope: !819)
!830 = !DILocation(line: 191, column: 22, scope: !819)
!831 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$10as_mut_ptr17hbe7edf4e5b84e741E", scope: !312, file: !311, line: 506, type: !832, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !838)
!832 = !DISubroutineType(types: !833)
!833 = !{!516, !834}
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i32]", file: !2, size: 128, align: 64, elements: !835, templateParams: !23, identifier: "e558f8cebf02444c46b3d01510c8747d")
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !834, file: !2, baseType: !261, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !834, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!838 = !{!839}
!839 = !DILocalVariable(name: "self", arg: 1, scope: !831, file: !311, line: 506, type: !834)
!840 = !DILocation(line: 506, column: 29, scope: !831)
!841 = !DILocation(line: 507, column: 9, scope: !831)
!842 = !DILocation(line: 508, column: 6, scope: !831)
!843 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h9d8b1d5650e14d07E", scope: !316, file: !844, line: 88, type: !314, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !845)
!844 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "36678af40fdc22d7150f6f91e11271b3")
!845 = !{!846, !847, !849}
!846 = !DILocalVariable(name: "slice", arg: 1, scope: !843, file: !844, line: 88, type: !258)
!847 = !DILocalVariable(name: "ptr", scope: !848, file: !844, line: 89, type: !325, align: 8)
!848 = distinct !DILexicalBlock(scope: !843, file: !844, line: 89, column: 9)
!849 = !DILocalVariable(name: "end", scope: !850, file: !844, line: 94, type: !325, align: 8)
!850 = distinct !DILexicalBlock(scope: !848, file: !844, line: 94, column: 13)
!851 = !DILocation(line: 88, column: 23, scope: !843)
!852 = !DILocation(line: 94, column: 17, scope: !850)
!853 = !DILocalVariable(name: "metadata", scope: !854, file: !844, line: 92, type: !7, align: 1)
!854 = !DILexicalBlockFile(scope: !855, file: !844, discriminator: 0)
!855 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h604a470a98f8c465E", scope: !686, file: !685, line: 110, type: !856, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !693, retainedNodes: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!114, !6, !7}
!858 = !{!859, !853}
!859 = !DILocalVariable(name: "data_address", scope: !854, file: !844, line: 92, type: !6, align: 8)
!860 = !DILocation(line: 92, column: 21, scope: !854, inlinedAt: !861)
!861 = !DILocation(line: 513, column: 5, scope: !862, inlinedAt: !865)
!862 = distinct !DISubprogram(name: "null<u8>", linkageName: "_ZN4core3ptr4null17he20b1b0838591e28E", scope: !322, file: !513, line: 512, type: !863, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !693, retainedNodes: !23)
!863 = !DISubroutineType(types: !864)
!864 = !{!114}
!865 = !DILocation(line: 39, column: 43, scope: !866, inlinedAt: !875)
!866 = distinct !DISubprogram(name: "is_null<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h94b3124172d9bcfdE", scope: !868, file: !867, line: 36, type: !870, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !247, retainedNodes: !872)
!867 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!868 = !DINamespace(name: "{impl#0}", scope: !869)
!869 = !DINamespace(name: "const_ptr", scope: !322)
!870 = !DISubroutineType(types: !871)
!871 = !{!342, !325}
!872 = !{!873}
!873 = !DILocalVariable(name: "self", scope: !874, file: !844, line: 92, type: !325, align: 8)
!874 = !DILexicalBlockFile(scope: !866, file: !844, discriminator: 0)
!875 = !DILocation(line: 92, column: 21, scope: !848)
!876 = !DILocation(line: 89, column: 19, scope: !843)
!877 = !DILocalVariable(name: "self", scope: !878, file: !844, line: 89, type: !258, align: 8)
!878 = !DILexicalBlockFile(scope: !879, file: !844, discriminator: 0)
