; ModuleID = '231s8p2g86e3qqkw'
source_filename = "231s8p2g86e3qqkw"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_casts.rs:46:1: 67:2]" = type {}
%"[closure@src/test_casts.rs:23:1: 28:2]" = type {}
%"[closure@src/test_casts.rs:32:1: 42:2]" = type {}
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }
%"test::types::TestName" = type { i8, [39 x i8] }
%"test::options::ShouldPanic" = type { i64, [2 x i64] }
%"test::types::TestFn" = type { i64, [2 x i64] }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [6 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !{i32 7, !"PIC Level", i32 2}
!35 = !{i32 7, !"PIE Level", i32 2}
!36 = !{i32 2, !"RtLibUseGOT", i32 1}
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !40, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !41, globals: !64)
!40 = !DIFile(filename: "src/lib.rs/@/231s8p2g86e3qqkw", directory: "/home/calvin/git/c2rust-worktrees/fenix/tests/casts")
!41 = !{!42, !53, !58}
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !43, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagEnumClass, elements: !48)
!43 = !DINamespace(name: "v1", scope: !44)
!44 = !DINamespace(name: "rt", scope: !45)
!45 = !DINamespace(name: "fmt", scope: !46)
!46 = !DINamespace(name: "core", scope: null)
!47 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !54, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagEnumClass, elements: !55)
!54 = !DINamespace(name: "ffi", scope: !46)
!55 = !{!56, !57}
!56 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !59, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagEnumClass, elements: !60)
!59 = !DINamespace(name: "panicking", scope: !46)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!64 = !{!0, !24}
!65 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h79a78290e78f0b62E", scope: !67, file: !66, line: 118, type: !69, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !75, retainedNodes: !71)
!66 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!67 = !DINamespace(name: "backtrace", scope: !68)
!68 = !DINamespace(name: "sys_common", scope: !17)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !20}
!71 = !{!72, !73}
!72 = !DILocalVariable(name: "f", arg: 1, scope: !65, file: !66, line: 118, type: !20)
!73 = !DILocalVariable(name: "result", scope: !74, file: !66, line: 122, type: !7, align: 1)
!74 = distinct !DILexicalBlock(scope: !65, file: !66, line: 122, column: 5)
!75 = !{!76, !77}
!76 = !DITemplateTypeParameter(name: "F", type: !20)
!77 = !DITemplateTypeParameter(name: "T", type: !7)
!78 = !DILocation(line: 122, column: 9, scope: !74)
!79 = !DILocation(line: 118, column: 43, scope: !65)
!80 = !DILocalVariable(name: "dummy", scope: !81, file: !66, line: 125, type: !7, align: 1)
!81 = !DILexicalBlockFile(scope: !82, file: !66, discriminator: 0)
!82 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hd5064bf98f7fc253E", scope: !84, file: !83, line: 225, type: !85, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !88, retainedNodes: !87)
!83 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!84 = !DINamespace(name: "hint", scope: !46)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !7}
!87 = !{!80}
!88 = !{!77}
!89 = !DILocation(line: 125, column: 5, scope: !81, inlinedAt: !90)
!90 = !DILocation(line: 125, column: 5, scope: !74)
!91 = !DILocation(line: 122, column: 18, scope: !65)
!92 = !{i32 3346211}
!93 = !DILocation(line: 128, column: 2, scope: !65)
!94 = !DILocation(line: 128, column: 1, scope: !65)
!95 = !DILocation(line: 118, column: 1, scope: !65)
!96 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h072e790ca12fae04E", scope: !16, file: !97, line: 139, type: !98, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !88, retainedNodes: !103)
!97 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !20, !100, !101}
!100 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !{!104, !105, !106, !107}
!104 = !DILocalVariable(name: "main", arg: 1, scope: !96, file: !97, line: 140, type: !20)
!105 = !DILocalVariable(name: "argc", arg: 2, scope: !96, file: !97, line: 141, type: !100)
!106 = !DILocalVariable(name: "argv", arg: 3, scope: !96, file: !97, line: 142, type: !101)
!107 = !DILocalVariable(name: "v", scope: !108, file: !97, line: 144, type: !100, align: 8)
!108 = distinct !DILexicalBlock(scope: !96, file: !97, line: 144, column: 5)
!109 = !DILocation(line: 140, column: 5, scope: !96)
!110 = !DILocation(line: 141, column: 5, scope: !96)
!111 = !DILocation(line: 142, column: 5, scope: !96)
!112 = !DILocation(line: 145, column: 10, scope: !96)
!113 = !DILocation(line: 145, column: 9, scope: !96)
!114 = !DILocation(line: 144, column: 17, scope: !96)
!115 = !DILocation(line: 144, column: 12, scope: !96)
!116 = !DILocation(line: 144, column: 12, scope: !108)
!117 = !DILocation(line: 150, column: 2, scope: !96)
!118 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h44f106a2a4fc35e9E", scope: !15, file: !97, line: 145, type: !119, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !88, retainedNodes: !122)
!119 = !DISubroutineType(types: !120)
!120 = !{!33, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!122 = !{!123}
!123 = !DILocalVariable(name: "main", scope: !118, file: !97, line: 140, type: !20, align: 8)
!124 = !{i64 8}
!125 = !DILocation(line: 140, column: 5, scope: !118)
!126 = !DILocalVariable(name: "self", scope: !127, file: !97, line: 145, type: !130, align: 1)
!127 = !DILexicalBlockFile(scope: !128, file: !97, discriminator: 0)
!128 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hfe7881056f80ccdcE", scope: !130, file: !129, line: 1808, type: !141, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !143)
!129 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !131, file: !2, size: 8, align: 8, elements: !132, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!131 = !DINamespace(name: "process", scope: !17)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !2, baseType: !134, size: 8, align: 8)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !135, file: !2, size: 8, align: 8, elements: !139, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!135 = !DINamespace(name: "process_common", scope: !136)
!136 = !DINamespace(name: "process", scope: !137)
!137 = !DINamespace(name: "unix", scope: !138)
!138 = !DINamespace(name: "sys", scope: !17)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !47, size: 8, align: 8)
!141 = !DISubroutineType(types: !142)
!142 = !{!33, !130}
!143 = !{!126}
!144 = !DILocation(line: 145, column: 18, scope: !127, inlinedAt: !145)
!145 = !DILocation(line: 145, column: 18, scope: !118)
!146 = !DILocation(line: 145, column: 77, scope: !118)
!147 = !DILocalVariable(name: "self", scope: !148, file: !97, line: 145, type: !153, align: 8)
!148 = !DILexicalBlockFile(scope: !149, file: !97, discriminator: 0)
!149 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h96da8ba975619540E", scope: !134, file: !150, line: 485, type: !151, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !154)
!150 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!151 = !DISubroutineType(types: !152)
!152 = !{!33, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !{!147}
!155 = !DILocation(line: 145, column: 18, scope: !148, inlinedAt: !156)
!156 = !DILocation(line: 1809, column: 9, scope: !128, inlinedAt: !145)
!157 = !DILocation(line: 145, column: 17, scope: !118)
!158 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h9286560ee91a41b6E", scope: !160, file: !159, line: 2361, type: !161, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !217)
!159 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!160 = !DINamespace(name: "{impl#59}", scope: !45)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !180, !181}
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !164, file: !2, size: 8, align: 8, elements: !165, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!164 = !DINamespace(name: "result", scope: !46)
!165 = !{!166}
!166 = !DICompositeType(tag: DW_TAG_variant_part, scope: !163, file: !2, size: 8, align: 8, elements: !167, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !179)
!167 = !{!168, !175}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !166, file: !2, baseType: !169, size: 8, align: 8, extraData: i64 0)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !163, file: !2, size: 8, align: 8, elements: !170, templateParams: !172, identifier: "cea751326735c343faf647063a65ad14")
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !169, file: !2, baseType: !7, align: 8, offset: 8)
!172 = !{!77, !173}
!173 = !DITemplateTypeParameter(name: "E", type: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !166, file: !2, baseType: !176, size: 8, align: 8, extraData: i64 1)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !163, file: !2, size: 8, align: 8, elements: !177, templateParams: !172, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !176, file: !2, baseType: !174, align: 8, offset: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagArtificial)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !45, file: !2, size: 512, align: 64, elements: !183, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!183 = !{!184, !186, !188, !189, !205, !206}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !2, baseType: !185, size: 32, align: 32, offset: 384)
!185 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !182, file: !2, baseType: !187, size: 32, align: 32, offset: 416)
!187 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !182, file: !2, baseType: !42, size: 8, align: 8, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !182, file: !2, baseType: !190, size: 128, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !191, file: !2, size: 128, align: 64, elements: !192, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!191 = !DINamespace(name: "option", scope: !46)
!192 = !{!193}
!193 = !DICompositeType(tag: DW_TAG_variant_part, scope: !190, file: !2, size: 128, align: 64, elements: !194, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !203)
!194 = !{!195, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !193, file: !2, baseType: !196, size: 128, align: 64, extraData: i64 0)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !190, file: !2, size: 128, align: 64, elements: !23, templateParams: !197, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!197 = !{!198}
!198 = !DITemplateTypeParameter(name: "T", type: !9)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !193, file: !2, baseType: !200, size: 128, align: 64, extraData: i64 1)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !190, file: !2, size: 128, align: 64, elements: !201, templateParams: !197, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !200, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, scope: !190, file: !2, baseType: !204, size: 64, align: 64, flags: DIFlagArtificial)
!204 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !182, file: !2, baseType: !190, size: 128, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !182, file: !2, baseType: !207, size: 128, align: 64, offset: 256)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !208, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!208 = !{!209, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !207, file: !2, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !207, file: !2, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 3, lowerBound: 0)
!217 = !{!218, !219}
!218 = !DILocalVariable(name: "self", arg: 1, scope: !158, file: !159, line: 2361, type: !180)
!219 = !DILocalVariable(name: "f", arg: 2, scope: !158, file: !159, line: 2361, type: !181)
!220 = !{!221}
!221 = !DITemplateTypeParameter(name: "T", type: !33)
!222 = !DILocation(line: 2361, column: 20, scope: !158)
!223 = !DILocation(line: 2361, column: 27, scope: !158)
!224 = !DILocation(line: 2361, column: 71, scope: !158)
!225 = !{i64 4}
!226 = !DILocation(line: 2361, column: 62, scope: !158)
!227 = !DILocation(line: 2361, column: 84, scope: !158)
!228 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN47_$LT$i32$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17hc9f9f5140a44c15dE", scope: !230, file: !229, line: 189, type: !233, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !235)
!229 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "a5e6372fb466d62a237d46ecffb4676a")
!230 = !DINamespace(name: "{impl#34}", scope: !231)
!231 = !DINamespace(name: "range", scope: !232)
!232 = !DINamespace(name: "iter", scope: !46)
!233 = !DISubroutineType(types: !234)
!234 = !{!33, !33, !9}
!235 = !{!236, !237}
!236 = !DILocalVariable(name: "start", arg: 1, scope: !228, file: !229, line: 189, type: !33)
!237 = !DILocalVariable(name: "n", arg: 2, scope: !228, file: !229, line: 189, type: !9)
!238 = !DILocation(line: 189, column: 37, scope: !228)
!239 = !DILocation(line: 189, column: 50, scope: !228)
!240 = !DILocation(line: 191, column: 22, scope: !228)
!241 = !DILocalVariable(name: "self", scope: !242, file: !229, line: 191, type: !33, align: 4)
!242 = !DILexicalBlockFile(scope: !243, file: !229, discriminator: 0)
!243 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$i32$GT$13unchecked_add17h38773511627d7785E", scope: !245, file: !244, line: 453, type: !247, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !249)
!244 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/int_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d4cee595ea848b5e7eb7a8ae38f492d")
!245 = !DINamespace(name: "{impl#2}", scope: !246)
!246 = !DINamespace(name: "num", scope: !46)
!247 = !DISubroutineType(types: !248)
!248 = !{!33, !33, !33}
!249 = !{!241, !250}
!250 = !DILocalVariable(name: "rhs", scope: !242, file: !229, line: 191, type: !33, align: 4)
!251 = !DILocation(line: 191, column: 22, scope: !242, inlinedAt: !240)
!252 = !DILocation(line: 191, column: 42, scope: !228)
!253 = !DILocation(line: 192, column: 10, scope: !228)
!254 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$i32$GT$2lt17hb8466b8f3c2a7f40E", scope: !256, file: !255, line: 1423, type: !259, scopeLine: 1423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !262)
!255 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!256 = !DINamespace(name: "{impl#72}", scope: !257)
!257 = !DINamespace(name: "impls", scope: !258)
!258 = !DINamespace(name: "cmp", scope: !46)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !32, !32}
!261 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!262 = !{!263, !264}
!263 = !DILocalVariable(name: "self", arg: 1, scope: !254, file: !255, line: 1423, type: !32)
!264 = !DILocalVariable(name: "other", arg: 2, scope: !254, file: !255, line: 1423, type: !32)
!265 = !DILocation(line: 1423, column: 23, scope: !254)
!266 = !DILocation(line: 1423, column: 30, scope: !254)
!267 = !DILocation(line: 1423, column: 52, scope: !254)
!268 = !DILocation(line: 1423, column: 62, scope: !254)
!269 = !DILocation(line: 1423, column: 72, scope: !254)
!270 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h4556c415d6d5505bE", scope: !272, file: !271, line: 185, type: !274, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !276)
!271 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!272 = !DINamespace(name: "{impl#80}", scope: !273)
!273 = !DINamespace(name: "num", scope: !45)
!274 = !DISubroutineType(types: !275)
!275 = !{!163, !32, !181}
!276 = !{!277, !278}
!277 = !DILocalVariable(name: "self", arg: 1, scope: !270, file: !271, line: 185, type: !32)
!278 = !DILocalVariable(name: "f", arg: 2, scope: !270, file: !271, line: 185, type: !181)
!279 = !DILocation(line: 185, column: 20, scope: !270)
!280 = !DILocation(line: 185, column: 27, scope: !270)
!281 = !DILocation(line: 186, column: 20, scope: !270)
!282 = !DILocation(line: 188, column: 27, scope: !270)
!283 = !DILocation(line: 187, column: 21, scope: !270)
!284 = !DILocation(line: 186, column: 17, scope: !270)
!285 = !DILocation(line: 193, column: 14, scope: !270)
!286 = !{i8 0, i8 2}
!287 = !DILocation(line: 191, column: 21, scope: !270)
!288 = !DILocation(line: 189, column: 21, scope: !270)
!289 = !DILocation(line: 188, column: 24, scope: !270)
!290 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h88a4905cd0c2fb77E", scope: !291, file: !159, line: 390, type: !365, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !367)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !45, file: !2, size: 384, align: 64, elements: !292, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!292 = !{!293, !304, !349}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !291, file: !2, baseType: !294, size: 128, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !295, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!295 = !{!296, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !294, file: !2, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !299, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !298, file: !2, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !298, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !294, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !291, file: !2, baseType: !305, size: 128, align: 64, offset: 128)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !191, file: !2, size: 128, align: 64, elements: !306, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!306 = !{!307}
!307 = !DICompositeType(tag: DW_TAG_variant_part, scope: !305, file: !2, size: 128, align: 64, elements: !308, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !348)
!308 = !{!309, !344}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !307, file: !2, baseType: !310, size: 128, align: 64, extraData: i64 0)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !305, file: !2, size: 128, align: 64, elements: !23, templateParams: !311, identifier: "742dbe7e160661d8ca36fcfff2574850")
!311 = !{!312}
!312 = !DITemplateTypeParameter(name: "T", type: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !314, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!314 = !{!315, !343}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !313, file: !2, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64, dwarfAddressSpace: 0)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !43, file: !2, size: 448, align: 64, elements: !318, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !317, file: !2, baseType: !9, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !317, file: !2, baseType: !321, size: 384, align: 64, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !43, file: !2, size: 384, align: 64, elements: !322, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!322 = !{!323, !324, !325, !326, !342}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !321, file: !2, baseType: !187, size: 32, align: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !321, file: !2, baseType: !42, size: 8, align: 8, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !2, baseType: !185, size: 32, align: 32, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !321, file: !2, baseType: !327, size: 128, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !43, file: !2, size: 128, align: 64, elements: !328, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!328 = !{!329}
!329 = !DICompositeType(tag: DW_TAG_variant_part, scope: !327, file: !2, size: 128, align: 64, elements: !330, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !341)
!330 = !{!331, !335, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !329, file: !2, baseType: !332, size: 128, align: 64, extraData: i64 0)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !327, file: !2, size: 128, align: 64, elements: !333, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !332, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !329, file: !2, baseType: !336, size: 128, align: 64, extraData: i64 1)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !327, file: !2, size: 128, align: 64, elements: !337, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !336, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !329, file: !2, baseType: !340, size: 128, align: 64, extraData: i64 2)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !327, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !2, baseType: !204, size: 64, align: 64, flags: DIFlagArtificial)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !321, file: !2, baseType: !327, size: 128, align: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !313, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !307, file: !2, baseType: !345, size: 128, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !305, file: !2, size: 128, align: 64, elements: !346, templateParams: !311, identifier: "17f2fc106094349c7673abca4839c97a")
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !345, file: !2, baseType: !313, size: 128, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, scope: !305, file: !2, baseType: !204, size: 64, align: 64, flags: DIFlagArtificial)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !291, file: !2, baseType: !350, size: 128, align: 64, offset: 256)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !351, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!351 = !{!352, !364}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !350, file: !2, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !45, file: !2, size: 128, align: 64, elements: !355, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!355 = !{!356, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !354, file: !2, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !358, size: 64, align: 64, dwarfAddressSpace: 0)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !359, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!359 = !DINamespace(name: "{extern#0}", scope: !45)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !354, file: !2, baseType: !361, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!362 = !DISubroutineType(types: !363)
!363 = !{!163, !357, !181}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !350, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!291, !294, !350}
!367 = !{!368, !369}
!368 = !DILocalVariable(name: "pieces", arg: 1, scope: !290, file: !159, line: 390, type: !294)
!369 = !DILocalVariable(name: "args", arg: 2, scope: !290, file: !159, line: 390, type: !350)
!370 = !DILocation(line: 390, column: 25, scope: !290)
!371 = !DILocation(line: 390, column: 53, scope: !290)
!372 = !DILocation(line: 391, column: 12, scope: !290)
!373 = !DILocation(line: 391, column: 56, scope: !290)
!374 = !DILocation(line: 391, column: 41, scope: !290)
!375 = !DILocation(line: 394, column: 34, scope: !290)
!376 = !DILocation(line: 394, column: 9, scope: !290)
!377 = !DILocation(line: 395, column: 6, scope: !290)
!378 = !DILocation(line: 392, column: 13, scope: !290)
!379 = distinct !DISubprogram(name: "replace<i32>", linkageName: "_ZN4core3mem7replace17h3b26cbe452bb235dE", scope: !381, file: !380, line: 913, type: !382, scopeLine: 913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !385)
!380 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "27c8869548c9dcb65186c5584c2586f6")
!381 = !DINamespace(name: "mem", scope: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{!33, !384, !33}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !{!386, !387, !388}
!386 = !DILocalVariable(name: "dest", arg: 1, scope: !379, file: !380, line: 913, type: !384)
!387 = !DILocalVariable(name: "src", arg: 2, scope: !379, file: !380, line: 913, type: !33)
!388 = !DILocalVariable(name: "result", scope: !389, file: !380, line: 918, type: !33, align: 4)
!389 = distinct !DILexicalBlock(scope: !379, file: !380, line: 918, column: 9)
!390 = !DILocation(line: 913, column: 25, scope: !379)
!391 = !DILocation(line: 913, column: 39, scope: !379)
!392 = !DILocalVariable(name: "src", scope: !393, file: !380, line: 919, type: !33, align: 4)
!393 = !DILexicalBlockFile(scope: !394, file: !380, discriminator: 0)
!394 = distinct !DISubprogram(name: "write<i32>", linkageName: "_ZN4core3ptr5write17hb9f980548e0c3d9aE", scope: !396, file: !395, line: 1296, type: !397, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !400)
!395 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!396 = !DINamespace(name: "ptr", scope: !46)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399, !33}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!400 = !{!401, !392}
!401 = !DILocalVariable(name: "dst", scope: !393, file: !380, line: 919, type: !399, align: 8)
!402 = !DILocation(line: 919, column: 9, scope: !393, inlinedAt: !403)
!403 = !DILocation(line: 919, column: 9, scope: !389)
!404 = !DILocalVariable(name: "tmp", scope: !405, file: !380, line: 918, type: !414, align: 4)
!405 = !DILexicalBlockFile(scope: !406, file: !380, discriminator: 0)
!406 = distinct !DILexicalBlock(scope: !407, file: !395, line: 1107, column: 5)
!407 = distinct !DISubprogram(name: "read<i32>", linkageName: "_ZN4core3ptr4read17hd9708f0f88cf52a5E", scope: !396, file: !395, line: 1099, type: !408, scopeLine: 1099, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !411)
!408 = !DISubroutineType(types: !409)
!409 = !{!33, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!411 = !{!412, !404}
!412 = !DILocalVariable(name: "src", scope: !413, file: !380, line: 918, type: !410, align: 8)
!413 = !DILexicalBlockFile(scope: !407, file: !380, discriminator: 0)
!414 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<i32>", scope: !415, file: !2, size: 32, align: 32, elements: !416, templateParams: !220, identifier: "749ff49970c59f5b542753e50e0baaa5")
!415 = !DINamespace(name: "maybe_uninit", scope: !381)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !414, file: !2, baseType: !7, align: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !414, file: !2, baseType: !419, size: 32, align: 32)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<i32>", scope: !420, file: !2, size: 32, align: 32, elements: !421, templateParams: !220, identifier: "1f7a761321d649b733dfe180fca72385")
!420 = !DINamespace(name: "manually_drop", scope: !381)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !419, file: !2, baseType: !33, size: 32, align: 32)
!423 = !DILocation(line: 918, column: 22, scope: !405, inlinedAt: !424)
!424 = !DILocation(line: 918, column: 22, scope: !379)
!425 = !DILocation(line: 918, column: 32, scope: !379)
!426 = !DILocation(line: 918, column: 22, scope: !413, inlinedAt: !424)
!427 = !DILocation(line: 918, column: 22, scope: !428, inlinedAt: !433)
!428 = !DILexicalBlockFile(scope: !429, file: !380, discriminator: 0)
!429 = distinct !DISubprogram(name: "uninit<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17hb96f2fd3e2c8ddf5E", scope: !414, file: !430, line: 320, type: !431, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !23)
!430 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "d75c93d9a93fe65ef19edc0e8e272278")
!431 = !DISubroutineType(types: !432)
!432 = !{!414}
!433 = !DILocation(line: 1107, column: 19, scope: !407, inlinedAt: !424)
!434 = !DILocalVariable(name: "self", scope: !435, file: !380, line: 918, type: !439, align: 8)
!435 = !DILexicalBlockFile(scope: !436, file: !380, discriminator: 0)
!436 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17hd06212f61667a0ceE", scope: !414, file: !430, line: 574, type: !437, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !440)
!437 = !DISubroutineType(types: !438)
!438 = !{!399, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<i32>", baseType: !414, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !{!434}
!441 = !DILocation(line: 918, column: 22, scope: !435, inlinedAt: !442)
!442 = !DILocation(line: 1115, column: 34, scope: !406, inlinedAt: !424)
!443 = !DILocalVariable(name: "self", scope: !444, file: !380, line: 918, type: !414, align: 4)
!444 = !DILexicalBlockFile(scope: !445, file: !380, discriminator: 0)
!445 = distinct !DISubprogram(name: "assume_init<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$11assume_init17h19fa1b07be285136E", scope: !414, file: !430, line: 629, type: !446, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !456)
!446 = !DISubroutineType(types: !447)
!447 = !{!33, !414, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !449, size: 64, align: 64, dwarfAddressSpace: 0)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !450, file: !2, size: 192, align: 64, elements: !452, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!450 = !DINamespace(name: "location", scope: !451)
!451 = !DINamespace(name: "panic", scope: !46)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !449, file: !2, baseType: !298, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !449, file: !2, baseType: !185, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !449, file: !2, baseType: !185, size: 32, align: 32, offset: 160)
!456 = !{!443}
!457 = !DILocation(line: 918, column: 22, scope: !444, inlinedAt: !458)
!458 = !DILocation(line: 1116, column: 9, scope: !406, inlinedAt: !424)
!459 = !DILocalVariable(name: "slot", scope: !460, file: !380, line: 918, type: !419, align: 4)
!460 = !DILexicalBlockFile(scope: !461, file: !380, discriminator: 0)
!461 = distinct !DISubprogram(name: "into_inner<i32>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$10into_inner17h5585af04b5a23d1dE", scope: !419, file: !462, line: 88, type: !463, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !465)
!462 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!463 = !DISubroutineType(types: !464)
!464 = !{!33, !419}
!465 = !{!459}
!466 = !DILocation(line: 918, column: 22, scope: !460, inlinedAt: !467)
!467 = !DILocation(line: 634, column: 13, scope: !445, inlinedAt: !458)
!468 = !DILocation(line: 918, column: 13, scope: !389)
!469 = !DILocation(line: 919, column: 20, scope: !389)
!470 = !DILocation(line: 919, column: 26, scope: !389)
!471 = !DILocation(line: 922, column: 2, scope: !379)
!472 = !DILocation(line: 922, column: 1, scope: !379)
!473 = !DILocation(line: 913, column: 1, scope: !379)
!474 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hac02a43a8dca1fbdE", scope: !476, file: !475, line: 248, type: !479, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !485, retainedNodes: !482)
!475 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!476 = !DINamespace(name: "FnOnce", scope: !477)
!477 = !DINamespace(name: "function", scope: !478)
!478 = !DINamespace(name: "ops", scope: !46)
!479 = !DISubroutineType(types: !480)
!480 = !{!33, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!482 = !{!483, !484}
!483 = !DILocalVariable(arg: 1, scope: !474, file: !475, line: 248, type: !481)
!484 = !DILocalVariable(arg: 2, scope: !474, file: !475, line: 248, type: !7)
!485 = !{!486, !487}
!486 = !DITemplateTypeParameter(name: "Self", type: !14)
!487 = !DITemplateTypeParameter(name: "Args", type: !7)
!488 = !DILocation(line: 248, column: 5, scope: !474)
!489 = distinct !DISubprogram(name: "call_once<cast_tests::test_casts::test_identity::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h6ff6ee09dc5148aaE", scope: !476, file: !475, line: 248, type: !490, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !499, retainedNodes: !496)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !493, file: !2, align: 8, elements: !23, identifier: "38b1afa6d0eacf527506103568ab4891")
!493 = !DINamespace(name: "test_identity", scope: !494)
!494 = !DINamespace(name: "test_casts", scope: !495)
!495 = !DINamespace(name: "cast_tests", scope: null)
!496 = !{!497, !498}
!497 = !DILocalVariable(arg: 1, scope: !489, file: !475, line: 248, type: !492)
!498 = !DILocalVariable(arg: 2, scope: !489, file: !475, line: 248, type: !7)
!499 = !{!500, !487}
!500 = !DITemplateTypeParameter(name: "Self", type: !492)
!501 = !DILocation(line: 248, column: 5, scope: !489)
!502 = distinct !DISubprogram(name: "call_once<cast_tests::test_casts::test_compiles::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he08c66db880f6f54E", scope: !476, file: !475, line: 248, type: !503, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !510, retainedNodes: !507)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505}
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !506, file: !2, align: 8, elements: !23, identifier: "80c28e46df7d640b9b016fe92d8c8384")
!506 = !DINamespace(name: "test_compiles", scope: !494)
!507 = !{!508, !509}
!508 = !DILocalVariable(arg: 1, scope: !502, file: !475, line: 248, type: !505)
!509 = !DILocalVariable(arg: 2, scope: !502, file: !475, line: 248, type: !7)
!510 = !{!511, !487}
!511 = !DITemplateTypeParameter(name: "Self", type: !505)
!512 = !DILocation(line: 248, column: 5, scope: !502)
!513 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he3c17d0f3be39859E", scope: !476, file: !475, line: 248, type: !69, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !517, retainedNodes: !514)
!514 = !{!515, !516}
!515 = !DILocalVariable(arg: 1, scope: !513, file: !475, line: 248, type: !20)
!516 = !DILocalVariable(arg: 2, scope: !513, file: !475, line: 248, type: !7)
!517 = !{!518, !487}
!518 = !DITemplateTypeParameter(name: "Self", type: !20)
!519 = !DILocation(line: 248, column: 5, scope: !513)
!520 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf2306ea17cad641fE", scope: !476, file: !475, line: 248, type: !521, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !485, retainedNodes: !523)
!521 = !DISubroutineType(types: !522)
!522 = !{!33, !14}
!523 = !{!524, !525}
!524 = !DILocalVariable(arg: 1, scope: !520, file: !475, line: 248, type: !14)
!525 = !DILocalVariable(arg: 2, scope: !520, file: !475, line: 248, type: !7)
!526 = !DILocation(line: 248, column: 5, scope: !520)
!527 = distinct !DISubprogram(name: "call_once<cast_tests::test_casts::test_buffer::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf6580d7344fad050E", scope: !476, file: !475, line: 248, type: !528, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !535, retainedNodes: !532)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !531, file: !2, align: 8, elements: !23, identifier: "91cc2f1bc1d4f1a07ecd352f6dd99967")
!531 = !DINamespace(name: "test_buffer", scope: !494)
!532 = !{!533, !534}
!533 = !DILocalVariable(arg: 1, scope: !527, file: !475, line: 248, type: !530)
!534 = !DILocalVariable(arg: 2, scope: !527, file: !475, line: 248, type: !7)
!535 = !{!536, !487}
!536 = !DITemplateTypeParameter(name: "Self", type: !530)
!537 = !DILocation(line: 248, column: 5, scope: !527)
!538 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17hd6ff8c04d971fdb1E", scope: !396, file: !395, line: 487, type: !539, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !544, retainedNodes: !542)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!542 = !{!543}
!543 = !DILocalVariable(arg: 1, scope: !538, file: !395, line: 487, type: !541)
!544 = !{!545}
!545 = !DITemplateTypeParameter(name: "T", type: !32)
!546 = !DILocation(line: 487, column: 1, scope: !538)
!547 = distinct !DISubprogram(name: "is_null<core::ffi::c_void>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null17hca93dd85f869cee6E", scope: !549, file: !548, line: 35, type: !551, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !556, retainedNodes: !554)
!548 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6672664af50614ec3c026afd55307af7")
!549 = !DINamespace(name: "{impl#0}", scope: !550)
!550 = !DINamespace(name: "mut_ptr", scope: !396)
!551 = !DISubroutineType(types: !552)
!552 = !{!261, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!554 = !{!555}
!555 = !DILocalVariable(name: "self", arg: 1, scope: !547, file: !548, line: 35, type: !553)
!556 = !{!557}
!557 = !DITemplateTypeParameter(name: "T", type: !53)
!558 = !DILocation(line: 35, column: 26, scope: !547)
!559 = !DILocalVariable(name: "metadata", scope: !560, file: !548, line: 38, type: !7, align: 1)
!560 = !DILexicalBlockFile(scope: !561, file: !548, discriminator: 0)
!561 = distinct !DISubprogram(name: "from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17hee43e5a53a8db2c8E", scope: !563, file: !562, line: 127, type: !564, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !570, retainedNodes: !568)
!562 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!563 = !DINamespace(name: "metadata", scope: !396)
!564 = !DISubroutineType(types: !565)
!565 = !{!566, !567, !7}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !{!569, !559}
!569 = !DILocalVariable(name: "data_address", scope: !560, file: !548, line: 38, type: !567, align: 8)
!570 = !{!571}
!571 = !DITemplateTypeParameter(name: "T", type: !47)
!572 = !DILocation(line: 38, column: 41, scope: !560, inlinedAt: !573)
!573 = !DILocation(line: 668, column: 5, scope: !574, inlinedAt: !577)
!574 = distinct !DISubprogram(name: "null_mut<u8>", linkageName: "_ZN4core3ptr8null_mut17hc724e0533c4b04baE", scope: !396, file: !395, line: 667, type: !575, scopeLine: 667, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !570, retainedNodes: !23)
!575 = !DISubroutineType(types: !576)
!576 = !{!566}
!577 = !DILocation(line: 38, column: 41, scope: !547)
!578 = !DILocation(line: 38, column: 9, scope: !547)
!579 = !DILocalVariable(name: "self", scope: !580, file: !548, line: 38, type: !566, align: 8)
!580 = distinct !DISubprogram(name: "guaranteed_eq<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$13guaranteed_eq17hf87d86195b92f00aE", scope: !549, file: !548, line: 707, type: !581, scopeLine: 707, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !570, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!261, !566, !566}
!583 = !{!579, !584}
!584 = !DILocalVariable(name: "other", scope: !580, file: !548, line: 38, type: !566, align: 8)
!585 = !DILocation(line: 38, column: 9, scope: !580, inlinedAt: !578)
!586 = !DILocation(line: 38, column: 41, scope: !587, inlinedAt: !593)
!587 = !DILexicalBlockFile(scope: !588, file: !548, discriminator: 0)
!588 = distinct !DISubprogram(name: "invalid_mut<()>", linkageName: "_ZN4core3ptr11invalid_mut17h688427a764613198E", scope: !396, file: !395, line: 569, type: !589, scopeLine: 569, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !88, retainedNodes: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{!567, !9}
!591 = !{!592}
!592 = !DILocalVariable(name: "addr", scope: !587, file: !548, line: 38, type: !9, align: 8)
!593 = !DILocation(line: 668, column: 24, scope: !574, inlinedAt: !577)
!594 = !DILocation(line: 39, column: 6, scope: !547)
!595 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h53c8e4adde443a75E", scope: !396, file: !395, line: 487, type: !596, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !600, retainedNodes: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !481}
!598 = !{!599}
!599 = !DILocalVariable(arg: 1, scope: !595, file: !395, line: 487, type: !481)
!600 = !{!601}
!601 = !DITemplateTypeParameter(name: "T", type: !14)
!602 = !DILocation(line: 487, column: 1, scope: !595)
!603 = distinct !DISubprogram(name: "next<i32>", linkageName: "_ZN4core4iter5range101_$LT$impl$u20$core..iter..traits..iterator..Iterator$u20$for$u20$core..ops..range..Range$LT$A$GT$$GT$4next17h50410f35bb58d1ffE", scope: !604, file: !229, line: 710, type: !605, scopeLine: 710, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !628, retainedNodes: !626)
!604 = !DINamespace(name: "{impl#3}", scope: !231)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !618}
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<i32>", scope: !191, file: !2, size: 64, align: 32, elements: !608, templateParams: !23, identifier: "6bdf046ca244405c14a34b3e2d629599")
!608 = !{!609}
!609 = !DICompositeType(tag: DW_TAG_variant_part, scope: !607, file: !2, size: 64, align: 32, elements: !610, templateParams: !23, identifier: "559485cc0a180799d59c09b1983d68fc", discriminator: !617)
!610 = !{!611, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !609, file: !2, baseType: !612, size: 64, align: 32, extraData: i64 0)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !607, file: !2, size: 64, align: 32, elements: !23, templateParams: !220, identifier: "ac8a4a068b65e116120724915be2f37c")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !609, file: !2, baseType: !614, size: 64, align: 32, extraData: i64 1)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !607, file: !2, size: 64, align: 32, elements: !615, templateParams: !220, identifier: "d6a544ac03d054cdd4d0bb540c69af89")
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !614, file: !2, baseType: !33, size: 32, align: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, scope: !607, file: !2, baseType: !185, size: 32, align: 32, flags: DIFlagArtificial)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ops::range::Range<i32>", baseType: !619, size: 64, align: 64, dwarfAddressSpace: 0)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<i32>", scope: !620, file: !2, size: 64, align: 32, elements: !621, templateParams: !624, identifier: "83ecdf3a91dfbabedf377a8d8dc77c39")
!620 = !DINamespace(name: "range", scope: !478)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !619, file: !2, baseType: !33, size: 32, align: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !619, file: !2, baseType: !33, size: 32, align: 32, offset: 32)
!624 = !{!625}
!625 = !DITemplateTypeParameter(name: "Idx", type: !33)
!626 = !{!627}
!627 = !DILocalVariable(name: "self", arg: 1, scope: !603, file: !229, line: 710, type: !618)
!628 = !{!629}
!629 = !DITemplateTypeParameter(name: "A", type: !33)
!630 = !DILocation(line: 710, column: 13, scope: !603)
!631 = !DILocation(line: 711, column: 9, scope: !603)
!632 = !DILocation(line: 712, column: 6, scope: !603)
!633 = distinct !DISubprogram(name: "clone", linkageName: "_ZN4core5clone5impls52_$LT$impl$u20$core..clone..Clone$u20$for$u20$i32$GT$5clone17hbe9be07bb816f2bcE", scope: !635, file: !634, line: 189, type: !638, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !640)
!634 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/clone.rs", directory: "", checksumkind: CSK_MD5, checksum: "3792fef4e5cf0c1ef2457d8c192d163d")
!635 = !DINamespace(name: "{impl#14}", scope: !636)
!636 = !DINamespace(name: "impls", scope: !637)
!637 = !DINamespace(name: "clone", scope: !46)
!638 = !DISubroutineType(types: !639)
!639 = !{!33, !32}
!640 = !{!641}
!641 = !DILocalVariable(name: "self", arg: 1, scope: !633, file: !634, line: 189, type: !32)
!642 = !DILocation(line: 189, column: 30, scope: !633)
!643 = !DILocation(line: 190, column: 25, scope: !633)
!644 = !DILocation(line: 191, column: 22, scope: !633)
!645 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$10as_mut_ptr17hbe7edf4e5b84e741E", scope: !647, file: !646, line: 506, type: !649, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !220, retainedNodes: !656)
!646 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!647 = !DINamespace(name: "{impl#0}", scope: !648)
!648 = !DINamespace(name: "slice", scope: !46)
!649 = !DISubroutineType(types: !650)
!650 = !{!399, !651}
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i32]", file: !2, size: 128, align: 64, elements: !652, templateParams: !23, identifier: "e558f8cebf02444c46b3d01510c8747d")
!652 = !{!653, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !651, file: !2, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!656 = !{!657}
!657 = !DILocalVariable(name: "self", arg: 1, scope: !645, file: !646, line: 506, type: !651)
!658 = !DILocation(line: 506, column: 29, scope: !645)
!659 = !DILocation(line: 507, column: 9, scope: !645)
!660 = !DILocation(line: 508, column: 6, scope: !645)
!661 = distinct !DISubprogram(name: "expect<unsafe extern \22C\22 fn(i32) -> i32>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17hcf208e171faec746E", scope: !663, file: !662, line: 735, type: !679, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !669, retainedNodes: !681)
!662 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "86a5483c3993f03690545387e943de77")
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(i32) -> i32>", scope: !191, file: !2, size: 64, align: 64, elements: !664, templateParams: !23, identifier: "9399e3c7a046050be1a25c2f86faa0a9")
!664 = !{!665}
!665 = !DICompositeType(tag: DW_TAG_variant_part, scope: !663, file: !2, size: 64, align: 64, elements: !666, templateParams: !23, identifier: "41d405e6a675dc61193c3c55c0f7ca9e", discriminator: !678)
!666 = !{!667, !674}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !665, file: !2, baseType: !668, size: 64, align: 64, extraData: i64 0)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !663, file: !2, size: 64, align: 64, elements: !23, templateParams: !669, identifier: "b659d10ae967d273a637e48588994c4f")
!669 = !{!670}
!670 = !DITemplateTypeParameter(name: "T", type: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(i32) -> i32", baseType: !672, size: 64, align: 64, dwarfAddressSpace: 0)
!672 = !DISubroutineType(types: !673)
!673 = !{!33, !33}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !665, file: !2, baseType: !675, size: 64, align: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !663, file: !2, size: 64, align: 64, elements: !676, templateParams: !669, identifier: "7a912f6ce04a0553fd034dcf993020a2")
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !675, file: !2, baseType: !671, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !2, baseType: !204, size: 64, align: 64, flags: DIFlagArtificial)
!679 = !DISubroutineType(types: !680)
!680 = !{!671, !663, !298, !448}
!681 = !{!682, !683, !684}
!682 = !DILocalVariable(name: "self", arg: 1, scope: !661, file: !662, line: 735, type: !663)
!683 = !DILocalVariable(name: "msg", arg: 2, scope: !661, file: !662, line: 735, type: !298)
!684 = !DILocalVariable(name: "val", scope: !685, file: !662, line: 737, type: !671, align: 8)
!685 = distinct !DILexicalBlock(scope: !661, file: !662, line: 737, column: 13)
!686 = !DILocation(line: 735, column: 25, scope: !661)
!687 = !DILocation(line: 735, column: 31, scope: !661)
!688 = !DILocation(line: 736, column: 15, scope: !661)
!689 = !DILocation(line: 736, column: 9, scope: !661)
!690 = !DILocation(line: 738, column: 21, scope: !661)
!691 = !DILocation(line: 737, column: 18, scope: !661)
!692 = !DILocation(line: 737, column: 18, scope: !685)
!693 = !DILocation(line: 740, column: 6, scope: !661)
!694 = distinct !DISubprogram(name: "assert_failed<i32, i32>", linkageName: "_ZN4core9panicking13assert_failed17h7bf7c81b586f2e93E", scope: !59, file: !695, line: 171, type: !696, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !716, retainedNodes: !711)
!695 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "89dbfc153a7177bd0202715dd5809289")
