; ModuleID = '2d0w6da2teu24lzu'
source_filename = "2d0w6da2teu24lzu"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_fn_xfail.rs:5:1: 7:2]" = type {}
%"[closure@src/test_add.rs:19:1: 26:2]" = type {}
%"[closure@src/test_sub.rs:10:1: 16:2]" = type {}
%"[closure@src/test_add.rs:10:1: 16:2]" = type {}
%"[closure@src/test_sub.rs:19:1: 26:2]" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }
%"test::types::TestName" = type { i8, [39 x i8] }
%"test::options::ShouldPanic" = type { i64, [2 x i64] }
%"test::types::TestFn" = type { i64, [2 x i64] }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [6 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "56f3ae9cd35b4a6d41c32c0359fd0048")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!44 = !{i32 7, !"PIC Level", i32 2}
!45 = !{i32 7, !"PIE Level", i32 2}
!46 = !{i32 2, !"RtLibUseGOT", i32 1}
!47 = !{i32 2, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !50, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !51, globals: !69)
!50 = !DIFile(filename: "src/lib.rs/@/2d0w6da2teu24lzu", directory: "/home/calvin/git/c2rust/tests/example")
!51 = !{!52, !63}
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !53, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagEnumClass, elements: !58)
!53 = !DINamespace(name: "v1", scope: !54)
!54 = !DINamespace(name: "rt", scope: !55)
!55 = !DINamespace(name: "fmt", scope: !56)
!56 = !DINamespace(name: "core", scope: null)
!57 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !64, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagEnumClass, elements: !65)
!64 = !DINamespace(name: "panicking", scope: !56)
!65 = !{!66, !67, !68}
!66 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!69 = !{!0, !24, !34}
!70 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h6eea9ec88454ceb6E", scope: !72, file: !71, line: 118, type: !74, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !80, retainedNodes: !76)
!71 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!72 = !DINamespace(name: "backtrace", scope: !73)
!73 = !DINamespace(name: "sys_common", scope: !17)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !20}
!76 = !{!77, !78}
!77 = !DILocalVariable(name: "f", arg: 1, scope: !70, file: !71, line: 118, type: !20)
!78 = !DILocalVariable(name: "result", scope: !79, file: !71, line: 122, type: !7, align: 1)
!79 = distinct !DILexicalBlock(scope: !70, file: !71, line: 122, column: 5)
!80 = !{!81, !82}
!81 = !DITemplateTypeParameter(name: "F", type: !20)
!82 = !DITemplateTypeParameter(name: "T", type: !7)
!83 = !DILocation(line: 122, column: 9, scope: !79)
!84 = !DILocation(line: 118, column: 43, scope: !70)
!85 = !DILocalVariable(name: "dummy", scope: !86, file: !71, line: 125, type: !7, align: 1)
!86 = !DILexicalBlockFile(scope: !87, file: !71, discriminator: 0)
!87 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hb3c46a800f0fdc3bE", scope: !89, file: !88, line: 225, type: !90, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !93, retainedNodes: !92)
!88 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!89 = !DINamespace(name: "hint", scope: !56)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !7}
!92 = !{!85}
!93 = !{!82}
!94 = !DILocation(line: 125, column: 5, scope: !86, inlinedAt: !95)
!95 = !DILocation(line: 125, column: 5, scope: !79)
!96 = !DILocation(line: 122, column: 18, scope: !70)
!97 = !{i32 3343055}
!98 = !DILocation(line: 128, column: 2, scope: !70)
!99 = !DILocation(line: 128, column: 1, scope: !70)
!100 = !DILocation(line: 118, column: 1, scope: !70)
!101 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17hd4656496b70b35e7E", scope: !16, file: !102, line: 139, type: !103, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !93, retainedNodes: !108)
!102 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !20, !105, !106}
!105 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !{!109, !110, !111, !112}
!109 = !DILocalVariable(name: "main", arg: 1, scope: !101, file: !102, line: 140, type: !20)
!110 = !DILocalVariable(name: "argc", arg: 2, scope: !101, file: !102, line: 141, type: !105)
!111 = !DILocalVariable(name: "argv", arg: 3, scope: !101, file: !102, line: 142, type: !106)
!112 = !DILocalVariable(name: "v", scope: !113, file: !102, line: 144, type: !105, align: 8)
!113 = distinct !DILexicalBlock(scope: !101, file: !102, line: 144, column: 5)
!114 = !DILocation(line: 140, column: 5, scope: !101)
!115 = !DILocation(line: 141, column: 5, scope: !101)
!116 = !DILocation(line: 142, column: 5, scope: !101)
!117 = !DILocation(line: 145, column: 10, scope: !101)
!118 = !DILocation(line: 145, column: 9, scope: !101)
!119 = !DILocation(line: 144, column: 17, scope: !101)
!120 = !DILocation(line: 144, column: 12, scope: !101)
!121 = !DILocation(line: 144, column: 12, scope: !113)
!122 = !DILocation(line: 150, column: 2, scope: !101)
!123 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hd6321252b04e9817E", scope: !15, file: !102, line: 145, type: !124, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !93, retainedNodes: !127)
!124 = !DISubroutineType(types: !125)
!125 = !{!43, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !{!128}
!128 = !DILocalVariable(name: "main", scope: !123, file: !102, line: 140, type: !20, align: 8)
!129 = !{i64 8}
!130 = !DILocation(line: 140, column: 5, scope: !123)
!131 = !DILocalVariable(name: "self", scope: !132, file: !102, line: 145, type: !135, align: 1)
!132 = !DILexicalBlockFile(scope: !133, file: !102, discriminator: 0)
!133 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hb9e5a11a45a46360E", scope: !135, file: !134, line: 1808, type: !146, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !23, retainedNodes: !148)
!134 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !136, file: !2, size: 8, align: 8, elements: !137, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!136 = !DINamespace(name: "process", scope: !17)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !135, file: !2, baseType: !139, size: 8, align: 8)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !140, file: !2, size: 8, align: 8, elements: !144, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!140 = !DINamespace(name: "process_common", scope: !141)
!141 = !DINamespace(name: "process", scope: !142)
!142 = !DINamespace(name: "unix", scope: !143)
!143 = !DINamespace(name: "sys", scope: !17)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !139, file: !2, baseType: !57, size: 8, align: 8)
!146 = !DISubroutineType(types: !147)
!147 = !{!43, !135}
!148 = !{!131}
!149 = !DILocation(line: 145, column: 18, scope: !132, inlinedAt: !150)
!150 = !DILocation(line: 145, column: 18, scope: !123)
!151 = !DILocation(line: 145, column: 77, scope: !123)
!152 = !DILocalVariable(name: "self", scope: !153, file: !102, line: 145, type: !158, align: 8)
!153 = !DILexicalBlockFile(scope: !154, file: !102, discriminator: 0)
!154 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217hcfc9e38cf1d20dfaE", scope: !139, file: !155, line: 485, type: !156, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !23, retainedNodes: !159)
!155 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!156 = !DISubroutineType(types: !157)
!157 = !{!43, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !139, size: 64, align: 64, dwarfAddressSpace: 0)
!159 = !{!152}
!160 = !DILocation(line: 145, column: 18, scope: !153, inlinedAt: !161)
!161 = !DILocation(line: 1809, column: 9, scope: !133, inlinedAt: !150)
!162 = !DILocation(line: 145, column: 17, scope: !123)
!163 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hb60589ee14e8e526E", scope: !165, file: !164, line: 2361, type: !166, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !224, retainedNodes: !221)
!164 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!165 = !DINamespace(name: "{impl#59}", scope: !55)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !185, !186}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !169, file: !2, size: 8, align: 8, elements: !170, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!169 = !DINamespace(name: "result", scope: !56)
!170 = !{!171}
!171 = !DICompositeType(tag: DW_TAG_variant_part, scope: !168, file: !2, size: 8, align: 8, elements: !172, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !184)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !171, file: !2, baseType: !174, size: 8, align: 8, extraData: i64 0)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !168, file: !2, size: 8, align: 8, elements: !175, templateParams: !177, identifier: "cea751326735c343faf647063a65ad14")
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !174, file: !2, baseType: !7, align: 8, offset: 8)
!177 = !{!82, !178}
!178 = !DITemplateTypeParameter(name: "E", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !55, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !171, file: !2, baseType: !181, size: 8, align: 8, extraData: i64 1)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !168, file: !2, size: 8, align: 8, elements: !182, templateParams: !177, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !181, file: !2, baseType: !179, align: 8, offset: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !168, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagArtificial)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !55, file: !2, size: 512, align: 64, elements: !188, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!188 = !{!189, !190, !192, !193, !209, !210}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !2, baseType: !33, size: 32, align: 32, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !187, file: !2, baseType: !191, size: 32, align: 32, offset: 416)
!191 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !187, file: !2, baseType: !52, size: 8, align: 8, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !187, file: !2, baseType: !194, size: 128, align: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !195, file: !2, size: 128, align: 64, elements: !196, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!195 = !DINamespace(name: "option", scope: !56)
!196 = !{!197}
!197 = !DICompositeType(tag: DW_TAG_variant_part, scope: !194, file: !2, size: 128, align: 64, elements: !198, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !207)
!198 = !{!199, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !197, file: !2, baseType: !200, size: 128, align: 64, extraData: i64 0)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !194, file: !2, size: 128, align: 64, elements: !23, templateParams: !201, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!201 = !{!202}
!202 = !DITemplateTypeParameter(name: "T", type: !9)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !197, file: !2, baseType: !204, size: 128, align: 64, extraData: i64 1)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !194, file: !2, size: 128, align: 64, elements: !205, templateParams: !201, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !204, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !2, baseType: !208, size: 64, align: 64, flags: DIFlagArtificial)
!208 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !187, file: !2, baseType: !194, size: 128, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !187, file: !2, baseType: !211, size: 128, align: 64, offset: 256)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !212, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!212 = !{!213, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !211, file: !2, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64, dwarfAddressSpace: 0)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !211, file: !2, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !218, size: 64, align: 64, dwarfAddressSpace: 0)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 3, lowerBound: 0)
!221 = !{!222, !223}
!222 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !164, line: 2361, type: !185)
!223 = !DILocalVariable(name: "f", arg: 2, scope: !163, file: !164, line: 2361, type: !186)
!224 = !{!225}
!225 = !DITemplateTypeParameter(name: "T", type: !33)
!226 = !DILocation(line: 2361, column: 20, scope: !163)
!227 = !DILocation(line: 2361, column: 27, scope: !163)
!228 = !DILocation(line: 2361, column: 71, scope: !163)
!229 = !{i64 4}
!230 = !DILocation(line: 2361, column: 62, scope: !163)
!231 = !DILocation(line: 2361, column: 84, scope: !163)
!232 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hcb3d2524b12a8677E", scope: !165, file: !164, line: 2361, type: !233, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !239, retainedNodes: !236)
!233 = !DISubroutineType(types: !234)
!234 = !{!168, !235, !186}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !{!237, !238}
!237 = !DILocalVariable(name: "self", arg: 1, scope: !232, file: !164, line: 2361, type: !235)
!238 = !DILocalVariable(name: "f", arg: 2, scope: !232, file: !164, line: 2361, type: !186)
!239 = !{!240}
!240 = !DITemplateTypeParameter(name: "T", type: !43)
!241 = !DILocation(line: 2361, column: 20, scope: !232)
!242 = !DILocation(line: 2361, column: 27, scope: !232)
!243 = !DILocation(line: 2361, column: 71, scope: !232)
!244 = !DILocation(line: 2361, column: 62, scope: !232)
!245 = !DILocation(line: 2361, column: 84, scope: !232)
!246 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h90eb145633d7d530E", scope: !248, file: !247, line: 185, type: !250, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !23, retainedNodes: !252)
!247 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!248 = !DINamespace(name: "{impl#80}", scope: !249)
!249 = !DINamespace(name: "num", scope: !55)
!250 = !DISubroutineType(types: !251)
!251 = !{!168, !42, !186}
!252 = !{!253, !254}
!253 = !DILocalVariable(name: "self", arg: 1, scope: !246, file: !247, line: 185, type: !42)
!254 = !DILocalVariable(name: "f", arg: 2, scope: !246, file: !247, line: 185, type: !186)
!255 = !DILocation(line: 185, column: 20, scope: !246)
!256 = !DILocation(line: 185, column: 27, scope: !246)
!257 = !DILocation(line: 186, column: 20, scope: !246)
!258 = !DILocation(line: 188, column: 27, scope: !246)
!259 = !DILocation(line: 187, column: 21, scope: !246)
!260 = !DILocation(line: 186, column: 17, scope: !246)
!261 = !DILocation(line: 193, column: 14, scope: !246)
!262 = !{i8 0, i8 2}
!263 = !DILocation(line: 191, column: 21, scope: !246)
!264 = !DILocation(line: 189, column: 21, scope: !246)
!265 = !DILocation(line: 188, column: 24, scope: !246)
!266 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hf275d66420ae8b3dE", scope: !267, file: !247, line: 185, type: !268, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !23, retainedNodes: !270)
!267 = !DINamespace(name: "{impl#86}", scope: !249)
!268 = !DISubroutineType(types: !269)
!269 = !{!168, !32, !186}
!270 = !{!271, !272}
!271 = !DILocalVariable(name: "self", arg: 1, scope: !266, file: !247, line: 185, type: !32)
!272 = !DILocalVariable(name: "f", arg: 2, scope: !266, file: !247, line: 185, type: !186)
!273 = !DILocation(line: 185, column: 20, scope: !266)
!274 = !DILocation(line: 185, column: 27, scope: !266)
!275 = !DILocation(line: 186, column: 20, scope: !266)
!276 = !DILocation(line: 188, column: 27, scope: !266)
!277 = !DILocation(line: 187, column: 21, scope: !266)
!278 = !DILocation(line: 186, column: 17, scope: !266)
!279 = !DILocation(line: 193, column: 14, scope: !266)
!280 = !DILocation(line: 191, column: 21, scope: !266)
!281 = !DILocation(line: 189, column: 21, scope: !266)
!282 = !DILocation(line: 188, column: 24, scope: !266)
!283 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hc9ac5a8756364959E", scope: !284, file: !164, line: 390, type: !358, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !23, retainedNodes: !360)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !55, file: !2, size: 384, align: 64, elements: !285, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!285 = !{!286, !297, !342}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !284, file: !2, baseType: !287, size: 128, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !288, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!288 = !{!289, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !287, file: !2, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !292, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!292 = !{!293, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !291, file: !2, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !287, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !284, file: !2, baseType: !298, size: 128, align: 64, offset: 128)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !195, file: !2, size: 128, align: 64, elements: !299, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!299 = !{!300}
!300 = !DICompositeType(tag: DW_TAG_variant_part, scope: !298, file: !2, size: 128, align: 64, elements: !301, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !341)
!301 = !{!302, !337}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !300, file: !2, baseType: !303, size: 128, align: 64, extraData: i64 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !298, file: !2, size: 128, align: 64, elements: !23, templateParams: !304, identifier: "742dbe7e160661d8ca36fcfff2574850")
!304 = !{!305}
!305 = !DITemplateTypeParameter(name: "T", type: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !307, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!307 = !{!308, !336}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !306, file: !2, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64, dwarfAddressSpace: 0)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !53, file: !2, size: 448, align: 64, elements: !311, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !310, file: !2, baseType: !9, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !310, file: !2, baseType: !314, size: 384, align: 64, offset: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !53, file: !2, size: 384, align: 64, elements: !315, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!315 = !{!316, !317, !318, !319, !335}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !314, file: !2, baseType: !191, size: 32, align: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !314, file: !2, baseType: !52, size: 8, align: 8, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !2, baseType: !33, size: 32, align: 32, offset: 288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !314, file: !2, baseType: !320, size: 128, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !53, file: !2, size: 128, align: 64, elements: !321, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!321 = !{!322}
!322 = !DICompositeType(tag: DW_TAG_variant_part, scope: !320, file: !2, size: 128, align: 64, elements: !323, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !334)
!323 = !{!324, !328, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !322, file: !2, baseType: !325, size: 128, align: 64, extraData: i64 0)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !320, file: !2, size: 128, align: 64, elements: !326, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !325, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !322, file: !2, baseType: !329, size: 128, align: 64, extraData: i64 1)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !320, file: !2, size: 128, align: 64, elements: !330, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !329, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !322, file: !2, baseType: !333, size: 128, align: 64, extraData: i64 2)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !320, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!334 = !DIDerivedType(tag: DW_TAG_member, scope: !320, file: !2, baseType: !208, size: 64, align: 64, flags: DIFlagArtificial)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !314, file: !2, baseType: !320, size: 128, align: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !306, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !300, file: !2, baseType: !338, size: 128, align: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !298, file: !2, size: 128, align: 64, elements: !339, templateParams: !304, identifier: "17f2fc106094349c7673abca4839c97a")
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !338, file: !2, baseType: !306, size: 128, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !2, baseType: !208, size: 64, align: 64, flags: DIFlagArtificial)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !284, file: !2, baseType: !343, size: 128, align: 64, offset: 256)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !344, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!344 = !{!345, !357}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !343, file: !2, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64, dwarfAddressSpace: 0)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !55, file: !2, size: 128, align: 64, elements: !348, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!348 = !{!349, !353}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !2, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !351, size: 64, align: 64, dwarfAddressSpace: 0)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !352, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!352 = !DINamespace(name: "{extern#0}", scope: !55)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !347, file: !2, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !DISubroutineType(types: !356)
!356 = !{!168, !350, !186}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !343, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!284, !287, !343}
!360 = !{!361, !362}
!361 = !DILocalVariable(name: "pieces", arg: 1, scope: !283, file: !164, line: 390, type: !287)
!362 = !DILocalVariable(name: "args", arg: 2, scope: !283, file: !164, line: 390, type: !343)
!363 = !DILocation(line: 390, column: 25, scope: !283)
!364 = !DILocation(line: 390, column: 53, scope: !283)
!365 = !DILocation(line: 391, column: 12, scope: !283)
!366 = !DILocation(line: 391, column: 56, scope: !283)
!367 = !DILocation(line: 391, column: 41, scope: !283)
!368 = !DILocation(line: 394, column: 34, scope: !283)
!369 = !DILocation(line: 394, column: 9, scope: !283)
!370 = !DILocation(line: 395, column: 6, scope: !283)
!371 = !DILocation(line: 392, column: 13, scope: !283)
!372 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h50deab595d2cb1f3E", scope: !374, file: !373, line: 248, type: !377, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !383, retainedNodes: !380)
!373 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!374 = !DINamespace(name: "FnOnce", scope: !375)
!375 = !DINamespace(name: "function", scope: !376)
!376 = !DINamespace(name: "ops", scope: !56)
!377 = !DISubroutineType(types: !378)
!378 = !{!43, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!380 = !{!381, !382}
!381 = !DILocalVariable(arg: 1, scope: !372, file: !373, line: 248, type: !379)
!382 = !DILocalVariable(arg: 2, scope: !372, file: !373, line: 248, type: !7)
!383 = !{!384, !385}
!384 = !DITemplateTypeParameter(name: "Self", type: !14)
!385 = !DITemplateTypeParameter(name: "Args", type: !7)
!386 = !DILocation(line: 248, column: 5, scope: !372)
!387 = distinct !DISubprogram(name: "call_once<example_tests::test_fn_xfail::test_xfails::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h2f5b952e06359326E", scope: !374, file: !373, line: 248, type: !388, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !397, retainedNodes: !394)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390}
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !391, file: !2, align: 8, elements: !23, identifier: "575529bd3a224229ee322b86a14a0f83")
!391 = !DINamespace(name: "test_xfails", scope: !392)
!392 = !DINamespace(name: "test_fn_xfail", scope: !393)
!393 = !DINamespace(name: "example_tests", scope: null)
!394 = !{!395, !396}
!395 = !DILocalVariable(arg: 1, scope: !387, file: !373, line: 248, type: !390)
!396 = !DILocalVariable(arg: 2, scope: !387, file: !373, line: 248, type: !7)
!397 = !{!398, !385}
!398 = !DITemplateTypeParameter(name: "Self", type: !390)
!399 = !DILocation(line: 248, column: 5, scope: !387)
!400 = distinct !DISubprogram(name: "call_once<example_tests::test_add::test_overflow::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h402179131e621175E", scope: !374, file: !373, line: 248, type: !401, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !409, retainedNodes: !406)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !404, file: !2, align: 8, elements: !23, identifier: "6cc3bd8c7e0989a5ab9130798c0fe5b2")
!404 = !DINamespace(name: "test_overflow", scope: !405)
!405 = !DINamespace(name: "test_add", scope: !393)
!406 = !{!407, !408}
!407 = !DILocalVariable(arg: 1, scope: !400, file: !373, line: 248, type: !403)
!408 = !DILocalVariable(arg: 2, scope: !400, file: !373, line: 248, type: !7)
!409 = !{!410, !385}
!410 = !DITemplateTypeParameter(name: "Self", type: !403)
!411 = !DILocation(line: 248, column: 5, scope: !400)
!412 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h45cfdc4492548445E", scope: !374, file: !373, line: 248, type: !74, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !416, retainedNodes: !413)
!413 = !{!414, !415}
!414 = !DILocalVariable(arg: 1, scope: !412, file: !373, line: 248, type: !20)
!415 = !DILocalVariable(arg: 2, scope: !412, file: !373, line: 248, type: !7)
!416 = !{!417, !385}
!417 = !DITemplateTypeParameter(name: "Self", type: !20)
!418 = !DILocation(line: 248, column: 5, scope: !412)
!419 = distinct !DISubprogram(name: "call_once<example_tests::test_sub::test_subtraction::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h7b4a56285357bf4bE", scope: !374, file: !373, line: 248, type: !420, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !428, retainedNodes: !425)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422}
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !423, file: !2, align: 8, elements: !23, identifier: "c36d9973a97d2bf49ebe1fade7567129")
!423 = !DINamespace(name: "test_subtraction", scope: !424)
!424 = !DINamespace(name: "test_sub", scope: !393)
!425 = !{!426, !427}
!426 = !DILocalVariable(arg: 1, scope: !419, file: !373, line: 248, type: !422)
!427 = !DILocalVariable(arg: 2, scope: !419, file: !373, line: 248, type: !7)
!428 = !{!429, !385}
!429 = !DITemplateTypeParameter(name: "Self", type: !422)
!430 = !DILocation(line: 248, column: 5, scope: !419)
!431 = distinct !DISubprogram(name: "call_once<example_tests::test_add::test_addition::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h805e92def3d11b5bE", scope: !374, file: !373, line: 248, type: !432, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !439, retainedNodes: !436)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !434}
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !435, file: !2, align: 8, elements: !23, identifier: "795b657cabb3c5a26234ff03ee8ae2d9")
!435 = !DINamespace(name: "test_addition", scope: !405)
!436 = !{!437, !438}
!437 = !DILocalVariable(arg: 1, scope: !431, file: !373, line: 248, type: !434)
!438 = !DILocalVariable(arg: 2, scope: !431, file: !373, line: 248, type: !7)
!439 = !{!440, !385}
!440 = !DITemplateTypeParameter(name: "Self", type: !434)
!441 = !DILocation(line: 248, column: 5, scope: !431)
!442 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd4d80d6801665cf0E", scope: !374, file: !373, line: 248, type: !443, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !383, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{!43, !14}
!445 = !{!446, !447}
!446 = !DILocalVariable(arg: 1, scope: !442, file: !373, line: 248, type: !14)
!447 = !DILocalVariable(arg: 2, scope: !442, file: !373, line: 248, type: !7)
!448 = !DILocation(line: 248, column: 5, scope: !442)
!449 = distinct !DISubprogram(name: "call_once<example_tests::test_sub::test_underflow::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he107d006ad44d9f0E", scope: !374, file: !373, line: 248, type: !450, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !457, retainedNodes: !454)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !452}
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !453, file: !2, align: 8, elements: !23, identifier: "9fba0df3f306638084cac46e2f715550")
!453 = !DINamespace(name: "test_underflow", scope: !424)
!454 = !{!455, !456}
!455 = !DILocalVariable(arg: 1, scope: !449, file: !373, line: 248, type: !452)
!456 = !DILocalVariable(arg: 2, scope: !449, file: !373, line: 248, type: !7)
!457 = !{!458, !385}
!458 = !DITemplateTypeParameter(name: "Self", type: !452)
!459 = !DILocation(line: 248, column: 5, scope: !449)
!460 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h0e018eacc69d1c21E", scope: !462, file: !461, line: 487, type: !463, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !468, retainedNodes: !466)
!461 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!462 = !DINamespace(name: "ptr", scope: !56)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !{!467}
!467 = !DILocalVariable(arg: 1, scope: !460, file: !461, line: 487, type: !465)
!468 = !{!469}
!469 = !DITemplateTypeParameter(name: "T", type: !42)
!470 = !DILocation(line: 487, column: 1, scope: !460)
!471 = distinct !DISubprogram(name: "drop_in_place<&u32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$u32$GT$17hf178fe201acaf903E", scope: !462, file: !461, line: 487, type: !472, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !477, retainedNodes: !475)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &u32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!475 = !{!476}
!476 = !DILocalVariable(arg: 1, scope: !471, file: !461, line: 487, type: !474)
!477 = !{!478}
!478 = !DITemplateTypeParameter(name: "T", type: !32)
!479 = !DILocation(line: 487, column: 1, scope: !471)
!480 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h6cfd979372645b31E", scope: !462, file: !461, line: 487, type: !481, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !485, retainedNodes: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !379}
!483 = !{!484}
!484 = !DILocalVariable(arg: 1, scope: !480, file: !461, line: 487, type: !379)
!485 = !{!486}
!486 = !DITemplateTypeParameter(name: "T", type: !14)
!487 = !DILocation(line: 487, column: 1, scope: !480)
!488 = distinct !DISubprogram(name: "assert_failed<u32, u32>", linkageName: "_ZN4core9panicking13assert_failed17h7197f819674902dcE", scope: !64, file: !489, line: 171, type: !490, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !518, retainedNodes: !513)
!489 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "89dbfc153a7177bd0202715dd5809289")
!490 = !DISubroutineType(types: !491)
!491 = !{null, !63, !32, !32, !492, !505}
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Arguments>", scope: !195, file: !2, size: 384, align: 64, elements: !493, templateParams: !23, identifier: "91782c25c0cb4075178b67ca76527846")
!493 = !{!494}
!494 = !DICompositeType(tag: DW_TAG_variant_part, scope: !492, file: !2, size: 384, align: 64, elements: !495, templateParams: !23, identifier: "d3d8c93b36d851336035bb39c7913979", discriminator: !504)
!495 = !{!496, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !494, file: !2, baseType: !497, size: 384, align: 64, extraData: i64 0)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !492, file: !2, size: 384, align: 64, elements: !23, templateParams: !498, identifier: "94094742b636673213b46bf0a5389cae")
!498 = !{!499}
!499 = !DITemplateTypeParameter(name: "T", type: !284)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !494, file: !2, baseType: !501, size: 384, align: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !492, file: !2, size: 384, align: 64, elements: !502, templateParams: !498, identifier: "424137f74f76139e10918065dfb817dc")
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !501, file: !2, baseType: !284, size: 384, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, scope: !492, file: !2, baseType: !208, size: 64, align: 64, flags: DIFlagArtificial)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !507, file: !2, size: 192, align: 64, elements: !509, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!507 = !DINamespace(name: "location", scope: !508)
!508 = !DINamespace(name: "panic", scope: !56)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !506, file: !2, baseType: !291, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !506, file: !2, baseType: !33, size: 32, align: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !506, file: !2, baseType: !33, size: 32, align: 32, offset: 160)
!513 = !{!514, !515, !516, !517}
!514 = !DILocalVariable(name: "kind", arg: 1, scope: !488, file: !489, line: 172, type: !63)
!515 = !DILocalVariable(name: "left", arg: 2, scope: !488, file: !489, line: 173, type: !32)
!516 = !DILocalVariable(name: "right", arg: 3, scope: !488, file: !489, line: 174, type: !32)
!517 = !DILocalVariable(name: "args", arg: 4, scope: !488, file: !489, line: 175, type: !492)
!518 = !{!225, !519}
!519 = !DITemplateTypeParameter(name: "U", type: !33)
!520 = !DILocation(line: 172, column: 5, scope: !488)
!521 = !DILocation(line: 173, column: 5, scope: !488)
!522 = !DILocation(line: 174, column: 5, scope: !488)
!523 = !DILocation(line: 175, column: 5, scope: !488)
!524 = !DILocation(line: 181, column: 31, scope: !488)
!525 = !DILocation(line: 181, column: 38, scope: !488)
!526 = !DILocation(line: 181, column: 46, scope: !488)
!527 = !DILocation(line: 181, column: 5, scope: !488)
!528 = distinct !DISubprogram(name: "assert_failed<i32, i32>", linkageName: "_ZN4core9panicking13assert_failed17hdb8b1d3b785d25b6E", scope: !64, file: !489, line: 171, type: !529, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !536, retainedNodes: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !63, !42, !42, !492, !505}
!531 = !{!532, !533, !534, !535}
!532 = !DILocalVariable(name: "kind", arg: 1, scope: !528, file: !489, line: 172, type: !63)
!533 = !DILocalVariable(name: "left", arg: 2, scope: !528, file: !489, line: 173, type: !42)
!534 = !DILocalVariable(name: "right", arg: 3, scope: !528, file: !489, line: 174, type: !42)
!535 = !DILocalVariable(name: "args", arg: 4, scope: !528, file: !489, line: 175, type: !492)
!536 = !{!240, !537}
!537 = !DITemplateTypeParameter(name: "U", type: !43)
!538 = !DILocation(line: 172, column: 5, scope: !528)
!539 = !DILocation(line: 173, column: 5, scope: !528)
!540 = !DILocation(line: 174, column: 5, scope: !528)
!541 = !DILocation(line: 175, column: 5, scope: !528)
!542 = !DILocation(line: 181, column: 31, scope: !528)
!543 = !DILocation(line: 181, column: 38, scope: !528)
!544 = !DILocation(line: 181, column: 46, scope: !528)
!545 = !DILocation(line: 181, column: 5, scope: !528)
!546 = distinct !DISubprogram(name: "assert_test_result<()>", linkageName: "_ZN4test18assert_test_result17h31973a60134511dfE", scope: !548, file: !547, line: 182, type: !90, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !49, templateParams: !93, retainedNodes: !549)
!547 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/test/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "762a73d08c70c6e433bc6b670465b31f")
!548 = !DINamespace(name: "test", scope: null)
!549 = !{!550, !551, !553, !557, !558}
!550 = !DILocalVariable(name: "result", arg: 1, scope: !546, file: !547, line: 182, type: !7)
!551 = !DILocalVariable(name: "code", scope: !552, file: !547, line: 183, type: !43, align: 4)
!552 = distinct !DILexicalBlock(scope: !546, file: !547, line: 183, column: 5)
!553 = !DILocalVariable(name: "left_val", scope: !554, file: !547, line: 184, type: !42, align: 8)
!554 = !DILexicalBlockFile(scope: !555, file: !547, discriminator: 0)
!555 = distinct !DILexicalBlock(scope: !552, file: !556, line: 52, column: 13)
!556 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/macros/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "92818cc67b0fce20f16574f7676a5426")
!557 = !DILocalVariable(name: "right_val", scope: !554, file: !547, line: 184, type: !42, align: 8)
!558 = !DILocalVariable(name: "kind", scope: !559, file: !547, line: 184, type: !63, align: 1)
!559 = !DILexicalBlockFile(scope: !560, file: !547, discriminator: 0)
!560 = distinct !DILexicalBlock(scope: !555, file: !556, line: 54, column: 21)
