; ModuleID = '4b8bcohxgxf0o3ap'
source_filename = "4b8bcohxgxf0o3ap"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::result::Result<f128_internal::f128_t::f128, alloc::ffi::c_str::NulError>" = type { i8, [39 x i8] }
%"f128_internal::f128_t::f128" = type { [16 x i8] }
%"core::result::Result<core::convert::Infallible, alloc::ffi::c_str::NulError>::Err" = type { %"alloc::ffi::c_str::NulError" }
%"alloc::ffi::c_str::NulError" = type { i64, %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"core::result::Result<alloc::ffi::c_str::CString, alloc::ffi::c_str::NulError>" = type { i64, [4 x i64] }
%"core::ops::control_flow::ControlFlow<core::result::Result<core::convert::Infallible, alloc::ffi::c_str::NulError>, alloc::ffi::c_str::CString>" = type { i64, [4 x i64] }
%"core::ops::control_flow::ControlFlow<core::result::Result<core::convert::Infallible, alloc::ffi::c_str::NulError>, alloc::ffi::c_str::CString>::Continue" = type { [1 x i64], { i8*, i64 } }
%"core::ffi::c_str::CStr" = type { [0 x i8] }
%"core::ops::control_flow::ControlFlow<core::result::Result<core::convert::Infallible, alloc::ffi::c_str::NulError>, alloc::ffi::c_str::CString>::Break" = type { [1 x i64], %"core::result::Result<core::convert::Infallible, alloc::ffi::c_str::NulError>::Err" }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "1b870bd9431ccc1d71adabe14fa4d734")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !33, file: !2, size: 256, align: 64, elements: !36, templateParams: !23, identifier: "f0b155880f0e8602fd0be3023df941a4")
!33 = !DINamespace(name: "c_str", scope: !34)
!34 = !DINamespace(name: "ffi", scope: !35)
!35 = !DINamespace(name: "alloc", scope: null)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !32, file: !2, baseType: !9, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !32, file: !2, baseType: !39, size: 192, align: 64, offset: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !40, file: !2, size: 192, align: 64, elements: !41, templateParams: !68, identifier: "f48a096c1ed19eb7ba15a7173429013")
!40 = !DINamespace(name: "vec", scope: !35)
!41 = !{!42, !70}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !2, baseType: !43, size: 128, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !44, file: !2, size: 128, align: 64, elements: !45, templateParams: !68, identifier: "d09dab1a097018b9dd4dad6f3ce84c27")
!44 = !DINamespace(name: "raw_vec", scope: !35)
!45 = !{!46, !64, !65}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, file: !2, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !48, file: !2, size: 64, align: 64, elements: !51, templateParams: !59, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!48 = !DINamespace(name: "unique", scope: !49)
!49 = !DINamespace(name: "ptr", scope: !50)
!50 = !DINamespace(name: "core", scope: null)
!51 = !{!52, !61}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !47, file: !2, baseType: !53, size: 64, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !54, file: !2, size: 64, align: 64, elements: !55, templateParams: !59, identifier: "3160283ea80cecf6149fff38a2e996de")
!54 = !DINamespace(name: "non_null", scope: !49)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !2, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "T", type: !58)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !47, file: !2, baseType: !62, align: 8)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !63, file: !2, align: 8, elements: !23, templateParams: !59, identifier: "e338a8151f1037c76eadd10ab3c53972")
!63 = !DINamespace(name: "marker", scope: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !43, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !43, file: !2, baseType: !66, align: 8)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !67, file: !2, align: 8, elements: !23, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!67 = !DINamespace(name: "alloc", scope: !35)
!68 = !{!60, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !66)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "<&f128_internal::f128_t::f128 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f128_internal::f128_t::f128 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !74, vtableHolder: !79, templateParams: !23, identifier: "5b3770b3bc3c24961566d625838393b4")
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !73, file: !2, baseType: !6, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !73, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f128_internal::f128_t::f128", baseType: !80, size: 64, align: 64, dwarfAddressSpace: 0)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "f128", scope: !81, file: !2, size: 128, align: 8, elements: !83, templateParams: !23, identifier: "28631f457d6ea86b5cdf0afd2e10880f")
!81 = !DINamespace(name: "f128_t", scope: !82)
!82 = !DINamespace(name: "f128_internal", scope: null)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !80, file: !2, baseType: !85, size: 128, align: 8)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 16, lowerBound: 0)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "<&f64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !91, vtableHolder: !96, templateParams: !23, identifier: "6b62788b1bf0b7aff81411b24fc1f74")
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !90, file: !2, baseType: !6, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !90, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !90, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f64", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !101, vtableHolder: !106, templateParams: !23, identifier: "56f3ae9cd35b4a6d41c32c0359fd0048")
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !100, file: !2, baseType: !6, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !100, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !100, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !111, vtableHolder: !116, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!111 = !{!112, !113, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !110, file: !2, baseType: !6, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !110, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !110, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!117 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "<&f32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !121, vtableHolder: !126, templateParams: !23, identifier: "167dd032769a3561d40fd3e6fbb4e28f")
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !120, file: !2, baseType: !6, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !120, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !120, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !120, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "rust_ld1", scope: !130, file: !132, line: 68, type: !80, isLocal: false, isDefinition: true, align: 8)
!130 = !DINamespace(name: "long_double", scope: !131)
!131 = !DINamespace(name: "long_double_tests", scope: null)
!132 = !DIFile(filename: "src/long_double.rs", directory: "/home/calvin/git/c2rust/tests/longdouble", checksumkind: CSK_MD5, checksum: "7ed47d965a807e6598d5efef6fa25a2e")
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "rust_ld2", scope: !130, file: !132, line: 70, type: !80, isLocal: false, isDefinition: true, align: 8)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "INIT_ARRAY", linkageName: "_ZN17long_double_tests11long_double10INIT_ARRAY17h6e4eaaeaf86ab6d0E", scope: !130, file: !132, line: 79, type: !137, isLocal: true, isDefinition: true, align: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, align: 64, elements: !139)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !{!140}
!140 = !DISubrange(count: 1, lowerBound: 0)
!141 = !{i32 7, !"PIC Level", i32 2}
!142 = !{i32 7, !"PIE Level", i32 2}
!143 = !{i32 2, !"RtLibUseGOT", i32 1}
!144 = !{i32 2, !"Dwarf Version", i32 4}
!145 = !{i32 2, !"Debug Info Version", i32 3}
!146 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !147, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !148, globals: !164)
!147 = !DIFile(filename: "src/lib.rs/@/4b8bcohxgxf0o3ap", directory: "/home/calvin/git/c2rust/tests/longdouble")
!148 = !{!149, !158}
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !150, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagEnumClass, elements: !153)
!150 = !DINamespace(name: "v1", scope: !151)
!151 = !DINamespace(name: "rt", scope: !152)
!152 = !DINamespace(name: "fmt", scope: !50)
!153 = !{!154, !155, !156, !157}
!154 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !159, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagEnumClass, elements: !160)
!159 = !DINamespace(name: "panicking", scope: !50)
!160 = !{!161, !162, !163}
!161 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!162 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!164 = !{!0, !24, !71, !88, !98, !108, !118, !128, !133, !135}
!165 = distinct !DISubprogram(name: "parse<&str>", linkageName: "_ZN13f128_internal6f128_t4f1285parse17h5348e6f20595d472E", scope: !80, file: !166, line: 230, type: !167, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !224, retainedNodes: !191)
!166 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_internal-0.2.2/src/f128_t.rs", directory: "", checksumkind: CSK_MD5, checksum: "eec7f5b35a3217960a2aa39a9f68e650")
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !186}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<f128_internal::f128_t::f128, alloc::ffi::c_str::NulError>", scope: !170, file: !2, size: 320, align: 64, elements: !171, templateParams: !23, identifier: "7c4aebd8bb1d9e166dfc3e2b7848ab33")
!170 = !DINamespace(name: "result", scope: !50)
!171 = !{!172}
!172 = !DICompositeType(tag: DW_TAG_variant_part, scope: !169, file: !2, size: 320, align: 64, elements: !173, templateParams: !23, identifier: "5c3ee299164a888b78eafd8cd9b96aa6", discriminator: !185)
!173 = !{!174, !181}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !172, file: !2, baseType: !175, size: 320, align: 64, extraData: i64 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !169, file: !2, size: 320, align: 64, elements: !176, templateParams: !178, identifier: "36c9576e544bbd9074164b00d475cff1")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !2, baseType: !80, size: 128, align: 8, offset: 8)
!178 = !{!179, !180}
!179 = !DITemplateTypeParameter(name: "T", type: !80)
!180 = !DITemplateTypeParameter(name: "E", type: !32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !172, file: !2, baseType: !182, size: 320, align: 64, extraData: i64 1)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !169, file: !2, size: 320, align: 64, elements: !183, templateParams: !178, identifier: "ca221f5ed0e1a47421acb5b74549a64e")
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !182, file: !2, baseType: !32, size: 256, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagArtificial)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !187, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!187 = !{!188, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !186, file: !2, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !186, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!191 = !{!192, !193, !202, !222}
!192 = !DILocalVariable(name: "s", arg: 1, scope: !165, file: !166, line: 230, type: !186)
!193 = !DILocalVariable(name: "cstr", scope: !194, file: !166, line: 231, type: !195, align: 8)
!194 = distinct !DILexicalBlock(scope: !165, file: !166, line: 231, column: 9)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !33, file: !2, size: 128, align: 64, elements: !196, templateParams: !23, identifier: "a4dcbb113228472ac833458ca2f5ee8d")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !195, file: !2, baseType: !198, size: 128, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !199, templateParams: !23, identifier: "e783b0825321c11fc908377d145707b4")
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !198, file: !2, baseType: !189, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !198, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!202 = !DILocalVariable(name: "residual", scope: !203, file: !166, line: 231, type: !204, align: 8)
!203 = distinct !DILexicalBlock(scope: !165, file: !166, line: 231, column: 44)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, alloc::ffi::c_str::NulError>", scope: !170, file: !2, size: 256, align: 64, elements: !205, templateParams: !23, identifier: "cf238678704d7f5154dbd9fcead3eaba")
!205 = !{!206}
!206 = !DICompositeType(tag: DW_TAG_variant_part, scope: !204, file: !2, size: 256, align: 64, elements: !207, templateParams: !23, identifier: "3480b24a8a41e679665d486dc29ffa0a")
!207 = !{!208, !218}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !206, file: !2, baseType: !209, size: 256, align: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !204, file: !2, size: 256, align: 64, elements: !210, templateParams: !216, identifier: "79e596b36fe820ad8839085a220119fa")
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !209, file: !2, baseType: !212, align: 8)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !213, file: !2, align: 8, elements: !214, templateParams: !23, identifier: "54da939063c7c2baf203c9f582cd0995")
!213 = !DINamespace(name: "convert", scope: !50)
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_variant_part, scope: !212, file: !2, align: 8, elements: !23, identifier: "8a046f69014feadb4a5e941e4277afe9")
!216 = !{!217, !180}
!217 = !DITemplateTypeParameter(name: "T", type: !212)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !206, file: !2, baseType: !219, size: 256, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !204, file: !2, size: 256, align: 64, elements: !220, templateParams: !216, identifier: "975fce146da8c155dc711afa7553e01")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !219, file: !2, baseType: !32, size: 256, align: 64)
!222 = !DILocalVariable(name: "val", scope: !223, file: !166, line: 231, type: !195, align: 8)
!223 = distinct !DILexicalBlock(scope: !165, file: !166, line: 231, column: 20)
!224 = !{!225}
!225 = !DITemplateTypeParameter(name: "T", type: !186)
!226 = !DILocation(line: 230, column: 33, scope: !165)
!227 = !DILocation(line: 231, column: 13, scope: !194)
!228 = !DILocation(line: 231, column: 44, scope: !203)
!229 = !DILocation(line: 231, column: 33, scope: !165)
!230 = !DILocation(line: 234, column: 5, scope: !165)
!231 = !DILocation(line: 231, column: 20, scope: !165)
!232 = !{i64 0, i64 2}
!233 = !{i64 1}
!234 = !DILocation(line: 231, column: 20, scope: !223)
!235 = !DILocation(line: 233, column: 35, scope: !194)
!236 = !DILocation(line: 231, column: 44, scope: !165)
!237 = !DILocation(line: 231, column: 20, scope: !203)
!238 = !DILocation(line: 231, column: 45, scope: !165)
!239 = !DILocation(line: 234, column: 6, scope: !165)
!240 = !DILocation(line: 233, column: 21, scope: !194)
!241 = !DILocation(line: 233, column: 9, scope: !194)
!242 = !DILocation(line: 230, column: 5, scope: !165)
!243 = distinct !DISubprogram(name: "add", linkageName: "_ZN13f128_internal9f128_impl79_$LT$impl$u20$core..ops..arith..Add$u20$for$u20$f128_internal..f128_t..f128$GT$3add17h0e016e3bb5e11559E", scope: !245, file: !244, line: 720, type: !247, scopeLine: 720, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !249)
!244 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_internal-0.2.2/src/f128_impl.rs", directory: "", checksumkind: CSK_MD5, checksum: "9d51e45b18c076d7be80b3cbce7922a2")
!245 = !DINamespace(name: "{impl#11}", scope: !246)
!246 = !DINamespace(name: "f128_impl", scope: !82)
!247 = !DISubroutineType(types: !248)
!248 = !{!80, !80, !80}
!249 = !{!250, !251}
!250 = !DILocalVariable(name: "self", arg: 1, scope: !243, file: !244, line: 720, type: !80)
!251 = !DILocalVariable(name: "other", arg: 2, scope: !243, file: !244, line: 720, type: !80)
!252 = !DILocation(line: 720, column: 12, scope: !243)
!253 = !DILocation(line: 720, column: 18, scope: !243)
!254 = !DILocation(line: 721, column: 32, scope: !243)
!255 = !DILocation(line: 721, column: 38, scope: !243)
!256 = !DILocation(line: 721, column: 18, scope: !243)
!257 = !DILocation(line: 722, column: 6, scope: !243)
!258 = distinct !DISubprogram(name: "div", linkageName: "_ZN13f128_internal9f128_impl79_$LT$impl$u20$core..ops..arith..Div$u20$for$u20$f128_internal..f128_t..f128$GT$3div17h8eefd78400e1c36cE", scope: !259, file: !244, line: 777, type: !247, scopeLine: 777, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !260)
!259 = !DINamespace(name: "{impl#17}", scope: !246)
!260 = !{!261, !262}
!261 = !DILocalVariable(name: "self", arg: 1, scope: !258, file: !244, line: 777, type: !80)
!262 = !DILocalVariable(name: "other", arg: 2, scope: !258, file: !244, line: 777, type: !80)
!263 = !DILocation(line: 777, column: 12, scope: !258)
!264 = !DILocation(line: 777, column: 18, scope: !258)
!265 = !DILocation(line: 778, column: 32, scope: !258)
!266 = !DILocation(line: 778, column: 38, scope: !258)
!267 = !DILocation(line: 778, column: 18, scope: !258)
!268 = !DILocation(line: 779, column: 6, scope: !258)
!269 = distinct !DISubprogram(name: "mul", linkageName: "_ZN13f128_internal9f128_impl79_$LT$impl$u20$core..ops..arith..Mul$u20$for$u20$f128_internal..f128_t..f128$GT$3mul17ha2312917ebb1bdc7E", scope: !270, file: !244, line: 758, type: !247, scopeLine: 758, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !271)
!270 = !DINamespace(name: "{impl#15}", scope: !246)
!271 = !{!272, !273}
!272 = !DILocalVariable(name: "self", arg: 1, scope: !269, file: !244, line: 758, type: !80)
!273 = !DILocalVariable(name: "other", arg: 2, scope: !269, file: !244, line: 758, type: !80)
!274 = !DILocation(line: 758, column: 12, scope: !269)
!275 = !DILocation(line: 758, column: 18, scope: !269)
!276 = !DILocation(line: 759, column: 32, scope: !269)
!277 = !DILocation(line: 759, column: 38, scope: !269)
!278 = !DILocation(line: 759, column: 18, scope: !269)
!279 = !DILocation(line: 760, column: 6, scope: !269)
!280 = distinct !DISubprogram(name: "sub", linkageName: "_ZN13f128_internal9f128_impl79_$LT$impl$u20$core..ops..arith..Sub$u20$for$u20$f128_internal..f128_t..f128$GT$3sub17hbdebe79a58b15c23E", scope: !281, file: !244, line: 739, type: !247, scopeLine: 739, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !282)
!281 = !DINamespace(name: "{impl#13}", scope: !246)
!282 = !{!283, !284}
!283 = !DILocalVariable(name: "self", arg: 1, scope: !280, file: !244, line: 739, type: !80)
!284 = !DILocalVariable(name: "other", arg: 2, scope: !280, file: !244, line: 739, type: !80)
!285 = !DILocation(line: 739, column: 12, scope: !280)
!286 = !DILocation(line: 739, column: 18, scope: !280)
!287 = !DILocation(line: 740, column: 32, scope: !280)
!288 = !DILocation(line: 740, column: 38, scope: !280)
!289 = !DILocation(line: 740, column: 18, scope: !280)
!290 = !DILocation(line: 741, column: 6, scope: !280)
!291 = distinct !DISubprogram(name: "add_assign", linkageName: "_ZN13f128_internal9f128_impl85_$LT$impl$u20$core..ops..arith..AddAssign$u20$for$u20$f128_internal..f128_t..f128$GT$10add_assign17h50ffd5749c8eacb1E", scope: !292, file: !244, line: 727, type: !293, scopeLine: 727, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !296)
!292 = !DINamespace(name: "{impl#12}", scope: !246)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295, !80}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut f128_internal::f128_t::f128", baseType: !80, size: 64, align: 64, dwarfAddressSpace: 0)
!296 = !{!297, !298}
!297 = !DILocalVariable(name: "self", arg: 1, scope: !291, file: !244, line: 727, type: !295)
!298 = !DILocalVariable(name: "other", arg: 2, scope: !291, file: !244, line: 727, type: !80)
!299 = !DILocation(line: 727, column: 19, scope: !291)
!300 = !DILocation(line: 727, column: 30, scope: !291)
!301 = !DILocation(line: 728, column: 17, scope: !291)
!302 = !DILocation(line: 728, column: 25, scope: !291)
!303 = !DILocation(line: 728, column: 9, scope: !291)
!304 = !DILocation(line: 729, column: 6, scope: !291)
!305 = distinct !DISubprogram(name: "div_assign", linkageName: "_ZN13f128_internal9f128_impl85_$LT$impl$u20$core..ops..arith..DivAssign$u20$for$u20$f128_internal..f128_t..f128$GT$10div_assign17h65bc4a3bf9d443f9E", scope: !306, file: !244, line: 784, type: !293, scopeLine: 784, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !307)
!306 = !DINamespace(name: "{impl#18}", scope: !246)
!307 = !{!308, !309}
!308 = !DILocalVariable(name: "self", arg: 1, scope: !305, file: !244, line: 784, type: !295)
!309 = !DILocalVariable(name: "other", arg: 2, scope: !305, file: !244, line: 784, type: !80)
!310 = !DILocation(line: 784, column: 19, scope: !305)
!311 = !DILocation(line: 784, column: 30, scope: !305)
!312 = !DILocation(line: 785, column: 17, scope: !305)
!313 = !DILocation(line: 785, column: 25, scope: !305)
!314 = !DILocation(line: 785, column: 9, scope: !305)
!315 = !DILocation(line: 786, column: 6, scope: !305)
!316 = distinct !DISubprogram(name: "mul_assign", linkageName: "_ZN13f128_internal9f128_impl85_$LT$impl$u20$core..ops..arith..MulAssign$u20$for$u20$f128_internal..f128_t..f128$GT$10mul_assign17h4bdf3c1658ef2d73E", scope: !317, file: !244, line: 765, type: !293, scopeLine: 765, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !318)
!317 = !DINamespace(name: "{impl#16}", scope: !246)
!318 = !{!319, !320}
!319 = !DILocalVariable(name: "self", arg: 1, scope: !316, file: !244, line: 765, type: !295)
!320 = !DILocalVariable(name: "other", arg: 2, scope: !316, file: !244, line: 765, type: !80)
!321 = !DILocation(line: 765, column: 19, scope: !316)
!322 = !DILocation(line: 765, column: 30, scope: !316)
!323 = !DILocation(line: 766, column: 17, scope: !316)
!324 = !DILocation(line: 766, column: 25, scope: !316)
!325 = !DILocation(line: 766, column: 9, scope: !316)
!326 = !DILocation(line: 767, column: 6, scope: !316)
!327 = distinct !DISubprogram(name: "sub_assign", linkageName: "_ZN13f128_internal9f128_impl85_$LT$impl$u20$core..ops..arith..SubAssign$u20$for$u20$f128_internal..f128_t..f128$GT$10sub_assign17hf112ac315613c7bcE", scope: !328, file: !244, line: 746, type: !293, scopeLine: 746, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !329)
!328 = !DINamespace(name: "{impl#14}", scope: !246)
!329 = !{!330, !331}
!330 = !DILocalVariable(name: "self", arg: 1, scope: !327, file: !244, line: 746, type: !295)
!331 = !DILocalVariable(name: "other", arg: 2, scope: !327, file: !244, line: 746, type: !80)
!332 = !DILocation(line: 746, column: 19, scope: !327)
!333 = !DILocation(line: 746, column: 30, scope: !327)
!334 = !DILocation(line: 747, column: 17, scope: !327)
!335 = !DILocation(line: 747, column: 25, scope: !327)
!336 = !DILocation(line: 747, column: 9, scope: !327)
!337 = !DILocation(line: 748, column: 6, scope: !327)
!338 = distinct !DISubprogram(name: "from", linkageName: "_ZN13f128_internal9f128_impl88_$LT$impl$u20$core..convert..From$LT$f64$GT$$u20$for$u20$f128_internal..f128_t..f128$GT$4from17h4b312a78a0e70f09E", scope: !339, file: !244, line: 839, type: !340, scopeLine: 839, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !342)
!339 = !DINamespace(name: "{impl#193}", scope: !246)
!340 = !DISubroutineType(types: !341)
!341 = !{!80, !97}
!342 = !{!343}
!343 = !DILocalVariable(name: "small", arg: 1, scope: !338, file: !244, line: 839, type: !97)
!344 = !DILocation(line: 839, column: 21, scope: !338)
!345 = !DILocation(line: 840, column: 54, scope: !338)
!346 = !DILocation(line: 840, column: 48, scope: !338)
!347 = !DILocation(line: 840, column: 26, scope: !338)
!348 = !DILocation(line: 841, column: 14, scope: !338)
!349 = distinct !DISubprogram(name: "from", linkageName: "_ZN13f128_internal9f128_impl88_$LT$impl$u20$core..convert..From$LT$i32$GT$$u20$for$u20$f128_internal..f128_t..f128$GT$4from17h2e11bcfe338c0b18E", scope: !350, file: !244, line: 839, type: !351, scopeLine: 839, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !353)
!350 = !DINamespace(name: "{impl#173}", scope: !246)
!351 = !DISubroutineType(types: !352)
!352 = !{!80, !117}
!353 = !{!354}
!354 = !DILocalVariable(name: "small", arg: 1, scope: !349, file: !244, line: 839, type: !117)
!355 = !DILocation(line: 839, column: 21, scope: !349)
!356 = !DILocation(line: 840, column: 54, scope: !349)
!357 = !DILocation(line: 840, column: 48, scope: !349)
!358 = !DILocation(line: 840, column: 26, scope: !349)
!359 = !DILocation(line: 841, column: 14, scope: !349)
!360 = distinct !DISubprogram(name: "from_residual<f128_internal::f128_t::f128, alloc::ffi::c_str::NulError, alloc::ffi::c_str::NulError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h3a387e7b55f23504E", scope: !362, file: !361, line: 2132, type: !363, scopeLine: 2132, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !377, retainedNodes: !373)
!361 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "376d3f50f2b6d030dde9244768e6c6e1")
!362 = !DINamespace(name: "{impl#28}", scope: !170)
!363 = !DISubroutineType(types: !364)
!364 = !{!169, !204, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !366, size: 64, align: 64, dwarfAddressSpace: 0)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !367, file: !2, size: 192, align: 64, elements: !369, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!367 = !DINamespace(name: "location", scope: !368)
!368 = !DINamespace(name: "panic", scope: !50)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !366, file: !2, baseType: !186, size: 128, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !366, file: !2, baseType: !107, size: 32, align: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !366, file: !2, baseType: !107, size: 32, align: 32, offset: 160)
!373 = !{!374, !375}
!374 = !DILocalVariable(name: "residual", arg: 1, scope: !360, file: !361, line: 2132, type: !204)
!375 = !DILocalVariable(name: "e", scope: !376, file: !361, line: 2134, type: !32, align: 8)
!376 = distinct !DILexicalBlock(scope: !360, file: !361, line: 2134, column: 13)
!377 = !{!179, !180, !378}
!378 = !DITemplateTypeParameter(name: "F", type: !32)
!379 = !DILocation(line: 2132, column: 22, scope: !360)
!380 = !DILocation(line: 2134, column: 17, scope: !376)
!381 = !DILocation(line: 2134, column: 17, scope: !360)
!382 = !DILocation(line: 2134, column: 38, scope: !376)
!383 = !DILocation(line: 2134, column: 27, scope: !376)
!384 = !DILocation(line: 2134, column: 23, scope: !376)
!385 = !DILocation(line: 2136, column: 6, scope: !360)
!386 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h2ad26d55e648eb3bE", scope: !388, file: !387, line: 118, type: !390, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !396, retainedNodes: !392)
!387 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!388 = !DINamespace(name: "backtrace", scope: !389)
!389 = !DINamespace(name: "sys_common", scope: !17)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !20}
!392 = !{!393, !394}
!393 = !DILocalVariable(name: "f", arg: 1, scope: !386, file: !387, line: 118, type: !20)
!394 = !DILocalVariable(name: "result", scope: !395, file: !387, line: 122, type: !7, align: 1)
!395 = distinct !DILexicalBlock(scope: !386, file: !387, line: 122, column: 5)
!396 = !{!397, !398}
!397 = !DITemplateTypeParameter(name: "F", type: !20)
!398 = !DITemplateTypeParameter(name: "T", type: !7)
!399 = !DILocation(line: 122, column: 9, scope: !395)
!400 = !DILocation(line: 118, column: 43, scope: !386)
!401 = !DILocalVariable(name: "dummy", scope: !402, file: !387, line: 125, type: !7, align: 1)
!402 = !DILexicalBlockFile(scope: !403, file: !387, discriminator: 0)
!403 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h3f552cf32f5a2d5bE", scope: !405, file: !404, line: 225, type: !406, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !409, retainedNodes: !408)
!404 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!405 = !DINamespace(name: "hint", scope: !50)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !7}
!408 = !{!401}
!409 = !{!398}
!410 = !DILocation(line: 125, column: 5, scope: !402, inlinedAt: !411)
!411 = !DILocation(line: 125, column: 5, scope: !395)
!412 = !DILocation(line: 122, column: 18, scope: !386)
!413 = !{i32 3344660}
!414 = !DILocation(line: 128, column: 2, scope: !386)
!415 = !DILocation(line: 128, column: 1, scope: !386)
!416 = !DILocation(line: 118, column: 1, scope: !386)
!417 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h8eb5038201c228aaE", scope: !16, file: !418, line: 139, type: !419, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !409, retainedNodes: !423)
!418 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !20, !421, !422}
!421 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!423 = !{!424, !425, !426, !427}
!424 = !DILocalVariable(name: "main", arg: 1, scope: !417, file: !418, line: 140, type: !20)
!425 = !DILocalVariable(name: "argc", arg: 2, scope: !417, file: !418, line: 141, type: !421)
!426 = !DILocalVariable(name: "argv", arg: 3, scope: !417, file: !418, line: 142, type: !422)
!427 = !DILocalVariable(name: "v", scope: !428, file: !418, line: 144, type: !421, align: 8)
!428 = distinct !DILexicalBlock(scope: !417, file: !418, line: 144, column: 5)
!429 = !DILocation(line: 140, column: 5, scope: !417)
!430 = !DILocation(line: 141, column: 5, scope: !417)
!431 = !DILocation(line: 142, column: 5, scope: !417)
!432 = !DILocation(line: 145, column: 10, scope: !417)
!433 = !DILocation(line: 145, column: 9, scope: !417)
!434 = !DILocation(line: 144, column: 17, scope: !417)
!435 = !DILocation(line: 144, column: 12, scope: !417)
!436 = !DILocation(line: 144, column: 12, scope: !428)
!437 = !DILocation(line: 150, column: 2, scope: !417)
!438 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h288f4bf667d5990dE", scope: !15, file: !418, line: 145, type: !439, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !409, retainedNodes: !442)
!439 = !DISubroutineType(types: !440)
!440 = !{!117, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!442 = !{!443}
!443 = !DILocalVariable(name: "main", scope: !438, file: !418, line: 140, type: !20, align: 8)
!444 = !{i64 8}
!445 = !DILocation(line: 140, column: 5, scope: !438)
!446 = !DILocalVariable(name: "self", scope: !447, file: !418, line: 145, type: !450, align: 1)
!447 = !DILexicalBlockFile(scope: !448, file: !418, discriminator: 0)
!448 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h2cbc3bcd8846ec77E", scope: !450, file: !449, line: 1808, type: !461, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !463)
!449 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !451, file: !2, size: 8, align: 8, elements: !452, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!451 = !DINamespace(name: "process", scope: !17)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !450, file: !2, baseType: !454, size: 8, align: 8)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !455, file: !2, size: 8, align: 8, elements: !459, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!455 = !DINamespace(name: "process_common", scope: !456)
!456 = !DINamespace(name: "process", scope: !457)
!457 = !DINamespace(name: "unix", scope: !458)
!458 = !DINamespace(name: "sys", scope: !17)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !2, baseType: !58, size: 8, align: 8)
!461 = !DISubroutineType(types: !462)
!462 = !{!117, !450}
!463 = !{!446}
!464 = !DILocation(line: 145, column: 18, scope: !447, inlinedAt: !465)
!465 = !DILocation(line: 145, column: 18, scope: !438)
!466 = !DILocation(line: 145, column: 77, scope: !438)
!467 = !DILocalVariable(name: "self", scope: !468, file: !418, line: 145, type: !473, align: 8)
!468 = !DILexicalBlockFile(scope: !469, file: !418, discriminator: 0)
!469 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217hc4fa9ea082e0911eE", scope: !454, file: !470, line: 485, type: !471, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !474)
!470 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!471 = !DISubroutineType(types: !472)
!472 = !{!117, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !454, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !{!467}
!475 = !DILocation(line: 145, column: 18, scope: !468, inlinedAt: !476)
!476 = !DILocation(line: 1809, column: 9, scope: !448, inlinedAt: !465)
!477 = !DILocation(line: 145, column: 17, scope: !438)
!478 = distinct !DISubprogram(name: "fmt<f32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h32363363013cd803E", scope: !480, file: !479, line: 2361, type: !481, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !538, retainedNodes: !535)
!479 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!480 = !DINamespace(name: "{impl#59}", scope: !152)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !499, !500}
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !170, file: !2, size: 8, align: 8, elements: !484, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!484 = !{!485}
!485 = !DICompositeType(tag: DW_TAG_variant_part, scope: !483, file: !2, size: 8, align: 8, elements: !486, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !498)
!486 = !{!487, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !485, file: !2, baseType: !488, size: 8, align: 8, extraData: i64 0)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !483, file: !2, size: 8, align: 8, elements: !489, templateParams: !491, identifier: "cea751326735c343faf647063a65ad14")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !2, baseType: !7, align: 8, offset: 8)
!491 = !{!398, !492}
!492 = !DITemplateTypeParameter(name: "E", type: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !152, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !485, file: !2, baseType: !495, size: 8, align: 8, extraData: i64 1)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !483, file: !2, size: 8, align: 8, elements: !496, templateParams: !491, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !495, file: !2, baseType: !493, align: 8, offset: 8)
!498 = !DIDerivedType(tag: DW_TAG_member, scope: !483, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagArtificial)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f32", baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !152, file: !2, size: 512, align: 64, elements: !502, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!502 = !{!503, !504, !506, !507, !523, !524}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !501, file: !2, baseType: !107, size: 32, align: 32, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !501, file: !2, baseType: !505, size: 32, align: 32, offset: 416)
!505 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !501, file: !2, baseType: !149, size: 8, align: 8, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !501, file: !2, baseType: !508, size: 128, align: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !509, file: !2, size: 128, align: 64, elements: !510, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!509 = !DINamespace(name: "option", scope: !50)
!510 = !{!511}
!511 = !DICompositeType(tag: DW_TAG_variant_part, scope: !508, file: !2, size: 128, align: 64, elements: !512, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !521)
!512 = !{!513, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !511, file: !2, baseType: !514, size: 128, align: 64, extraData: i64 0)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !508, file: !2, size: 128, align: 64, elements: !23, templateParams: !515, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "T", type: !9)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !511, file: !2, baseType: !518, size: 128, align: 64, extraData: i64 1)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !508, file: !2, size: 128, align: 64, elements: !519, templateParams: !515, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !518, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, scope: !508, file: !2, baseType: !522, size: 64, align: 64, flags: DIFlagArtificial)
!522 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !501, file: !2, baseType: !508, size: 128, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !501, file: !2, baseType: !525, size: 128, align: 64, offset: 256)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !526, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!526 = !{!527, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !525, file: !2, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64, dwarfAddressSpace: 0)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !525, file: !2, baseType: !531, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !532, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 3, lowerBound: 0)
!535 = !{!536, !537}
!536 = !DILocalVariable(name: "self", arg: 1, scope: !478, file: !479, line: 2361, type: !499)
!537 = !DILocalVariable(name: "f", arg: 2, scope: !478, file: !479, line: 2361, type: !500)
!538 = !{!539}
!539 = !DITemplateTypeParameter(name: "T", type: !127)
!540 = !DILocation(line: 2361, column: 20, scope: !478)
!541 = !DILocation(line: 2361, column: 27, scope: !478)
!542 = !DILocation(line: 2361, column: 71, scope: !478)
!543 = !{i64 4}
!544 = !DILocation(line: 2361, column: 62, scope: !478)
!545 = !DILocation(line: 2361, column: 84, scope: !478)
!546 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3a5632a5f902d94dE", scope: !480, file: !479, line: 2361, type: !547, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !553, retainedNodes: !550)
!547 = !DISubroutineType(types: !548)
!548 = !{!483, !549, !500}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !116, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !{!551, !552}
!551 = !DILocalVariable(name: "self", arg: 1, scope: !546, file: !479, line: 2361, type: !549)
!552 = !DILocalVariable(name: "f", arg: 2, scope: !546, file: !479, line: 2361, type: !500)
!553 = !{!554}
!554 = !DITemplateTypeParameter(name: "T", type: !117)
!555 = !DILocation(line: 2361, column: 20, scope: !546)
!556 = !DILocation(line: 2361, column: 27, scope: !546)
!557 = !DILocation(line: 2361, column: 71, scope: !546)
!558 = !DILocation(line: 2361, column: 62, scope: !546)
!559 = !DILocation(line: 2361, column: 84, scope: !546)
!560 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h57c55c1ce858e639E", scope: !480, file: !479, line: 2361, type: !561, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !567, retainedNodes: !564)
!561 = !DISubroutineType(types: !562)
!562 = !{!483, !563, !500}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u32", baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !{!565, !566}
!565 = !DILocalVariable(name: "self", arg: 1, scope: !560, file: !479, line: 2361, type: !563)
!566 = !DILocalVariable(name: "f", arg: 2, scope: !560, file: !479, line: 2361, type: !500)
!567 = !{!568}
!568 = !DITemplateTypeParameter(name: "T", type: !107)
!569 = !DILocation(line: 2361, column: 20, scope: !560)
!570 = !DILocation(line: 2361, column: 27, scope: !560)
!571 = !DILocation(line: 2361, column: 71, scope: !560)
!572 = !DILocation(line: 2361, column: 62, scope: !560)
!573 = !DILocation(line: 2361, column: 84, scope: !560)
!574 = distinct !DISubprogram(name: "fmt<f64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17haacf6983f18e03efE", scope: !480, file: !479, line: 2361, type: !575, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !581, retainedNodes: !578)
!575 = !DISubroutineType(types: !576)
!576 = !{!483, !577, !500}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f64", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!578 = !{!579, !580}
!579 = !DILocalVariable(name: "self", arg: 1, scope: !574, file: !479, line: 2361, type: !577)
!580 = !DILocalVariable(name: "f", arg: 2, scope: !574, file: !479, line: 2361, type: !500)
!581 = !{!582}
!582 = !DITemplateTypeParameter(name: "T", type: !97)
!583 = !DILocation(line: 2361, column: 20, scope: !574)
!584 = !DILocation(line: 2361, column: 27, scope: !574)
!585 = !DILocation(line: 2361, column: 71, scope: !574)
!586 = !DILocation(line: 2361, column: 62, scope: !574)
!587 = !DILocation(line: 2361, column: 84, scope: !574)
!588 = distinct !DISubprogram(name: "fmt<f128_internal::f128_t::f128>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hebef7821152acb03E", scope: !480, file: !479, line: 2361, type: !589, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !595, retainedNodes: !592)
!589 = !DISubroutineType(types: !590)
!590 = !{!483, !591, !500}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f128_internal::f128_t::f128", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!592 = !{!593, !594}
!593 = !DILocalVariable(name: "self", arg: 1, scope: !588, file: !479, line: 2361, type: !591)
!594 = !DILocalVariable(name: "f", arg: 2, scope: !588, file: !479, line: 2361, type: !500)
!595 = !{!179}
!596 = !DILocation(line: 2361, column: 20, scope: !588)
!597 = !DILocation(line: 2361, column: 27, scope: !588)
!598 = !DILocation(line: 2361, column: 71, scope: !588)
!599 = !DILocation(line: 2361, column: 62, scope: !588)
!600 = !DILocation(line: 2361, column: 84, scope: !588)
!601 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3ffi5c_str4CStr6as_ptr17h4e6048267655f0ccE", scope: !603, file: !602, line: 475, type: !609, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !617)
!602 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ffi/c_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "a50c941e663797b3cd132afeffc32d87")
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !604, file: !2, align: 8, elements: !606, templateParams: !23, identifier: "2da013c6b133655882cf6258a2093276")
!604 = !DINamespace(name: "c_str", scope: !605)
!605 = !DINamespace(name: "ffi", scope: !50)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !603, file: !2, baseType: !608, align: 8)
!608 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!609 = !DISubroutineType(types: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !608, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "&core::ffi::c_str::CStr", file: !2, size: 128, align: 64, elements: !613, templateParams: !23, identifier: "9a691f075a9e4b9c7e7049abca5ed1fb")
!613 = !{!614, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !612, file: !2, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64, dwarfAddressSpace: 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !612, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!617 = !{!618}
!618 = !DILocalVariable(name: "self", arg: 1, scope: !601, file: !602, line: 475, type: !612)
!619 = !DILocation(line: 475, column: 25, scope: !601)
!620 = !DILocation(line: 476, column: 9, scope: !601)
!621 = !DILocalVariable(name: "self", scope: !622, file: !602, line: 476, type: !629, align: 8)
!622 = !DILexicalBlockFile(scope: !623, file: !602, discriminator: 0)
!623 = distinct !DISubprogram(name: "as_ptr<i8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17ha03950a2fd9f0b72E", scope: !625, file: !624, line: 476, type: !627, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !635, retainedNodes: !634)
!624 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!625 = !DINamespace(name: "{impl#0}", scope: !626)
!626 = !DINamespace(name: "slice", scope: !50)
!627 = !DISubroutineType(types: !628)
!628 = !{!611, !629}
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i8]", file: !2, size: 128, align: 64, elements: !630, templateParams: !23, identifier: "cc2ad320ed202ac3c13bb57e7e44d101")
!630 = !{!631, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !629, file: !2, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64, dwarfAddressSpace: 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!634 = !{!621}
!635 = !{!636}
!636 = !DITemplateTypeParameter(name: "T", type: !608)
!637 = !DILocation(line: 476, column: 9, scope: !622, inlinedAt: !620)
!638 = !DILocation(line: 477, column: 6, scope: !601)
!639 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17ha554e07f564d359dE", scope: !641, file: !640, line: 185, type: !643, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !645)
!640 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!641 = !DINamespace(name: "{impl#80}", scope: !642)
!642 = !DINamespace(name: "num", scope: !152)
!643 = !DISubroutineType(types: !644)
!644 = !{!483, !116, !500}
!645 = !{!646, !647}
!646 = !DILocalVariable(name: "self", arg: 1, scope: !639, file: !640, line: 185, type: !116)
!647 = !DILocalVariable(name: "f", arg: 2, scope: !639, file: !640, line: 185, type: !500)
!648 = !DILocation(line: 185, column: 20, scope: !639)
!649 = !DILocation(line: 185, column: 27, scope: !639)
!650 = !DILocation(line: 186, column: 20, scope: !639)
!651 = !DILocation(line: 188, column: 27, scope: !639)
!652 = !DILocation(line: 187, column: 21, scope: !639)
!653 = !DILocation(line: 186, column: 17, scope: !639)
!654 = !DILocation(line: 193, column: 14, scope: !639)
!655 = !{i8 0, i8 2}
!656 = !DILocation(line: 191, column: 21, scope: !639)
!657 = !DILocation(line: 189, column: 21, scope: !639)
!658 = !DILocation(line: 188, column: 24, scope: !639)
!659 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17h56a3d5ee864e67aeE", scope: !660, file: !640, line: 185, type: !661, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !663)
!660 = !DINamespace(name: "{impl#86}", scope: !642)
!661 = !DISubroutineType(types: !662)
!662 = !{!483, !106, !500}
!663 = !{!664, !665}
!664 = !DILocalVariable(name: "self", arg: 1, scope: !659, file: !640, line: 185, type: !106)
!665 = !DILocalVariable(name: "f", arg: 2, scope: !659, file: !640, line: 185, type: !500)
!666 = !DILocation(line: 185, column: 20, scope: !659)
!667 = !DILocation(line: 185, column: 27, scope: !659)
!668 = !DILocation(line: 186, column: 20, scope: !659)
!669 = !DILocation(line: 188, column: 27, scope: !659)
!670 = !DILocation(line: 187, column: 21, scope: !659)
!671 = !DILocation(line: 186, column: 17, scope: !659)
!672 = !DILocation(line: 193, column: 14, scope: !659)
!673 = !DILocation(line: 191, column: 21, scope: !659)
!674 = !DILocation(line: 189, column: 21, scope: !659)
!675 = !DILocation(line: 188, column: 24, scope: !659)
!676 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h88d85ab8102a1e93E", scope: !677, file: !479, line: 390, type: !746, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !748)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !152, file: !2, size: 384, align: 64, elements: !678, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!678 = !{!679, !685, !730}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !677, file: !2, baseType: !680, size: 128, align: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !681, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !680, file: !2, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !680, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !677, file: !2, baseType: !686, size: 128, align: 64, offset: 128)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !509, file: !2, size: 128, align: 64, elements: !687, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!687 = !{!688}
!688 = !DICompositeType(tag: DW_TAG_variant_part, scope: !686, file: !2, size: 128, align: 64, elements: !689, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !729)
!689 = !{!690, !725}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !688, file: !2, baseType: !691, size: 128, align: 64, extraData: i64 0)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !686, file: !2, size: 128, align: 64, elements: !23, templateParams: !692, identifier: "742dbe7e160661d8ca36fcfff2574850")
!692 = !{!693}
!693 = !DITemplateTypeParameter(name: "T", type: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !695, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!695 = !{!696, !724}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !694, file: !2, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !150, file: !2, size: 448, align: 64, elements: !699, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !698, file: !2, baseType: !9, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !698, file: !2, baseType: !702, size: 384, align: 64, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !150, file: !2, size: 384, align: 64, elements: !703, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!703 = !{!704, !705, !706, !707, !723}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !702, file: !2, baseType: !505, size: 32, align: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !702, file: !2, baseType: !149, size: 8, align: 8, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !702, file: !2, baseType: !107, size: 32, align: 32, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !702, file: !2, baseType: !708, size: 128, align: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !150, file: !2, size: 128, align: 64, elements: !709, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!709 = !{!710}
!710 = !DICompositeType(tag: DW_TAG_variant_part, scope: !708, file: !2, size: 128, align: 64, elements: !711, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !722)
!711 = !{!712, !716, !720}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !710, file: !2, baseType: !713, size: 128, align: 64, extraData: i64 0)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !708, file: !2, size: 128, align: 64, elements: !714, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !710, file: !2, baseType: !717, size: 128, align: 64, extraData: i64 1)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !708, file: !2, size: 128, align: 64, elements: !718, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !717, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !710, file: !2, baseType: !721, size: 128, align: 64, extraData: i64 2)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !708, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!722 = !DIDerivedType(tag: DW_TAG_member, scope: !708, file: !2, baseType: !522, size: 64, align: 64, flags: DIFlagArtificial)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !702, file: !2, baseType: !708, size: 128, align: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !694, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !688, file: !2, baseType: !726, size: 128, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !686, file: !2, size: 128, align: 64, elements: !727, templateParams: !692, identifier: "17f2fc106094349c7673abca4839c97a")
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !726, file: !2, baseType: !694, size: 128, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !686, file: !2, baseType: !522, size: 64, align: 64, flags: DIFlagArtificial)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !677, file: !2, baseType: !731, size: 128, align: 64, offset: 256)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !732, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!732 = !{!733, !745}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !731, file: !2, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64, dwarfAddressSpace: 0)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !152, file: !2, size: 128, align: 64, elements: !736, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!736 = !{!737, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !735, file: !2, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !739, size: 64, align: 64, dwarfAddressSpace: 0)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !740, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!740 = !DINamespace(name: "{extern#0}", scope: !152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !735, file: !2, baseType: !742, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !743, size: 64, align: 64, dwarfAddressSpace: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!483, !738, !500}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!677, !680, !731}
!748 = !{!749, !750}
!749 = !DILocalVariable(name: "pieces", arg: 1, scope: !676, file: !479, line: 390, type: !680)
!750 = !DILocalVariable(name: "args", arg: 2, scope: !676, file: !479, line: 390, type: !731)
!751 = !DILocation(line: 390, column: 25, scope: !676)
!752 = !DILocation(line: 390, column: 53, scope: !676)
!753 = !DILocation(line: 391, column: 12, scope: !676)
!754 = !DILocation(line: 391, column: 56, scope: !676)
!755 = !DILocation(line: 391, column: 41, scope: !676)
!756 = !DILocation(line: 394, column: 34, scope: !676)
!757 = !DILocation(line: 394, column: 9, scope: !676)
!758 = !DILocation(line: 395, column: 6, scope: !676)
!759 = !DILocation(line: 392, column: 13, scope: !676)
!760 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17had14ef1426e0b3ddE", scope: !762, file: !761, line: 248, type: !765, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !771, retainedNodes: !768)
!761 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!762 = !DINamespace(name: "FnOnce", scope: !763)
!763 = !DINamespace(name: "function", scope: !764)
!764 = !DINamespace(name: "ops", scope: !50)
!765 = !DISubroutineType(types: !766)
!766 = !{!117, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!768 = !{!769, !770}
!769 = !DILocalVariable(arg: 1, scope: !760, file: !761, line: 248, type: !767)
!770 = !DILocalVariable(arg: 2, scope: !760, file: !761, line: 248, type: !7)
!771 = !{!772, !773}
!772 = !DITemplateTypeParameter(name: "Self", type: !14)
!773 = !DITemplateTypeParameter(name: "Args", type: !7)
!774 = !DILocation(line: 248, column: 5, scope: !760)
!775 = distinct !DISubprogram(name: "call_once<long_double_tests::test_long_double::test_long_double_casts::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h6553f572fc176181E", scope: !762, file: !761, line: 248, type: !776, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !784, retainedNodes: !781)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !778}
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !779, file: !2, align: 8, elements: !23, identifier: "5370052d11f5ba1f27bb8b7ac7990dd4")
!779 = !DINamespace(name: "test_long_double_casts", scope: !780)
!780 = !DINamespace(name: "test_long_double", scope: !131)
!781 = !{!782, !783}
!782 = !DILocalVariable(arg: 1, scope: !775, file: !761, line: 248, type: !778)
!783 = !DILocalVariable(arg: 2, scope: !775, file: !761, line: 248, type: !7)
!784 = !{!785, !773}
!785 = !DITemplateTypeParameter(name: "Self", type: !778)
!786 = !DILocation(line: 248, column: 5, scope: !775)
!787 = distinct !DISubprogram(name: "call_once<long_double_tests::test_long_double::test_global_f128s::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h71e6e3416e1a35a5E", scope: !762, file: !761, line: 248, type: !788, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !795, retainedNodes: !792)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !790}
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !791, file: !2, align: 8, elements: !23, identifier: "40831ffea2d726dccc3f785caab687c6")
!791 = !DINamespace(name: "test_global_f128s", scope: !780)
!792 = !{!793, !794}
!793 = !DILocalVariable(arg: 1, scope: !787, file: !761, line: 248, type: !790)
!794 = !DILocalVariable(arg: 2, scope: !787, file: !761, line: 248, type: !7)
!795 = !{!796, !773}
!796 = !DITemplateTypeParameter(name: "Self", type: !790)
!797 = !DILocation(line: 248, column: 5, scope: !787)
!798 = distinct !DISubprogram(name: "call_once<long_double_tests::test_long_double::test_long_double_ops::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h7c2c7b2f8b8ede83E", scope: !762, file: !761, line: 248, type: !799, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !806, retainedNodes: !803)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !801}
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !802, file: !2, align: 8, elements: !23, identifier: "6535ea1411c4ad14dc08c5c504349379")
!802 = !DINamespace(name: "test_long_double_ops", scope: !780)
!803 = !{!804, !805}
!804 = !DILocalVariable(arg: 1, scope: !798, file: !761, line: 248, type: !801)
!805 = !DILocalVariable(arg: 2, scope: !798, file: !761, line: 248, type: !7)
!806 = !{!807, !773}
!807 = !DITemplateTypeParameter(name: "Self", type: !801)
!808 = !DILocation(line: 248, column: 5, scope: !798)
!809 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h7de162bd9f8346bbE", scope: !762, file: !761, line: 248, type: !390, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !813, retainedNodes: !810)
!810 = !{!811, !812}
!811 = !DILocalVariable(arg: 1, scope: !809, file: !761, line: 248, type: !20)
!812 = !DILocalVariable(arg: 2, scope: !809, file: !761, line: 248, type: !7)
!813 = !{!814, !773}
!814 = !DITemplateTypeParameter(name: "Self", type: !20)
!815 = !DILocation(line: 248, column: 5, scope: !809)
!816 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h8d02517b35048212E", scope: !762, file: !761, line: 248, type: !817, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !771, retainedNodes: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{!117, !14}
!819 = !{!820, !821}
!820 = !DILocalVariable(arg: 1, scope: !816, file: !761, line: 248, type: !14)
!821 = !DILocalVariable(arg: 2, scope: !816, file: !761, line: 248, type: !7)
!822 = !DILocation(line: 248, column: 5, scope: !816)
!823 = distinct !DISubprogram(name: "drop_in_place<&f32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f32$GT$17h9bba9f16d938ecdeE", scope: !49, file: !824, line: 487, type: !825, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !830, retainedNodes: !828)
!824 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!825 = !DISubroutineType(types: !826)
!826 = !{null, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f32", baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!828 = !{!829}
!829 = !DILocalVariable(arg: 1, scope: !823, file: !824, line: 487, type: !827)
!830 = !{!831}
!831 = !DITemplateTypeParameter(name: "T", type: !126)
!832 = !DILocation(line: 487, column: 1, scope: !823)
!833 = distinct !DISubprogram(name: "drop_in_place<&f64>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f64$GT$17hcf9b948cc8e2d0e6E", scope: !49, file: !824, line: 487, type: !834, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !839, retainedNodes: !837)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f64", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!837 = !{!838}
!838 = !DILocalVariable(arg: 1, scope: !833, file: !824, line: 487, type: !836)
!839 = !{!840}
!840 = !DITemplateTypeParameter(name: "T", type: !96)
!841 = !DILocation(line: 487, column: 1, scope: !833)
!842 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h2e0a6661206f1eefE", scope: !49, file: !824, line: 487, type: !843, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !848, retainedNodes: !846)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !116, size: 64, align: 64, dwarfAddressSpace: 0)
!846 = !{!847}
!847 = !DILocalVariable(arg: 1, scope: !842, file: !824, line: 487, type: !845)
!848 = !{!849}
!849 = !DITemplateTypeParameter(name: "T", type: !116)
!850 = !DILocation(line: 487, column: 1, scope: !842)
!851 = distinct !DISubprogram(name: "drop_in_place<&u32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$u32$GT$17h005384772950bf8cE", scope: !49, file: !824, line: 487, type: !852, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !857, retainedNodes: !855)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &u32", baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!855 = !{!856}
!856 = !DILocalVariable(arg: 1, scope: !851, file: !824, line: 487, type: !854)
!857 = !{!858}
!858 = !DITemplateTypeParameter(name: "T", type: !106)
!859 = !DILocation(line: 487, column: 1, scope: !851)
!860 = distinct !DISubprogram(name: "drop_in_place<&f128_internal::f128_t::f128>", linkageName: "_ZN4core3ptr52drop_in_place$LT$$RF$f128_internal..f128_t..f128$GT$17hebfda861dddfe92dE", scope: !49, file: !824, line: 487, type: !861, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !866, retainedNodes: !864)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f128_internal::f128_t::f128", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!864 = !{!865}
!865 = !DILocalVariable(arg: 1, scope: !860, file: !824, line: 487, type: !863)
!866 = !{!867}
!867 = !DITemplateTypeParameter(name: "T", type: !79)
!868 = !DILocation(line: 487, column: 1, scope: !860)
!869 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h8e0289d8f2bb6c8dE", scope: !49, file: !824, line: 487, type: !870, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !874, retainedNodes: !872)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !767}
!872 = !{!873}
!873 = !DILocalVariable(arg: 1, scope: !869, file: !824, line: 487, type: !767)
!874 = !{!875}
!875 = !DITemplateTypeParameter(name: "T", type: !14)
!876 = !DILocation(line: 487, column: 1, scope: !869)
!877 = distinct !DISubprogram(name: "unwrap<f64>", linkageName: "_ZN4core6option15Option$LT$T$GT$6unwrap17hcc7ca2809f77fc74E", scope: !879, file: !878, line: 772, type: !890, scopeLine: 772, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !581, retainedNodes: !892)
!878 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "86a5483c3993f03690545387e943de77")
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<f64>", scope: !509, file: !2, size: 128, align: 64, elements: !880, templateParams: !23, identifier: "7cf3ecb3e95297685509d54ac59b1c6d")
!880 = !{!881}
!881 = !DICompositeType(tag: DW_TAG_variant_part, scope: !879, file: !2, size: 128, align: 64, elements: !882, templateParams: !23, identifier: "8974dbcdaa9bf243e5e01a5e27bb1720", discriminator: !889)
!882 = !{!883, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !881, file: !2, baseType: !884, size: 128, align: 64, extraData: i64 0)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !879, file: !2, size: 128, align: 64, elements: !23, templateParams: !581, identifier: "cda08badc52341cf50d1337ffc59d1fa")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !881, file: !2, baseType: !886, size: 128, align: 64, extraData: i64 1)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !879, file: !2, size: 128, align: 64, elements: !887, templateParams: !581, identifier: "f2bfa15d90d1d0b8f5dcc98dc5fa7b19")
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !886, file: !2, baseType: !97, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, scope: !879, file: !2, baseType: !522, size: 64, align: 64, flags: DIFlagArtificial)
!890 = !DISubroutineType(types: !891)
!891 = !{!97, !879, !365}
!892 = !{!893, !894}
!893 = !DILocalVariable(name: "self", arg: 1, scope: !877, file: !878, line: 772, type: !879)
!894 = !DILocalVariable(name: "val", scope: !895, file: !878, line: 774, type: !97, align: 8)
!895 = distinct !DILexicalBlock(scope: !877, file: !878, line: 774, column: 13)
!896 = !DILocation(line: 772, column: 25, scope: !877)
!897 = !DILocation(line: 773, column: 15, scope: !877)
!898 = !DILocation(line: 773, column: 9, scope: !877)
!899 = !DILocation(line: 775, column: 21, scope: !877)
!900 = !DILocation(line: 774, column: 18, scope: !877)
!901 = !DILocation(line: 774, column: 18, scope: !895)
!902 = !DILocation(line: 777, column: 6, scope: !877)
!903 = distinct !DISubprogram(name: "unwrap<f32>", linkageName: "_ZN4core6option15Option$LT$T$GT$6unwrap17he7db058b6f91e671E", scope: !904, file: !878, line: 772, type: !915, scopeLine: 772, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !538, retainedNodes: !917)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<f32>", scope: !509, file: !2, size: 64, align: 32, elements: !905, templateParams: !23, identifier: "6f8430e8115d3b4ff389f567af163f")
!905 = !{!906}
!906 = !DICompositeType(tag: DW_TAG_variant_part, scope: !904, file: !2, size: 64, align: 32, elements: !907, templateParams: !23, identifier: "cd207624308c3e385c2e67fb4241ffc", discriminator: !914)
!907 = !{!908, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !906, file: !2, baseType: !909, size: 64, align: 32, extraData: i64 0)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !904, file: !2, size: 64, align: 32, elements: !23, templateParams: !538, identifier: "adc8a8c4836991b3bb7e6ba67a494fe1")
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !906, file: !2, baseType: !911, size: 64, align: 32, extraData: i64 1)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !904, file: !2, size: 64, align: 32, elements: !912, templateParams: !538, identifier: "4e574d0c19de39f4ab87b007d377c1fa")
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !911, file: !2, baseType: !127, size: 32, align: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, scope: !904, file: !2, baseType: !107, size: 32, align: 32, flags: DIFlagArtificial)
!915 = !DISubroutineType(types: !916)
!916 = !{!127, !904, !365}
!917 = !{!918, !919}
!918 = !DILocalVariable(name: "self", arg: 1, scope: !903, file: !878, line: 772, type: !904)
!919 = !DILocalVariable(name: "val", scope: !920, file: !878, line: 774, type: !127, align: 4)
!920 = distinct !DILexicalBlock(scope: !903, file: !878, line: 774, column: 13)
!921 = !DILocation(line: 772, column: 25, scope: !903)
!922 = !DILocation(line: 773, column: 15, scope: !903)
!923 = !{i32 0, i32 2}
!924 = !DILocation(line: 773, column: 9, scope: !903)
!925 = !DILocation(line: 775, column: 21, scope: !903)
!926 = !DILocation(line: 774, column: 18, scope: !903)
!927 = !DILocation(line: 774, column: 18, scope: !920)
!928 = !DILocation(line: 777, column: 6, scope: !903)
!929 = distinct !DISubprogram(name: "unwrap<f128_internal::f128_t::f128, alloc::ffi::c_str::NulError>", linkageName: "_ZN4core6result19Result$LT$T$C$E$GT$6unwrap17he298ae527c83e6c3E", scope: !169, file: !361, line: 1101, type: !930, scopeLine: 1101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !178, retainedNodes: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{!80, !169, !365}
!932 = !{!933, !934, !936}
!933 = !DILocalVariable(name: "self", arg: 1, scope: !929, file: !361, line: 1101, type: !169)
!934 = !DILocalVariable(name: "t", scope: !935, file: !361, line: 1106, type: !80, align: 1)
!935 = distinct !DILexicalBlock(scope: !929, file: !361, line: 1106, column: 13)
!936 = !DILocalVariable(name: "e", scope: !937, file: !361, line: 1107, type: !32, align: 8)
!937 = distinct !DILexicalBlock(scope: !929, file: !361, line: 1107, column: 13)
!938 = !DILocation(line: 1106, column: 16, scope: !935)
!939 = !DILocation(line: 1101, column: 19, scope: !929)
!940 = !DILocation(line: 1107, column: 17, scope: !937)
!941 = !DILocation(line: 1105, column: 15, scope: !929)
!942 = !DILocation(line: 1105, column: 9, scope: !929)
!943 = !DILocation(line: 1106, column: 16, scope: !929)
!944 = !DILocation(line: 1109, column: 6, scope: !929)
!945 = !DILocation(line: 1107, column: 17, scope: !929)
!946 = !DILocation(line: 1107, column: 84, scope: !937)
!947 = !DILocation(line: 1107, column: 23, scope: !937)
!948 = !DILocation(line: 1107, column: 86, scope: !929)
!949 = !DILocation(line: 1101, column: 5, scope: !929)
!950 = distinct !DISubprogram(name: "assert_failed<f128_internal::f128_t::f128, f128_internal::f128_t::f128>", linkageName: "_ZN4core9panicking13assert_failed17h02c94f2f07807942E", scope: !159, file: !951, line: 171, type: !952, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !972, retainedNodes: !967)
!951 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "89dbfc153a7177bd0202715dd5809289")
!952 = !DISubroutineType(types: !953)
!953 = !{null, !158, !79, !79, !954, !365}
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Arguments>", scope: !509, file: !2, size: 384, align: 64, elements: !955, templateParams: !23, identifier: "91782c25c0cb4075178b67ca76527846")
!955 = !{!956}
!956 = !DICompositeType(tag: DW_TAG_variant_part, scope: !954, file: !2, size: 384, align: 64, elements: !957, templateParams: !23, identifier: "d3d8c93b36d851336035bb39c7913979", discriminator: !966)
!957 = !{!958, !962}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !956, file: !2, baseType: !959, size: 384, align: 64, extraData: i64 0)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !954, file: !2, size: 384, align: 64, elements: !23, templateParams: !960, identifier: "94094742b636673213b46bf0a5389cae")
!960 = !{!961}
!961 = !DITemplateTypeParameter(name: "T", type: !677)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !956, file: !2, baseType: !963, size: 384, align: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !954, file: !2, size: 384, align: 64, elements: !964, templateParams: !960, identifier: "424137f74f76139e10918065dfb817dc")
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !963, file: !2, baseType: !677, size: 384, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, scope: !954, file: !2, baseType: !522, size: 64, align: 64, flags: DIFlagArtificial)
!967 = !{!968, !969, !970, !971}
!968 = !DILocalVariable(name: "kind", arg: 1, scope: !950, file: !951, line: 172, type: !158)
!969 = !DILocalVariable(name: "left", arg: 2, scope: !950, file: !951, line: 173, type: !79)
!970 = !DILocalVariable(name: "right", arg: 3, scope: !950, file: !951, line: 174, type: !79)
!971 = !DILocalVariable(name: "args", arg: 4, scope: !950, file: !951, line: 175, type: !954)
!972 = !{!179, !973}
!973 = !DITemplateTypeParameter(name: "U", type: !80)
!974 = !DILocation(line: 172, column: 5, scope: !950)
!975 = !DILocation(line: 173, column: 5, scope: !950)
!976 = !DILocation(line: 174, column: 5, scope: !950)
!977 = !DILocation(line: 175, column: 5, scope: !950)
!978 = !DILocation(line: 181, column: 31, scope: !950)
!979 = !DILocation(line: 181, column: 38, scope: !950)
!980 = !DILocation(line: 181, column: 46, scope: !950)
!981 = !DILocation(line: 181, column: 5, scope: !950)
!982 = distinct !DISubprogram(name: "assert_failed<f64, f64>", linkageName: "_ZN4core9panicking13assert_failed17h63f80548ac88a44cE", scope: !159, file: !951, line: 171, type: !983, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !990, retainedNodes: !985)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !158, !96, !96, !954, !365}
!985 = !{!986, !987, !988, !989}
!986 = !DILocalVariable(name: "kind", arg: 1, scope: !982, file: !951, line: 172, type: !158)
!987 = !DILocalVariable(name: "left", arg: 2, scope: !982, file: !951, line: 173, type: !96)
!988 = !DILocalVariable(name: "right", arg: 3, scope: !982, file: !951, line: 174, type: !96)
!989 = !DILocalVariable(name: "args", arg: 4, scope: !982, file: !951, line: 175, type: !954)
!990 = !{!582, !991}
!991 = !DITemplateTypeParameter(name: "U", type: !97)
!992 = !DILocation(line: 172, column: 5, scope: !982)
!993 = !DILocation(line: 173, column: 5, scope: !982)
!994 = !DILocation(line: 174, column: 5, scope: !982)
!995 = !DILocation(line: 175, column: 5, scope: !982)
!996 = !DILocation(line: 181, column: 31, scope: !982)
!997 = !DILocation(line: 181, column: 38, scope: !982)
!998 = !DILocation(line: 181, column: 46, scope: !982)
!999 = !DILocation(line: 181, column: 5, scope: !982)
!1000 = distinct !DISubprogram(name: "assert_failed<u32, u32>", linkageName: "_ZN4core9panicking13assert_failed17h654defa585abd77aE", scope: !159, file: !951, line: 171, type: !1001, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !1008, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !158, !106, !106, !954, !365}
!1003 = !{!1004, !1005, !1006, !1007}
!1004 = !DILocalVariable(name: "kind", arg: 1, scope: !1000, file: !951, line: 172, type: !158)
!1005 = !DILocalVariable(name: "left", arg: 2, scope: !1000, file: !951, line: 173, type: !106)
!1006 = !DILocalVariable(name: "right", arg: 3, scope: !1000, file: !951, line: 174, type: !106)
!1007 = !DILocalVariable(name: "args", arg: 4, scope: !1000, file: !951, line: 175, type: !954)
!1008 = !{!568, !1009}
!1009 = !DITemplateTypeParameter(name: "U", type: !107)
!1010 = !DILocation(line: 172, column: 5, scope: !1000)
!1011 = !DILocation(line: 173, column: 5, scope: !1000)
!1012 = !DILocation(line: 174, column: 5, scope: !1000)
!1013 = !DILocation(line: 175, column: 5, scope: !1000)
!1014 = !DILocation(line: 181, column: 31, scope: !1000)
!1015 = !DILocation(line: 181, column: 38, scope: !1000)
!1016 = !DILocation(line: 181, column: 46, scope: !1000)
!1017 = !DILocation(line: 181, column: 5, scope: !1000)
!1018 = distinct !DISubprogram(name: "assert_failed<i32, i32>", linkageName: "_ZN4core9panicking13assert_failed17h686e3560a363aa2dE", scope: !159, file: !951, line: 171, type: !1019, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !1026, retainedNodes: !1021)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !158, !116, !116, !954, !365}
!1021 = !{!1022, !1023, !1024, !1025}
!1022 = !DILocalVariable(name: "kind", arg: 1, scope: !1018, file: !951, line: 172, type: !158)
!1023 = !DILocalVariable(name: "left", arg: 2, scope: !1018, file: !951, line: 173, type: !116)
!1024 = !DILocalVariable(name: "right", arg: 3, scope: !1018, file: !951, line: 174, type: !116)
!1025 = !DILocalVariable(name: "args", arg: 4, scope: !1018, file: !951, line: 175, type: !954)
!1026 = !{!554, !1027}
!1027 = !DITemplateTypeParameter(name: "U", type: !117)
!1028 = !DILocation(line: 172, column: 5, scope: !1018)
!1029 = !DILocation(line: 173, column: 5, scope: !1018)
!1030 = !DILocation(line: 174, column: 5, scope: !1018)
!1031 = !DILocation(line: 175, column: 5, scope: !1018)
!1032 = !DILocation(line: 181, column: 31, scope: !1018)
!1033 = !DILocation(line: 181, column: 38, scope: !1018)
!1034 = !DILocation(line: 181, column: 46, scope: !1018)
!1035 = !DILocation(line: 181, column: 5, scope: !1018)
!1036 = distinct !DISubprogram(name: "assert_failed<f32, f32>", linkageName: "_ZN4core9panicking13assert_failed17hed777d93f1ccbad7E", scope: !159, file: !951, line: 171, type: !1037, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !1044, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !158, !126, !126, !954, !365}
!1039 = !{!1040, !1041, !1042, !1043}
!1040 = !DILocalVariable(name: "kind", arg: 1, scope: !1036, file: !951, line: 172, type: !158)
!1041 = !DILocalVariable(name: "left", arg: 2, scope: !1036, file: !951, line: 173, type: !126)
!1042 = !DILocalVariable(name: "right", arg: 3, scope: !1036, file: !951, line: 174, type: !126)
!1043 = !DILocalVariable(name: "args", arg: 4, scope: !1036, file: !951, line: 175, type: !954)
!1044 = !{!539, !1045}
!1045 = !DITemplateTypeParameter(name: "U", type: !127)
!1046 = !DILocation(line: 172, column: 5, scope: !1036)
!1047 = !DILocation(line: 173, column: 5, scope: !1036)
!1048 = !DILocation(line: 174, column: 5, scope: !1036)
!1049 = !DILocation(line: 175, column: 5, scope: !1036)
!1050 = !DILocation(line: 181, column: 31, scope: !1036)
!1051 = !DILocation(line: 181, column: 38, scope: !1036)
!1052 = !DILocation(line: 181, column: 46, scope: !1036)
!1053 = !DILocation(line: 181, column: 5, scope: !1036)
!1054 = distinct !DISubprogram(name: "assert_test_result<()>", linkageName: "_ZN4test18assert_test_result17h7bd8d08283059f85E", scope: !1056, file: !1055, line: 182, type: !406, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !409, retainedNodes: !1057)
!1055 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/test/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "762a73d08c70c6e433bc6b670465b31f")
!1056 = !DINamespace(name: "test", scope: null)
!1057 = !{!1058, !1059, !1061, !1065, !1066}
!1058 = !DILocalVariable(name: "result", arg: 1, scope: !1054, file: !1055, line: 182, type: !7)
!1059 = !DILocalVariable(name: "code", scope: !1060, file: !1055, line: 183, type: !117, align: 4)
!1060 = distinct !DILexicalBlock(scope: !1054, file: !1055, line: 183, column: 5)
!1061 = !DILocalVariable(name: "left_val", scope: !1062, file: !1055, line: 184, type: !116, align: 8)
!1062 = !DILexicalBlockFile(scope: !1063, file: !1055, discriminator: 0)
!1063 = distinct !DILexicalBlock(scope: !1060, file: !1064, line: 52, column: 13)
!1064 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/macros/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "92818cc67b0fce20f16574f7676a5426")
!1065 = !DILocalVariable(name: "right_val", scope: !1062, file: !1055, line: 184, type: !116, align: 8)
!1066 = !DILocalVariable(name: "kind", scope: !1067, file: !1055, line: 184, type: !158, align: 1)
!1067 = !DILexicalBlockFile(scope: !1068, file: !1055, discriminator: 0)
!1068 = distinct !DILexicalBlock(scope: !1063, file: !1064, line: 54, column: 21)
!1069 = !DILocation(line: 182, column: 43, scope: !1054)
!1070 = !DILocation(line: 183, column: 9, scope: !1060)
!1071 = !DILocalVariable(name: "self", scope: !1072, file: !1055, line: 183, type: !450, align: 1)
!1072 = !DILexicalBlockFile(scope: !1073, file: !1055, discriminator: 0)
!1073 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h2cbc3bcd8846ec77E", scope: !450, file: !449, line: 1808, type: !461, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !146, templateParams: !23, retainedNodes: !1074)
!1074 = !{!1071}
!1075 = !DILocation(line: 183, column: 16, scope: !1072, inlinedAt: !1076)
!1076 = !DILocation(line: 183, column: 16, scope: !1054)
