; ModuleID = '2076py8myczs9uv7'
source_filename = "2076py8myczs9uv7"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::ffi::c_str::CStr" = type { [0 x i8] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_idiomatic_control_flow.rs:5:1: 12:2]" = type {}
%"[closure@src/test_stmt_expr.rs:6:1: 13:2]" = type {}
%"[closure@src/test_translation_only.rs:9:1: 9:25]" = type {}
%"[closure@src/test_duffs.rs:5:1: 14:2]" = type {}
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"[closure@src/test_irreducible.rs:10:1: 16:2]" = type {}
%"[closure@src/test_idiomatic_control_flow.rs:15:1: 23:2]" = type {}
%"[closure@src/test_early_returns.rs:4:1: 11:2]" = type {}
%"[closure@src/test_dfa_multiple_three.rs:7:1: 19:2]" = type {}
%"alloc::ffi::c_str::NulError" = type { i64, %"alloc::vec::Vec<u8>" }
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "1b870bd9431ccc1d71adabe14fa4d734")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !43, file: !2, size: 256, align: 64, elements: !46, templateParams: !23, identifier: "f0b155880f0e8602fd0be3023df941a4")
!43 = !DINamespace(name: "c_str", scope: !44)
!44 = !DINamespace(name: "ffi", scope: !45)
!45 = !DINamespace(name: "alloc", scope: null)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !42, file: !2, baseType: !9, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !42, file: !2, baseType: !49, size: 192, align: 64, offset: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !50, file: !2, size: 192, align: 64, elements: !51, templateParams: !78, identifier: "f48a096c1ed19eb7ba15a7173429013")
!50 = !DINamespace(name: "vec", scope: !45)
!51 = !{!52, !80}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !49, file: !2, baseType: !53, size: 128, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !54, file: !2, size: 128, align: 64, elements: !55, templateParams: !78, identifier: "d09dab1a097018b9dd4dad6f3ce84c27")
!54 = !DINamespace(name: "raw_vec", scope: !45)
!55 = !{!56, !74, !75}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !53, file: !2, baseType: !57, size: 64, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !58, file: !2, size: 64, align: 64, elements: !61, templateParams: !69, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!58 = !DINamespace(name: "unique", scope: !59)
!59 = !DINamespace(name: "ptr", scope: !60)
!60 = !DINamespace(name: "core", scope: null)
!61 = !{!62, !71}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !57, file: !2, baseType: !63, size: 64, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !64, file: !2, size: 64, align: 64, elements: !65, templateParams: !69, identifier: "3160283ea80cecf6149fff38a2e996de")
!64 = !DINamespace(name: "non_null", scope: !59)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !63, file: !2, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "T", type: !68)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !57, file: !2, baseType: !72, align: 8)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !73, file: !2, align: 8, elements: !23, templateParams: !69, identifier: "e338a8151f1037c76eadd10ab3c53972")
!73 = !DINamespace(name: "marker", scope: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !53, file: !2, baseType: !76, align: 8)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !77, file: !2, align: 8, elements: !23, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!77 = !DINamespace(name: "alloc", scope: !45)
!78 = !{!70, !79}
!79 = !DITemplateTypeParameter(name: "A", type: !76)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "<&[i32; 20] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 20] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !84, vtableHolder: !89, templateParams: !23, identifier: "540a39d7b157990d929a550b42f020")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !83, file: !2, baseType: !6, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !83, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 20]", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 640, align: 32, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20, lowerBound: 0)
!93 = !{i32 7, !"PIC Level", i32 2}
!94 = !{i32 7, !"PIE Level", i32 2}
!95 = !{i32 2, !"RtLibUseGOT", i32 1}
!96 = !{i32 2, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !99, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !100, globals: !189)
!99 = !DIFile(filename: "src/lib.rs/@/2076py8myczs9uv7", directory: "/home/calvin/git/c2rust-worktrees/fenix/tests/gotos")
!100 = !{!101, !110, !179, !185}
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !102, file: !2, baseType: !68, size: 8, align: 8, flags: DIFlagEnumClass, elements: !105)
!102 = !DINamespace(name: "v1", scope: !103)
!103 = !DINamespace(name: "rt", scope: !104)
!104 = !DINamespace(name: "fmt", scope: !60)
!105 = !{!106, !107, !108, !109}
!106 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !111, file: !2, baseType: !113, size: 64, align: 64, flags: DIFlagEnumClass, elements: !114)
!111 = !DINamespace(name: "valid_align", scope: !112)
!112 = !DINamespace(name: "mem", scope: !60)
!113 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!115 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !180, file: !2, baseType: !68, size: 8, align: 8, flags: DIFlagEnumClass, elements: !181)
!180 = !DINamespace(name: "panicking", scope: !60)
!181 = !{!182, !183, !184}
!182 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!183 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!184 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !54, file: !2, baseType: !68, size: 8, align: 8, flags: DIFlagEnumClass, elements: !186)
!186 = !{!187, !188}
!187 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!188 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!189 = !{!0, !24, !34, !81}
!190 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..non_null..NonNull$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..unique..Unique$LT$T$GT$$GT$$GT$4from17h99a862f0663cfa5eE", scope: !192, file: !191, line: 770, type: !193, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !69, retainedNodes: !195)
!191 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "856acc92efd7925b83dd1e3c577ddbdc")
!192 = !DINamespace(name: "{impl#16}", scope: !64)
!193 = !DISubroutineType(types: !194)
!194 = !{!63, !57}
!195 = !{!196}
!196 = !DILocalVariable(name: "unique", arg: 1, scope: !190, file: !191, line: 770, type: !57)
!197 = !DILocation(line: 770, column: 13, scope: !190)
!198 = !DILocation(line: 773, column: 41, scope: !190)
!199 = !DILocalVariable(name: "self", scope: !200, file: !191, line: 773, type: !57, align: 8)
!200 = !DILexicalBlockFile(scope: !201, file: !191, discriminator: 0)
!201 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17h12d810a660cb7ca1E", scope: !57, file: !202, line: 103, type: !203, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !69, retainedNodes: !206)
!202 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/unique.rs", directory: "", checksumkind: CSK_MD5, checksum: "acdefab5f14df6e5aef1141fd6b768c9")
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !57}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!206 = !{!199}
!207 = !DILocation(line: 773, column: 41, scope: !200, inlinedAt: !198)
!208 = !DILocalVariable(name: "self", scope: !209, file: !191, line: 773, type: !63, align: 8)
!209 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17habf1c44a67280f85E", scope: !63, file: !191, line: 330, type: !210, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !69, retainedNodes: !212)
!210 = !DISubroutineType(types: !211)
!211 = !{!205, !63}
!212 = !{!208}
!213 = !DILocation(line: 773, column: 41, scope: !209, inlinedAt: !214)
!214 = !DILocation(line: 104, column: 9, scope: !201, inlinedAt: !198)
!215 = !DILocalVariable(name: "ptr", scope: !216, file: !191, line: 773, type: !205, align: 8)
!216 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17hcd71706e2b83caecE", scope: !63, file: !191, line: 196, type: !217, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !69, retainedNodes: !219)
!217 = !DISubroutineType(types: !218)
!218 = !{!63, !205}
!219 = !{!215}
!220 = !DILocation(line: 773, column: 18, scope: !216, inlinedAt: !221)
!221 = !DILocation(line: 773, column: 18, scope: !190)
!222 = !DILocation(line: 774, column: 6, scope: !190)
!223 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h05686681a814bc9cE", scope: !225, file: !224, line: 118, type: !227, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !233, retainedNodes: !229)
!224 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!225 = !DINamespace(name: "backtrace", scope: !226)
!226 = !DINamespace(name: "sys_common", scope: !17)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !20}
!229 = !{!230, !231}
!230 = !DILocalVariable(name: "f", arg: 1, scope: !223, file: !224, line: 118, type: !20)
!231 = !DILocalVariable(name: "result", scope: !232, file: !224, line: 122, type: !7, align: 1)
!232 = distinct !DILexicalBlock(scope: !223, file: !224, line: 122, column: 5)
!233 = !{!234, !235}
!234 = !DITemplateTypeParameter(name: "F", type: !20)
!235 = !DITemplateTypeParameter(name: "T", type: !7)
!236 = !DILocation(line: 122, column: 9, scope: !232)
!237 = !DILocation(line: 118, column: 43, scope: !223)
!238 = !DILocalVariable(name: "dummy", scope: !239, file: !224, line: 125, type: !7, align: 1)
!239 = !DILexicalBlockFile(scope: !240, file: !224, discriminator: 0)
!240 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17ha3df16cdad9f77eeE", scope: !242, file: !241, line: 225, type: !243, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !246, retainedNodes: !245)
!241 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!242 = !DINamespace(name: "hint", scope: !60)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !7}
!245 = !{!238}
!246 = !{!235}
!247 = !DILocation(line: 125, column: 5, scope: !239, inlinedAt: !248)
!248 = !DILocation(line: 125, column: 5, scope: !232)
!249 = !DILocation(line: 122, column: 18, scope: !223)
!250 = !{i32 3355764}
!251 = !DILocation(line: 128, column: 2, scope: !223)
!252 = !DILocation(line: 128, column: 1, scope: !223)
!253 = !DILocation(line: 118, column: 1, scope: !223)
!254 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h517cd2fd5b7a88cbE", scope: !16, file: !255, line: 139, type: !256, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !246, retainedNodes: !260)
!255 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !20, !258, !259}
!258 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!260 = !{!261, !262, !263, !264}
!261 = !DILocalVariable(name: "main", arg: 1, scope: !254, file: !255, line: 140, type: !20)
!262 = !DILocalVariable(name: "argc", arg: 2, scope: !254, file: !255, line: 141, type: !258)
!263 = !DILocalVariable(name: "argv", arg: 3, scope: !254, file: !255, line: 142, type: !259)
!264 = !DILocalVariable(name: "v", scope: !265, file: !255, line: 144, type: !258, align: 8)
!265 = distinct !DILexicalBlock(scope: !254, file: !255, line: 144, column: 5)
!266 = !DILocation(line: 140, column: 5, scope: !254)
!267 = !DILocation(line: 141, column: 5, scope: !254)
!268 = !DILocation(line: 142, column: 5, scope: !254)
!269 = !DILocation(line: 145, column: 10, scope: !254)
!270 = !DILocation(line: 145, column: 9, scope: !254)
!271 = !DILocation(line: 144, column: 17, scope: !254)
!272 = !DILocation(line: 144, column: 12, scope: !254)
!273 = !DILocation(line: 144, column: 12, scope: !265)
!274 = !DILocation(line: 150, column: 2, scope: !254)
!275 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17haa57050192edbacaE", scope: !15, file: !255, line: 145, type: !276, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !246, retainedNodes: !279)
!276 = !DISubroutineType(types: !277)
!277 = !{!33, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!279 = !{!280}
!280 = !DILocalVariable(name: "main", scope: !275, file: !255, line: 140, type: !20, align: 8)
!281 = !{i64 8}
!282 = !DILocation(line: 140, column: 5, scope: !275)
!283 = !DILocalVariable(name: "self", scope: !284, file: !255, line: 145, type: !287, align: 1)
!284 = !DILexicalBlockFile(scope: !285, file: !255, discriminator: 0)
!285 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h4b15196462094651E", scope: !287, file: !286, line: 1808, type: !298, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !300)
!286 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !288, file: !2, size: 8, align: 8, elements: !289, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!288 = !DINamespace(name: "process", scope: !17)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !287, file: !2, baseType: !291, size: 8, align: 8)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !292, file: !2, size: 8, align: 8, elements: !296, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!292 = !DINamespace(name: "process_common", scope: !293)
!293 = !DINamespace(name: "process", scope: !294)
!294 = !DINamespace(name: "unix", scope: !295)
!295 = !DINamespace(name: "sys", scope: !17)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !291, file: !2, baseType: !68, size: 8, align: 8)
!298 = !DISubroutineType(types: !299)
!299 = !{!33, !287}
!300 = !{!283}
!301 = !DILocation(line: 145, column: 18, scope: !284, inlinedAt: !302)
!302 = !DILocation(line: 145, column: 18, scope: !275)
!303 = !DILocation(line: 145, column: 77, scope: !275)
!304 = !DILocalVariable(name: "self", scope: !305, file: !255, line: 145, type: !310, align: 8)
!305 = !DILexicalBlockFile(scope: !306, file: !255, discriminator: 0)
!306 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h5df1746ef06b830dE", scope: !291, file: !307, line: 485, type: !308, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !311)
!307 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!308 = !DISubroutineType(types: !309)
!309 = !{!33, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !{!304}
!312 = !DILocation(line: 145, column: 18, scope: !305, inlinedAt: !313)
!313 = !DILocation(line: 1809, column: 9, scope: !285, inlinedAt: !302)
!314 = !DILocation(line: 145, column: 17, scope: !275)
!315 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3fa795487c2c62feE", scope: !317, file: !316, line: 2361, type: !318, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !378)
!316 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!317 = !DINamespace(name: "{impl#59}", scope: !104)
!318 = !DISubroutineType(types: !319)
!319 = !{!320, !337, !343}
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !321, file: !2, size: 8, align: 8, elements: !322, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!321 = !DINamespace(name: "result", scope: !60)
!322 = !{!323}
!323 = !DICompositeType(tag: DW_TAG_variant_part, scope: !320, file: !2, size: 8, align: 8, elements: !324, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !336)
!324 = !{!325, !332}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !323, file: !2, baseType: !326, size: 8, align: 8, extraData: i64 0)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !320, file: !2, size: 8, align: 8, elements: !327, templateParams: !329, identifier: "cea751326735c343faf647063a65ad14")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !2, baseType: !7, align: 8, offset: 8)
!329 = !{!235, !330}
!330 = !DITemplateTypeParameter(name: "E", type: !331)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !104, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !323, file: !2, baseType: !333, size: 8, align: 8, extraData: i64 1)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !320, file: !2, size: 8, align: 8, elements: !334, templateParams: !329, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !2, baseType: !331, align: 8, offset: 8)
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !320, file: !2, baseType: !68, size: 8, align: 8, flags: DIFlagArtificial)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !338, size: 64, align: 64, dwarfAddressSpace: 0)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !339, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !338, file: !2, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !338, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !344, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !104, file: !2, size: 512, align: 64, elements: !345, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!345 = !{!346, !348, !350, !351, !366, !367}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !2, baseType: !347, size: 32, align: 32, offset: 384)
!347 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !344, file: !2, baseType: !349, size: 32, align: 32, offset: 416)
!349 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !344, file: !2, baseType: !101, size: 8, align: 8, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !344, file: !2, baseType: !352, size: 128, align: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !353, file: !2, size: 128, align: 64, elements: !354, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!353 = !DINamespace(name: "option", scope: !60)
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_variant_part, scope: !352, file: !2, size: 128, align: 64, elements: !356, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !365)
!356 = !{!357, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !355, file: !2, baseType: !358, size: 128, align: 64, extraData: i64 0)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !352, file: !2, size: 128, align: 64, elements: !23, templateParams: !359, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "T", type: !9)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !355, file: !2, baseType: !362, size: 128, align: 64, extraData: i64 1)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !352, file: !2, size: 128, align: 64, elements: !363, templateParams: !359, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !362, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !2, baseType: !113, size: 64, align: 64, flags: DIFlagArtificial)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !344, file: !2, baseType: !352, size: 128, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !344, file: !2, baseType: !368, size: 128, align: 64, offset: 256)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !369, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!369 = !{!370, !373}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !368, file: !2, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64, dwarfAddressSpace: 0)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !368, file: !2, baseType: !374, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !375, size: 64, align: 64, dwarfAddressSpace: 0)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 3, lowerBound: 0)
!378 = !{!379, !380}
!379 = !DILocalVariable(name: "self", arg: 1, scope: !315, file: !316, line: 2361, type: !337)
!380 = !DILocalVariable(name: "f", arg: 2, scope: !315, file: !316, line: 2361, type: !343)
!381 = !{!382}
!382 = !DITemplateTypeParameter(name: "T", type: !33)
!383 = !DILocation(line: 2361, column: 20, scope: !315)
!384 = !DILocation(line: 2361, column: 27, scope: !315)
!385 = !DILocation(line: 2361, column: 71, scope: !315)
!386 = !{i64 4}
!387 = !DILocation(line: 2361, column: 62, scope: !315)
!388 = !DILocation(line: 2361, column: 84, scope: !315)
!389 = distinct !DISubprogram(name: "fmt<[i32; 20]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h90b6e323157f0ed7E", scope: !317, file: !316, line: 2361, type: !390, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !396, retainedNodes: !393)
!390 = !DISubroutineType(types: !391)
!391 = !{!320, !392, !343}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 20]", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!393 = !{!394, !395}
!394 = !DILocalVariable(name: "self", arg: 1, scope: !389, file: !316, line: 2361, type: !392)
!395 = !DILocalVariable(name: "f", arg: 2, scope: !389, file: !316, line: 2361, type: !343)
!396 = !{!397}
!397 = !DITemplateTypeParameter(name: "T", type: !90)
!398 = !DILocation(line: 2361, column: 20, scope: !389)
!399 = !DILocation(line: 2361, column: 27, scope: !389)
!400 = !DILocation(line: 2361, column: 71, scope: !389)
!401 = !DILocation(line: 2361, column: 62, scope: !389)
!402 = !DILocation(line: 2361, column: 84, scope: !389)
!403 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h98cdf893fb0a1ac0E", scope: !317, file: !316, line: 2361, type: !404, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !407)
!404 = !DISubroutineType(types: !405)
!405 = !{!320, !406, !343}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!407 = !{!408, !409}
!408 = !DILocalVariable(name: "self", arg: 1, scope: !403, file: !316, line: 2361, type: !406)
!409 = !DILocalVariable(name: "f", arg: 2, scope: !403, file: !316, line: 2361, type: !343)
!410 = !DILocation(line: 2361, column: 20, scope: !403)
!411 = !DILocation(line: 2361, column: 27, scope: !403)
!412 = !DILocation(line: 2361, column: 71, scope: !403)
!413 = !DILocation(line: 2361, column: 62, scope: !403)
!414 = !DILocation(line: 2361, column: 84, scope: !403)
!415 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN47_$LT$i32$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17hd75b91ee41922c11E", scope: !417, file: !416, line: 189, type: !420, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !422)
!416 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "a5e6372fb466d62a237d46ecffb4676a")
!417 = !DINamespace(name: "{impl#34}", scope: !418)
!418 = !DINamespace(name: "range", scope: !419)
!419 = !DINamespace(name: "iter", scope: !60)
!420 = !DISubroutineType(types: !421)
!421 = !{!33, !33, !9}
!422 = !{!423, !424}
!423 = !DILocalVariable(name: "start", arg: 1, scope: !415, file: !416, line: 189, type: !33)
!424 = !DILocalVariable(name: "n", arg: 2, scope: !415, file: !416, line: 189, type: !9)
!425 = !DILocation(line: 189, column: 37, scope: !415)
!426 = !DILocation(line: 189, column: 50, scope: !415)
!427 = !DILocation(line: 191, column: 22, scope: !415)
!428 = !DILocalVariable(name: "self", scope: !429, file: !416, line: 191, type: !33, align: 4)
!429 = !DILexicalBlockFile(scope: !430, file: !416, discriminator: 0)
!430 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$i32$GT$13unchecked_add17h38773511627d7785E", scope: !432, file: !431, line: 453, type: !434, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !436)
!431 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/int_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "1d4cee595ea848b5e7eb7a8ae38f492d")
!432 = !DINamespace(name: "{impl#2}", scope: !433)
!433 = !DINamespace(name: "num", scope: !60)
!434 = !DISubroutineType(types: !435)
!435 = !{!33, !33, !33}
!436 = !{!428, !437}
!437 = !DILocalVariable(name: "rhs", scope: !429, file: !416, line: 191, type: !33, align: 4)
!438 = !DILocation(line: 191, column: 22, scope: !429, inlinedAt: !427)
!439 = !DILocation(line: 191, column: 42, scope: !415)
!440 = !DILocation(line: 192, column: 10, scope: !415)
!441 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17h4b34214140ad762dE", scope: !442, file: !316, line: 2586, type: !443, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !445)
!442 = !DINamespace(name: "{impl#26}", scope: !104)
!443 = !DISubroutineType(types: !444)
!444 = !{!320, !338, !343}
!445 = !{!446, !447}
!446 = !DILocalVariable(name: "self", arg: 1, scope: !441, file: !316, line: 2586, type: !338)
!447 = !DILocalVariable(name: "f", arg: 2, scope: !441, file: !316, line: 2586, type: !343)
!448 = !DILocation(line: 2586, column: 12, scope: !441)
!449 = !DILocation(line: 2586, column: 19, scope: !441)
!450 = !DILocation(line: 2587, column: 9, scope: !441)
!451 = !DILocation(line: 2587, column: 32, scope: !441)
!452 = !DILocalVariable(name: "self", scope: !453, file: !316, line: 2587, type: !338, align: 8)
!453 = !DILexicalBlockFile(scope: !454, file: !316, discriminator: 0)
!454 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17hc5f3b74a500d5bcbE", scope: !456, file: !455, line: 734, type: !458, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !473)
!455 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!456 = !DINamespace(name: "{impl#0}", scope: !457)
!457 = !DINamespace(name: "slice", scope: !60)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !338}
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !461, file: !2, size: 128, align: 64, elements: !462, templateParams: !381, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!461 = !DINamespace(name: "iter", scope: !457)
!462 = !{!463, !468, !469}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !460, file: !2, baseType: !464, size: 64, align: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !64, file: !2, size: 64, align: 64, elements: !465, templateParams: !381, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !464, file: !2, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !460, file: !2, baseType: !467, size: 64, align: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !460, file: !2, baseType: !470, align: 8)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !73, file: !2, align: 8, elements: !23, templateParams: !471, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!471 = !{!472}
!472 = !DITemplateTypeParameter(name: "T", type: !32)
!473 = !{!452}
!474 = !DILocation(line: 2587, column: 32, scope: !453, inlinedAt: !451)
!475 = !DILocation(line: 2588, column: 6, scope: !441)
!476 = distinct !DISubprogram(name: "const_eval_select<(&[u8]), fn(&[u8]) -> &core::ffi::c_str::CStr, fn(&[u8]) -> &core::ffi::c_str::CStr, &core::ffi::c_str::CStr>", linkageName: "_ZN4core10intrinsics17const_eval_select17h2a517e5f9ea04659E", scope: !478, file: !477, line: 2687, type: !479, scopeLine: 2687, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !507, retainedNodes: !503)
!477 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "f96ba730d7cf23ae45fdc72e7caf5f1b")
!478 = !DINamespace(name: "intrinsics", scope: !60)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !492, !500, !500}
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "&core::ffi::c_str::CStr", file: !2, size: 128, align: 64, elements: !482, templateParams: !23, identifier: "9a691f075a9e4b9c7e7049abca5ed1fb")
!482 = !{!483, !491}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !481, file: !2, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !486, file: !2, align: 8, elements: !488, templateParams: !23, identifier: "2da013c6b133655882cf6258a2093276")
!486 = !DINamespace(name: "c_str", scope: !487)
!487 = !DINamespace(name: "ffi", scope: !60)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !485, file: !2, baseType: !490, align: 8)
!490 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !481, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&[u8])", file: !2, size: 128, align: 64, elements: !493, templateParams: !23, identifier: "65821ee449d7484056bb2ad385d752b8")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !492, file: !2, baseType: !495, size: 128, align: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !496, templateParams: !23, identifier: "7d49e60d2ca720f66806f7375f860e2")
!496 = !{!497, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !495, file: !2, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !495, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&[u8]) -> &core::ffi::c_str::CStr", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!481, !495}
!503 = !{!504, !505, !506}
!504 = !DILocalVariable(name: "arg", arg: 1, scope: !476, file: !477, line: 2688, type: !492)
!505 = !DILocalVariable(name: "_called_in_const", arg: 2, scope: !476, file: !477, line: 2689, type: !500)
!506 = !DILocalVariable(name: "called_at_rt", arg: 3, scope: !476, file: !477, line: 2690, type: !500)
!507 = !{!508, !509, !510, !511}
!508 = !DITemplateTypeParameter(name: "ARG", type: !492)
!509 = !DITemplateTypeParameter(name: "F", type: !500)
!510 = !DITemplateTypeParameter(name: "G", type: !500)
!511 = !DITemplateTypeParameter(name: "RET", type: !481)
!512 = !DILocation(line: 2688, column: 5, scope: !476)
!513 = !DILocation(line: 2689, column: 5, scope: !476)
!514 = !DILocation(line: 2690, column: 5, scope: !476)
!515 = !DILocation(line: 2696, column: 5, scope: !476)
!516 = !DILocation(line: 2697, column: 1, scope: !476)
!517 = !DILocation(line: 2687, column: 1, scope: !476)
!518 = !DILocation(line: 2697, column: 2, scope: !476)
!519 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$i32$GT$2lt17h852f340fde9746ecE", scope: !521, file: !520, line: 1423, type: !524, scopeLine: 1423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !527)
!520 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!521 = !DINamespace(name: "{impl#72}", scope: !522)
!522 = !DINamespace(name: "impls", scope: !523)
!523 = !DINamespace(name: "cmp", scope: !60)
!524 = !DISubroutineType(types: !525)
!525 = !{!526, !32, !32}
!526 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!527 = !{!528, !529}
!528 = !DILocalVariable(name: "self", arg: 1, scope: !519, file: !520, line: 1423, type: !32)
!529 = !DILocalVariable(name: "other", arg: 2, scope: !519, file: !520, line: 1423, type: !32)
!530 = !DILocation(line: 1423, column: 23, scope: !519)
!531 = !DILocation(line: 1423, column: 30, scope: !519)
!532 = !DILocation(line: 1423, column: 52, scope: !519)
!533 = !DILocation(line: 1423, column: 62, scope: !519)
!534 = !DILocation(line: 1423, column: 72, scope: !519)
!535 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3ffi5c_str4CStr6as_ptr17ha22ab35a2209d021E", scope: !485, file: !536, line: 475, type: !537, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !540)
!536 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ffi/c_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "a50c941e663797b3cd132afeffc32d87")
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !481}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !490, size: 64, align: 64, dwarfAddressSpace: 0)
!540 = !{!541}
!541 = !DILocalVariable(name: "self", arg: 1, scope: !535, file: !536, line: 475, type: !481)
!542 = !DILocation(line: 475, column: 25, scope: !535)
!543 = !DILocation(line: 476, column: 9, scope: !535)
!544 = !DILocalVariable(name: "self", scope: !545, file: !536, line: 476, type: !549, align: 8)
!545 = !DILexicalBlockFile(scope: !546, file: !536, discriminator: 0)
!546 = distinct !DISubprogram(name: "as_ptr<i8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17hd2e4f762e1e5f5beE", scope: !456, file: !455, line: 476, type: !547, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !555, retainedNodes: !554)
!547 = !DISubroutineType(types: !548)
!548 = !{!539, !549}
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i8]", file: !2, size: 128, align: 64, elements: !550, templateParams: !23, identifier: "cc2ad320ed202ac3c13bb57e7e44d101")
!550 = !{!551, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !549, file: !2, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64, dwarfAddressSpace: 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !549, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!554 = !{!544}
!555 = !{!556}
!556 = !DITemplateTypeParameter(name: "T", type: !490)
!557 = !DILocation(line: 476, column: 9, scope: !545, inlinedAt: !543)
!558 = !DILocation(line: 477, column: 6, scope: !535)
!559 = distinct !DISubprogram(name: "new_binary<i32>", linkageName: "_ZN4core3fmt10ArgumentV110new_binary17h3700116a20409306E", scope: !560, file: !316, line: 318, type: !570, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !572)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !104, file: !2, size: 128, align: 64, elements: !561, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!561 = !{!562, !566}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !560, file: !2, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !564, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !565, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!565 = !DINamespace(name: "{extern#0}", scope: !104)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !560, file: !2, baseType: !567, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{!320, !563, !343}
!570 = !DISubroutineType(types: !571)
!571 = !{!560, !32}
!572 = !{!573}
!573 = !DILocalVariable(name: "x", arg: 1, scope: !559, file: !316, line: 318, type: !32)
!574 = !DILocation(line: 318, column: 30, scope: !559)
!575 = !DILocation(line: 319, column: 23, scope: !559)
!576 = !DILocalVariable(name: "x", scope: !577, file: !316, line: 319, type: !32, align: 8)
!577 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core3fmt10ArgumentV13new17h59e582b7f4d5fa37E", scope: !560, file: !316, line: 329, type: !578, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !583)
!578 = !DISubroutineType(types: !579)
!579 = !{!560, !32, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&i32, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !581, size: 64, align: 64, dwarfAddressSpace: 0)
!581 = !DISubroutineType(types: !582)
!582 = !{!320, !32, !343}
!583 = !{!576, !584}
!584 = !DILocalVariable(name: "f", scope: !577, file: !316, line: 319, type: !580, align: 8)
!585 = !DILocation(line: 319, column: 13, scope: !577, inlinedAt: !586)
!586 = !DILocation(line: 319, column: 13, scope: !559)
!587 = !DILocation(line: 319, column: 26, scope: !559)
!588 = !{i64 1}
!589 = !DILocation(line: 320, column: 10, scope: !559)
!590 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h46417d135733516aE", scope: !592, file: !591, line: 185, type: !581, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !594)
!591 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!592 = !DINamespace(name: "{impl#80}", scope: !593)
!593 = !DINamespace(name: "num", scope: !104)
!594 = !{!595, !596}
!595 = !DILocalVariable(name: "self", arg: 1, scope: !590, file: !591, line: 185, type: !32)
!596 = !DILocalVariable(name: "f", arg: 2, scope: !590, file: !591, line: 185, type: !343)
!597 = !DILocation(line: 185, column: 20, scope: !590)
!598 = !DILocation(line: 185, column: 27, scope: !590)
!599 = !DILocation(line: 186, column: 20, scope: !590)
!600 = !DILocation(line: 188, column: 27, scope: !590)
!601 = !DILocation(line: 187, column: 21, scope: !590)
!602 = !DILocation(line: 186, column: 17, scope: !590)
!603 = !DILocation(line: 193, column: 14, scope: !590)
!604 = !{i8 0, i8 2}
!605 = !DILocation(line: 191, column: 21, scope: !590)
!606 = !DILocation(line: 189, column: 21, scope: !590)
!607 = !DILocation(line: 188, column: 24, scope: !590)
!608 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h6674e0fb8810f64cE", scope: !610, file: !609, line: 637, type: !619, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !629, retainedNodes: !622)
!609 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !611, file: !2, size: 128, align: 64, elements: !612, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!611 = !DINamespace(name: "builders", scope: !104)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !610, file: !2, baseType: !614, size: 128, align: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !611, file: !2, size: 128, align: 64, elements: !615, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !614, file: !2, baseType: !343, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !614, file: !2, baseType: !320, size: 8, align: 8, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !614, file: !2, baseType: !526, size: 8, align: 8, offset: 72)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !621, !460}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !610, size: 64, align: 64, dwarfAddressSpace: 0)
!622 = !{!623, !624, !625, !627}
!623 = !DILocalVariable(name: "self", arg: 1, scope: !608, file: !609, line: 637, type: !621)
!624 = !DILocalVariable(name: "entries", arg: 2, scope: !608, file: !609, line: 637, type: !460)
!625 = !DILocalVariable(name: "iter", scope: !626, file: !609, line: 642, type: !460, align: 8)
!626 = distinct !DILexicalBlock(scope: !608, file: !609, line: 642, column: 9)
!627 = !DILocalVariable(name: "entry", scope: !628, file: !609, line: 642, type: !32, align: 8)
!628 = distinct !DILexicalBlock(scope: !626, file: !609, line: 642, column: 30)
!629 = !{!630, !631}
!630 = !DITemplateTypeParameter(name: "D", type: !32)
!631 = !DITemplateTypeParameter(name: "I", type: !460)
!632 = !DILocation(line: 637, column: 26, scope: !608)
!633 = !DILocation(line: 637, column: 37, scope: !608)
!634 = !DILocation(line: 642, column: 22, scope: !626)
!635 = !DILocation(line: 642, column: 13, scope: !628)
!636 = !DILocation(line: 642, column: 22, scope: !608)
!637 = !DILocation(line: 642, column: 9, scope: !626)
!638 = !DILocation(line: 642, column: 9, scope: !608)
!639 = !DILocation(line: 642, column: 13, scope: !626)
!640 = !DILocation(line: 643, column: 24, scope: !628)
!641 = !DILocation(line: 643, column: 13, scope: !628)
!642 = !DILocation(line: 644, column: 9, scope: !626)
!643 = !DILocation(line: 637, column: 5, scope: !608)
!644 = !DILocation(line: 646, column: 6, scope: !608)
!645 = distinct !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17h4df0e41cfcab46adE", scope: !646, file: !316, line: 512, type: !709, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !725)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !104, file: !2, size: 384, align: 64, elements: !647, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!647 = !{!648, !658, !703}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !646, file: !2, baseType: !649, size: 128, align: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !650, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!650 = !{!651, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !649, file: !2, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64, dwarfAddressSpace: 0)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !654, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !653, file: !2, baseType: !498, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !653, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !649, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !646, file: !2, baseType: !659, size: 128, align: 64, offset: 128)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !353, file: !2, size: 128, align: 64, elements: !660, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!660 = !{!661}
!661 = !DICompositeType(tag: DW_TAG_variant_part, scope: !659, file: !2, size: 128, align: 64, elements: !662, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !702)
!662 = !{!663, !698}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !661, file: !2, baseType: !664, size: 128, align: 64, extraData: i64 0)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !659, file: !2, size: 128, align: 64, elements: !23, templateParams: !665, identifier: "742dbe7e160661d8ca36fcfff2574850")
!665 = !{!666}
!666 = !DITemplateTypeParameter(name: "T", type: !667)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !668, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!668 = !{!669, !697}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !667, file: !2, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64, dwarfAddressSpace: 0)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !102, file: !2, size: 448, align: 64, elements: !672, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !671, file: !2, baseType: !9, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !671, file: !2, baseType: !675, size: 384, align: 64, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !102, file: !2, size: 384, align: 64, elements: !676, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!676 = !{!677, !678, !679, !680, !696}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !675, file: !2, baseType: !349, size: 32, align: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !675, file: !2, baseType: !101, size: 8, align: 8, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !2, baseType: !347, size: 32, align: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !675, file: !2, baseType: !681, size: 128, align: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !102, file: !2, size: 128, align: 64, elements: !682, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!682 = !{!683}
!683 = !DICompositeType(tag: DW_TAG_variant_part, scope: !681, file: !2, size: 128, align: 64, elements: !684, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !695)
!684 = !{!685, !689, !693}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !683, file: !2, baseType: !686, size: 128, align: 64, extraData: i64 0)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !681, file: !2, size: 128, align: 64, elements: !687, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !686, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !683, file: !2, baseType: !690, size: 128, align: 64, extraData: i64 1)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !681, file: !2, size: 128, align: 64, elements: !691, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !690, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !683, file: !2, baseType: !694, size: 128, align: 64, extraData: i64 2)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !681, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!695 = !DIDerivedType(tag: DW_TAG_member, scope: !681, file: !2, baseType: !113, size: 64, align: 64, flags: DIFlagArtificial)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !675, file: !2, baseType: !681, size: 128, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !667, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !661, file: !2, baseType: !699, size: 128, align: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !659, file: !2, size: 128, align: 64, elements: !700, templateParams: !665, identifier: "17f2fc106094349c7673abca4839c97a")
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !699, file: !2, baseType: !667, size: 128, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, scope: !659, file: !2, baseType: !113, size: 64, align: 64, flags: DIFlagArtificial)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !646, file: !2, baseType: !704, size: 128, align: 64, offset: 256)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !705, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!705 = !{!706, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !704, file: !2, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64, dwarfAddressSpace: 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !704, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !724}
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !353, file: !2, size: 128, align: 64, elements: !712, templateParams: !23, identifier: "f0dceda904e27e7388d0262de24b6976")
!712 = !{!713}
!713 = !DICompositeType(tag: DW_TAG_variant_part, scope: !711, file: !2, size: 128, align: 64, elements: !714, templateParams: !23, identifier: "d9a20f3bc7236076b658193a0ee41dce", discriminator: !723)
!714 = !{!715, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !713, file: !2, baseType: !716, size: 128, align: 64, extraData: i64 0)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !711, file: !2, size: 128, align: 64, elements: !23, templateParams: !717, identifier: "8b8f8f73f03135e6d73de6ca26c771a5")
!717 = !{!718}
!718 = !DITemplateTypeParameter(name: "T", type: !653)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !713, file: !2, baseType: !720, size: 128, align: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !711, file: !2, size: 128, align: 64, elements: !721, templateParams: !717, identifier: "5f24cd570c5cc19be11f0051a0b188da")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !720, file: !2, baseType: !653, size: 128, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, scope: !711, file: !2, baseType: !113, size: 64, align: 64, flags: DIFlagArtificial)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !646, size: 64, align: 64, dwarfAddressSpace: 0)
!725 = !{!726, !727}
!726 = !DILocalVariable(name: "self", arg: 1, scope: !645, file: !316, line: 512, type: !724)
!727 = !DILocalVariable(name: "s", scope: !728, file: !316, line: 515, type: !729, align: 8)
!728 = distinct !DILexicalBlock(scope: !645, file: !316, line: 515, column: 13)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !653, size: 64, align: 64, dwarfAddressSpace: 0)
!730 = !DILocation(line: 512, column: 25, scope: !645)
!731 = !DILocation(line: 513, column: 16, scope: !645)
!732 = !DILocation(line: 513, column: 29, scope: !645)
!733 = !DILocation(line: 513, column: 15, scope: !645)
!734 = !DILocation(line: 514, column: 14, scope: !645)
!735 = !DILocation(line: 515, column: 14, scope: !645)
!736 = !DILocation(line: 514, column: 18, scope: !645)
!737 = !DILocation(line: 516, column: 18, scope: !645)
!738 = !DILocation(line: 514, column: 25, scope: !645)
!739 = !DILocation(line: 514, column: 32, scope: !645)
!740 = !DILocation(line: 518, column: 6, scope: !645)
!741 = !DILocation(line: 515, column: 19, scope: !645)
!742 = !DILocation(line: 515, column: 15, scope: !645)
!743 = !DILocation(line: 515, column: 15, scope: !728)
!744 = !DILocation(line: 515, column: 31, scope: !728)
!745 = !DILocation(line: 515, column: 26, scope: !728)
!746 = !DILocation(line: 515, column: 32, scope: !645)
!747 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h776d0f2ab8f6795cE", scope: !646, file: !316, line: 390, type: !748, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !750)
!748 = !DISubroutineType(types: !749)
!749 = !{!646, !649, !704}
!750 = !{!751, !752}
!751 = !DILocalVariable(name: "pieces", arg: 1, scope: !747, file: !316, line: 390, type: !649)
!752 = !DILocalVariable(name: "args", arg: 2, scope: !747, file: !316, line: 390, type: !704)
!753 = !DILocation(line: 390, column: 25, scope: !747)
!754 = !DILocation(line: 390, column: 53, scope: !747)
!755 = !DILocation(line: 391, column: 12, scope: !747)
!756 = !DILocation(line: 391, column: 56, scope: !747)
!757 = !DILocation(line: 391, column: 41, scope: !747)
!758 = !DILocation(line: 394, column: 34, scope: !747)
!759 = !DILocation(line: 394, column: 9, scope: !747)
!760 = !DILocation(line: 395, column: 6, scope: !747)
!761 = !DILocation(line: 392, column: 13, scope: !747)
!762 = distinct !DISubprogram(name: "replace<i32>", linkageName: "_ZN4core3mem7replace17hedc68df68cbf507aE", scope: !112, file: !763, line: 913, type: !764, scopeLine: 913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !767)
!763 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "27c8869548c9dcb65186c5584c2586f6")
!764 = !DISubroutineType(types: !765)
!765 = !{!33, !766, !33}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!767 = !{!768, !769, !770}
!768 = !DILocalVariable(name: "dest", arg: 1, scope: !762, file: !763, line: 913, type: !766)
!769 = !DILocalVariable(name: "src", arg: 2, scope: !762, file: !763, line: 913, type: !33)
!770 = !DILocalVariable(name: "result", scope: !771, file: !763, line: 918, type: !33, align: 4)
!771 = distinct !DILexicalBlock(scope: !762, file: !763, line: 918, column: 9)
!772 = !DILocation(line: 913, column: 25, scope: !762)
!773 = !DILocation(line: 913, column: 39, scope: !762)
!774 = !DILocalVariable(name: "src", scope: !775, file: !763, line: 919, type: !33, align: 4)
!775 = !DILexicalBlockFile(scope: !776, file: !763, discriminator: 0)
!776 = distinct !DISubprogram(name: "write<i32>", linkageName: "_ZN4core3ptr5write17h282ab4e4310d10ccE", scope: !59, file: !777, line: 1296, type: !778, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !781)
!777 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!778 = !DISubroutineType(types: !779)
!779 = !{null, !780, !33}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!781 = !{!782, !774}
!782 = !DILocalVariable(name: "dst", scope: !775, file: !763, line: 919, type: !780, align: 8)
!783 = !DILocation(line: 919, column: 9, scope: !775, inlinedAt: !784)
!784 = !DILocation(line: 919, column: 9, scope: !771)
!785 = !DILocalVariable(name: "tmp", scope: !786, file: !763, line: 918, type: !794, align: 4)
!786 = !DILexicalBlockFile(scope: !787, file: !763, discriminator: 0)
!787 = distinct !DILexicalBlock(scope: !788, file: !777, line: 1107, column: 5)
!788 = distinct !DISubprogram(name: "read<i32>", linkageName: "_ZN4core3ptr4read17hc56df601fb225c22E", scope: !59, file: !777, line: 1099, type: !789, scopeLine: 1099, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!33, !467}
!791 = !{!792, !785}
!792 = !DILocalVariable(name: "src", scope: !793, file: !763, line: 918, type: !467, align: 8)
!793 = !DILexicalBlockFile(scope: !788, file: !763, discriminator: 0)
!794 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<i32>", scope: !795, file: !2, size: 32, align: 32, elements: !796, templateParams: !381, identifier: "749ff49970c59f5b542753e50e0baaa5")
!795 = !DINamespace(name: "maybe_uninit", scope: !112)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !794, file: !2, baseType: !7, align: 8)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !794, file: !2, baseType: !799, size: 32, align: 32)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<i32>", scope: !800, file: !2, size: 32, align: 32, elements: !801, templateParams: !381, identifier: "1f7a761321d649b733dfe180fca72385")
!800 = !DINamespace(name: "manually_drop", scope: !112)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !799, file: !2, baseType: !33, size: 32, align: 32)
!803 = !DILocation(line: 918, column: 22, scope: !786, inlinedAt: !804)
!804 = !DILocation(line: 918, column: 22, scope: !762)
!805 = !DILocation(line: 918, column: 32, scope: !762)
!806 = !DILocation(line: 918, column: 22, scope: !793, inlinedAt: !804)
!807 = !DILocation(line: 918, column: 22, scope: !808, inlinedAt: !813)
!808 = !DILexicalBlockFile(scope: !809, file: !763, discriminator: 0)
!809 = distinct !DISubprogram(name: "uninit<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17ha34de6679e7ed956E", scope: !794, file: !810, line: 320, type: !811, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !23)
!810 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "d75c93d9a93fe65ef19edc0e8e272278")
!811 = !DISubroutineType(types: !812)
!812 = !{!794}
!813 = !DILocation(line: 1107, column: 19, scope: !788, inlinedAt: !804)
!814 = !DILocalVariable(name: "self", scope: !815, file: !763, line: 918, type: !819, align: 8)
!815 = !DILexicalBlockFile(scope: !816, file: !763, discriminator: 0)
!816 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17he58d897c6fec9705E", scope: !794, file: !810, line: 574, type: !817, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !820)
!817 = !DISubroutineType(types: !818)
!818 = !{!780, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<i32>", baseType: !794, size: 64, align: 64, dwarfAddressSpace: 0)
!820 = !{!814}
!821 = !DILocation(line: 918, column: 22, scope: !815, inlinedAt: !822)
!822 = !DILocation(line: 1115, column: 34, scope: !787, inlinedAt: !804)
!823 = !DILocalVariable(name: "self", scope: !824, file: !763, line: 918, type: !794, align: 4)
!824 = !DILexicalBlockFile(scope: !825, file: !763, discriminator: 0)
!825 = distinct !DISubprogram(name: "assume_init<i32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$11assume_init17h1ec22fba4d5f54d7E", scope: !794, file: !810, line: 629, type: !826, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !836)
!826 = !DISubroutineType(types: !827)
!827 = !{!33, !794, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !829, size: 64, align: 64, dwarfAddressSpace: 0)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !830, file: !2, size: 192, align: 64, elements: !832, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!830 = !DINamespace(name: "location", scope: !831)
!831 = !DINamespace(name: "panic", scope: !60)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !829, file: !2, baseType: !653, size: 128, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !829, file: !2, baseType: !347, size: 32, align: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !829, file: !2, baseType: !347, size: 32, align: 32, offset: 160)
!836 = !{!823}
!837 = !DILocation(line: 918, column: 22, scope: !824, inlinedAt: !838)
!838 = !DILocation(line: 1116, column: 9, scope: !787, inlinedAt: !804)
!839 = !DILocalVariable(name: "slot", scope: !840, file: !763, line: 918, type: !799, align: 4)
!840 = !DILexicalBlockFile(scope: !841, file: !763, discriminator: 0)
!841 = distinct !DISubprogram(name: "into_inner<i32>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$10into_inner17h2e9a908020af6d9eE", scope: !799, file: !842, line: 88, type: !843, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !381, retainedNodes: !845)
!842 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!843 = !DISubroutineType(types: !844)
!844 = !{!33, !799}
!845 = !{!839}
!846 = !DILocation(line: 918, column: 22, scope: !840, inlinedAt: !847)
!847 = !DILocation(line: 634, column: 13, scope: !825, inlinedAt: !838)
!848 = !DILocation(line: 918, column: 13, scope: !771)
!849 = !DILocation(line: 919, column: 20, scope: !771)
!850 = !DILocation(line: 919, column: 26, scope: !771)
!851 = !DILocation(line: 922, column: 2, scope: !762)
!852 = !DILocation(line: 922, column: 1, scope: !762)
!853 = !DILocation(line: 913, column: 1, scope: !762)
!854 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17h0faa29ad58c210fbE", scope: !856, file: !855, line: 555, type: !857, scopeLine: 555, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !859)
!855 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "510cfe98475d713af9de72a29146058c")
!856 = !DINamespace(name: "{impl#11}", scope: !433)
!857 = !DISubroutineType(types: !858)
!858 = !{!352, !9, !9}
!859 = !{!860, !861, !862, !864}
!860 = !DILocalVariable(name: "self", arg: 1, scope: !854, file: !855, line: 555, type: !9)
!861 = !DILocalVariable(name: "rhs", arg: 2, scope: !854, file: !855, line: 555, type: !9)
!862 = !DILocalVariable(name: "a", scope: !863, file: !855, line: 556, type: !9, align: 8)
!863 = distinct !DILexicalBlock(scope: !854, file: !855, line: 556, column: 13)
!864 = !DILocalVariable(name: "b", scope: !863, file: !855, line: 556, type: !526, align: 1)
!865 = !DILocation(line: 555, column: 34, scope: !854)
!866 = !DILocation(line: 555, column: 40, scope: !854)
!867 = !DILocation(line: 556, column: 26, scope: !854)
!868 = !DILocalVariable(name: "self", scope: !869, file: !855, line: 556, type: !9, align: 8)
!869 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17hce0beb250bffdecdE", scope: !856, file: !855, line: 1688, type: !870, scopeLine: 1688, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !23, retainedNodes: !876)
!870 = !DISubroutineType(types: !871)
!871 = !{!872, !9, !9}
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !873, templateParams: !23, identifier: "23309350ccb628a7900e37caa17b1249")
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !872, file: !2, baseType: !9, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !872, file: !2, baseType: !526, size: 8, align: 8, offset: 64)
!876 = !{!868, !877, !878, !880}
!877 = !DILocalVariable(name: "rhs", scope: !869, file: !855, line: 556, type: !9, align: 8)
!878 = !DILocalVariable(name: "a", scope: !879, file: !855, line: 556, type: !113, align: 8)
!879 = distinct !DILexicalBlock(scope: !869, file: !855, line: 1689, column: 13)
!880 = !DILocalVariable(name: "b", scope: !879, file: !855, line: 556, type: !526, align: 1)
!881 = !DILocation(line: 556, column: 26, scope: !869, inlinedAt: !867)
!882 = !DILocation(line: 556, column: 47, scope: !854)
!883 = !DILocation(line: 556, column: 26, scope: !879, inlinedAt: !867)
!884 = !DILocation(line: 556, column: 18, scope: !854)
!885 = !DILocation(line: 556, column: 18, scope: !863)
!886 = !DILocation(line: 556, column: 21, scope: !854)
!887 = !DILocation(line: 556, column: 21, scope: !863)
!888 = !DILocation(line: 557, column: 16, scope: !863)
!889 = !DILocation(line: 557, column: 42, scope: !863)
!890 = !DILocation(line: 557, column: 13, scope: !863)
!891 = !DILocation(line: 557, column: 30, scope: !863)
!892 = !DILocation(line: 558, column: 10, scope: !854)
!893 = !{i64 0, i64 2}
!894 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h62b1764724310aa1E", scope: !896, file: !895, line: 248, type: !899, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !905, retainedNodes: !902)
!895 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!896 = !DINamespace(name: "FnOnce", scope: !897)
!897 = !DINamespace(name: "function", scope: !898)
!898 = !DINamespace(name: "ops", scope: !60)
!899 = !DISubroutineType(types: !900)
!900 = !{!33, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !{!903, !904}
!903 = !DILocalVariable(arg: 1, scope: !894, file: !895, line: 248, type: !901)
!904 = !DILocalVariable(arg: 2, scope: !894, file: !895, line: 248, type: !7)
!905 = !{!906, !907}
!906 = !DITemplateTypeParameter(name: "Self", type: !14)
!907 = !DITemplateTypeParameter(name: "Args", type: !7)
!908 = !DILocation(line: 248, column: 5, scope: !894)
!909 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h0936d64a01bb1771E", scope: !896, file: !895, line: 248, type: !910, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !905, retainedNodes: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!33, !14}
!912 = !{!913, !914}
!913 = !DILocalVariable(arg: 1, scope: !909, file: !895, line: 248, type: !14)
!914 = !DILocalVariable(arg: 2, scope: !909, file: !895, line: 248, type: !7)
!915 = !DILocation(line: 248, column: 5, scope: !909)
!916 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h2d8bce1c3d41a520E", scope: !896, file: !895, line: 248, type: !227, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !920, retainedNodes: !917)
!917 = !{!918, !919}
!918 = !DILocalVariable(arg: 1, scope: !916, file: !895, line: 248, type: !20)
!919 = !DILocalVariable(arg: 2, scope: !916, file: !895, line: 248, type: !7)
!920 = !{!921, !907}
!921 = !DITemplateTypeParameter(name: "Self", type: !20)
!922 = !DILocation(line: 248, column: 5, scope: !916)
!923 = distinct !DISubprogram(name: "call_once<goto_tests::test_idiomatic_control_flow::test_idiomatic_switch::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h39e8eb38d436df64E", scope: !896, file: !895, line: 248, type: !924, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !933, retainedNodes: !930)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !926}
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !927, file: !2, align: 8, elements: !23, identifier: "c8977f2c7628e39947662151b7ef9483")
!927 = !DINamespace(name: "test_idiomatic_switch", scope: !928)
!928 = !DINamespace(name: "test_idiomatic_control_flow", scope: !929)
!929 = !DINamespace(name: "goto_tests", scope: null)
!930 = !{!931, !932}
!931 = !DILocalVariable(arg: 1, scope: !923, file: !895, line: 248, type: !926)
!932 = !DILocalVariable(arg: 2, scope: !923, file: !895, line: 248, type: !7)
!933 = !{!934, !907}
!934 = !DITemplateTypeParameter(name: "Self", type: !926)
!935 = !DILocation(line: 248, column: 5, scope: !923)
!936 = distinct !DISubprogram(name: "call_once<goto_tests::test_stmt_expr::test_stmt_expr_relooper::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h41c763d42022b7fcE", scope: !896, file: !895, line: 248, type: !937, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !945, retainedNodes: !942)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !939}
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !940, file: !2, align: 8, elements: !23, identifier: "5ccd03c5a653802b803cd1cb9193f469")
!940 = !DINamespace(name: "test_stmt_expr_relooper", scope: !941)
!941 = !DINamespace(name: "test_stmt_expr", scope: !929)
!942 = !{!943, !944}
!943 = !DILocalVariable(arg: 1, scope: !936, file: !895, line: 248, type: !939)
!944 = !DILocalVariable(arg: 2, scope: !936, file: !895, line: 248, type: !7)
!945 = !{!946, !907}
!946 = !DITemplateTypeParameter(name: "Self", type: !939)
!947 = !DILocation(line: 248, column: 5, scope: !936)
!948 = distinct !DISubprogram(name: "call_once<fn(&[u8]) -> &core::ffi::c_str::CStr, (&[u8])>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h4476029a4f2913a1E", scope: !896, file: !895, line: 248, type: !949, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !954, retainedNodes: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{!481, !500, !495}
!951 = !{!952, !953}
!952 = !DILocalVariable(arg: 1, scope: !948, file: !895, line: 248, type: !500)
!953 = !DILocalVariable(arg: 2, scope: !948, file: !895, line: 248, type: !492)
!954 = !{!955, !956}
!955 = !DITemplateTypeParameter(name: "Self", type: !500)
!956 = !DITemplateTypeParameter(name: "Args", type: !492)
!957 = !DILocation(line: 248, column: 5, scope: !948)
!958 = distinct !DISubprogram(name: "call_once<goto_tests::test_translation_only::test_nothing::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h582b916e36887c24E", scope: !896, file: !895, line: 248, type: !959, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !967, retainedNodes: !964)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !961}
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !962, file: !2, align: 8, elements: !23, identifier: "e75646c048a18218846219ce4149829f")
!962 = !DINamespace(name: "test_nothing", scope: !963)
!963 = !DINamespace(name: "test_translation_only", scope: !929)
!964 = !{!965, !966}
!965 = !DILocalVariable(arg: 1, scope: !958, file: !895, line: 248, type: !961)
!966 = !DILocalVariable(arg: 2, scope: !958, file: !895, line: 248, type: !7)
!967 = !{!968, !907}
!968 = !DITemplateTypeParameter(name: "Self", type: !961)
!969 = !DILocation(line: 248, column: 5, scope: !958)
!970 = distinct !DISubprogram(name: "call_once<goto_tests::test_duffs::test_duffs_test_multiple_three::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5cbed645fcfe9ec3E", scope: !896, file: !895, line: 248, type: !971, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !979, retainedNodes: !976)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !973}
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !974, file: !2, align: 8, elements: !23, identifier: "6e73350e3025fda03c6aea26a658aadf")
!974 = !DINamespace(name: "test_duffs_test_multiple_three", scope: !975)
!975 = !DINamespace(name: "test_duffs", scope: !929)
!976 = !{!977, !978}
!977 = !DILocalVariable(arg: 1, scope: !970, file: !895, line: 248, type: !973)
!978 = !DILocalVariable(arg: 2, scope: !970, file: !895, line: 248, type: !7)
!979 = !{!980, !907}
!980 = !DITemplateTypeParameter(name: "Self", type: !973)
!981 = !DILocation(line: 248, column: 5, scope: !970)
!982 = distinct !DISubprogram(name: "call_once<fn(&str) -> alloc::string::String, (&str)>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5f5b600851f6dd21E", scope: !896, file: !895, line: 248, type: !983, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !998, retainedNodes: !992)
!983 = !DISubroutineType(types: !984)
!984 = !{!985, !989, !653}
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !986, file: !2, size: 192, align: 64, elements: !987, templateParams: !23, identifier: "f9be69e76fc784402e5b8eb88fb718b5")
!986 = !DINamespace(name: "string", scope: !45)
!987 = !{!988}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !985, file: !2, baseType: !49, size: 192, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&str) -> alloc::string::String", baseType: !990, size: 64, align: 64, dwarfAddressSpace: 0)
!990 = !DISubroutineType(types: !991)
!991 = !{!985, !653}
!992 = !{!993, !994}
!993 = !DILocalVariable(arg: 1, scope: !982, file: !895, line: 248, type: !989)
!994 = !DILocalVariable(arg: 2, scope: !982, file: !895, line: 248, type: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&str)", file: !2, size: 128, align: 64, elements: !996, templateParams: !23, identifier: "e1090039062c1871dd001bf2d88c0044")
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !995, file: !2, baseType: !653, size: 128, align: 64)
!998 = !{!999, !1000}
!999 = !DITemplateTypeParameter(name: "Self", type: !989)
!1000 = !DITemplateTypeParameter(name: "Args", type: !995)
!1001 = !DILocation(line: 248, column: 5, scope: !982)
!1002 = distinct !DISubprogram(name: "call_once<goto_tests::test_irreducible::test_irreducible::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h80068044d9e54337E", scope: !896, file: !895, line: 248, type: !1003, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !1011, retainedNodes: !1008)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !1005}
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1006, file: !2, align: 8, elements: !23, identifier: "571576fda9396d5738337648717b01ee")
!1006 = !DINamespace(name: "test_irreducible", scope: !1007)
!1007 = !DINamespace(name: "test_irreducible", scope: !929)
!1008 = !{!1009, !1010}
!1009 = !DILocalVariable(arg: 1, scope: !1002, file: !895, line: 248, type: !1005)
!1010 = !DILocalVariable(arg: 2, scope: !1002, file: !895, line: 248, type: !7)
!1011 = !{!1012, !907}
!1012 = !DITemplateTypeParameter(name: "Self", type: !1005)
!1013 = !DILocation(line: 248, column: 5, scope: !1002)
!1014 = distinct !DISubprogram(name: "call_once<goto_tests::test_idiomatic_control_flow::test_break_multiple_loops::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h95d2ecf64982e828E", scope: !896, file: !895, line: 248, type: !1015, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !1022, retainedNodes: !1019)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !1017}
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1018, file: !2, align: 8, elements: !23, identifier: "d0d0b8b90dbc8780626af7b6dd446636")
!1018 = !DINamespace(name: "test_break_multiple_loops", scope: !928)
!1019 = !{!1020, !1021}
!1020 = !DILocalVariable(arg: 1, scope: !1014, file: !895, line: 248, type: !1017)
!1021 = !DILocalVariable(arg: 2, scope: !1014, file: !895, line: 248, type: !7)
!1022 = !{!1023, !907}
!1023 = !DITemplateTypeParameter(name: "Self", type: !1017)
!1024 = !DILocation(line: 248, column: 5, scope: !1014)
!1025 = distinct !DISubprogram(name: "call_once<goto_tests::test_early_returns::test_early_returns::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17ha735228e09055ff8E", scope: !896, file: !895, line: 248, type: !1026, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !1034, retainedNodes: !1031)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !1028}
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1029, file: !2, align: 8, elements: !23, identifier: "e84f81a43992d211e0dccef2f369c75c")
!1029 = !DINamespace(name: "test_early_returns", scope: !1030)
!1030 = !DINamespace(name: "test_early_returns", scope: !929)
!1031 = !{!1032, !1033}
!1032 = !DILocalVariable(arg: 1, scope: !1025, file: !895, line: 248, type: !1028)
!1033 = !DILocalVariable(arg: 2, scope: !1025, file: !895, line: 248, type: !7)
!1034 = !{!1035, !907}
!1035 = !DITemplateTypeParameter(name: "Self", type: !1028)
!1036 = !DILocation(line: 248, column: 5, scope: !1025)
!1037 = distinct !DISubprogram(name: "call_once<goto_tests::test_dfa_multiple_three::test_dfa_multiple_test_multiple_three::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hdea7de8f2ddc79caE", scope: !896, file: !895, line: 248, type: !1038, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !1046, retainedNodes: !1043)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !1040}
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1041, file: !2, align: 8, elements: !23, identifier: "76e165861b8dbdcc85b5eaa3cb026212")
!1041 = !DINamespace(name: "test_dfa_multiple_test_multiple_three", scope: !1042)
!1042 = !DINamespace(name: "test_dfa_multiple_three", scope: !929)
!1043 = !{!1044, !1045}
!1044 = !DILocalVariable(arg: 1, scope: !1037, file: !895, line: 248, type: !1040)
!1045 = !DILocalVariable(arg: 2, scope: !1037, file: !895, line: 248, type: !7)
!1046 = !{!1047, !907}
!1047 = !DITemplateTypeParameter(name: "Self", type: !1040)
!1048 = !DILocation(line: 248, column: 5, scope: !1037)
!1049 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17hc9fede581f1ac710E", scope: !59, file: !777, line: 487, type: !1050, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !471, retainedNodes: !1053)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{null, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!1053 = !{!1054}
!1054 = !DILocalVariable(arg: 1, scope: !1049, file: !777, line: 487, type: !1052)
!1055 = !DILocation(line: 487, column: 1, scope: !1049)
!1056 = distinct !DISubprogram(name: "drop_in_place<alloc::vec::Vec<u8, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr46drop_in_place$LT$alloc..vec..Vec$LT$u8$GT$$GT$17hde8e5ead57c1ab69E", scope: !59, file: !777, line: 487, type: !1057, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !1062, retainedNodes: !1060)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!1060 = !{!1061}
!1061 = !DILocalVariable(arg: 1, scope: !1056, file: !777, line: 487, type: !1059)
!1062 = !{!1063}
!1063 = !DITemplateTypeParameter(name: "T", type: !49)
!1064 = !DILocation(line: 487, column: 1, scope: !1056)
!1065 = distinct !DISubprogram(name: "drop_in_place<alloc::ffi::c_str::CString>", linkageName: "_ZN4core3ptr47drop_in_place$LT$alloc..ffi..c_str..CString$GT$17h70326eb27dc13dc3E", scope: !59, file: !777, line: 487, type: !1066, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !98, templateParams: !1078, retainedNodes: !1076)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{null, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::ffi::c_str::CString", baseType: !1069, size: 64, align: 64, dwarfAddressSpace: 0)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !43, file: !2, size: 128, align: 64, elements: !1070, templateParams: !23, identifier: "a4dcbb113228472ac833458ca2f5ee8d")
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1069, file: !2, baseType: !1072, size: 128, align: 64)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !1073, templateParams: !23, identifier: "e783b0825321c11fc908377d145707b4")
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1072, file: !2, baseType: !498, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1072, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
