; ModuleID = '58tdvzflsghmfn8r'
source_filename = "58tdvzflsghmfn8r"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::ffi::VaListImpl" = type { i32, i32, i8*, i8*, %"core::marker::PhantomData<&mut &core::ffi::c_void>" }
%"core::marker::PhantomData<&mut &core::ffi::c_void>" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_pointers.rs:58:1: 76:2]" = type {}
%"[closure@src/test_pointers.rs:25:1: 37:2]" = type {}
%"[closure@src/test_pointers.rs:40:1: 55:2]" = type {}
%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"core::mem::maybe_uninit::MaybeUninit<core::ffi::VaListImpl>" = type { [3 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&&[i32] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&[i32] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "215c11f5132fb91fc2f6be1aef55da1a")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !44, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!44 = !{!45, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !43, file: !2, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !43, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "<&[i32; 5] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 5] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !51, vtableHolder: !56, templateParams: !23, identifier: "c4ed3819c7760df720707546a9c96eb7")
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !50, file: !2, baseType: !6, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !50, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !50, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 5]", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, align: 32, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 5, lowerBound: 0)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "<&[i32; 31] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 31] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !63, vtableHolder: !68, templateParams: !23, identifier: "693ab37783a1be0850746ffb27e05d84")
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !62, file: !2, baseType: !6, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !62, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !62, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 31]", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 992, align: 32, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 31, lowerBound: 0)
!72 = !{i32 7, !"PIC Level", i32 2}
!73 = !{i32 7, !"PIE Level", i32 2}
!74 = !{i32 2, !"RtLibUseGOT", i32 1}
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !78, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !79, globals: !102)
!78 = !DIFile(filename: "src/lib.rs/@/58tdvzflsghmfn8r", directory: "/home/calvin/git/c2rust/tests/pointers")
!79 = !{!80, !91, !96}
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !81, file: !2, baseType: !85, size: 8, align: 8, flags: DIFlagEnumClass, elements: !86)
!81 = !DINamespace(name: "v1", scope: !82)
!82 = !DINamespace(name: "rt", scope: !83)
!83 = !DINamespace(name: "fmt", scope: !84)
!84 = !DINamespace(name: "core", scope: null)
!85 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!86 = !{!87, !88, !89, !90}
!87 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !92, file: !2, baseType: !85, size: 8, align: 8, flags: DIFlagEnumClass, elements: !93)
!92 = !DINamespace(name: "ffi", scope: !84)
!93 = !{!94, !95}
!94 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !97, file: !2, baseType: !85, size: 8, align: 8, flags: DIFlagEnumClass, elements: !98)
!97 = !DINamespace(name: "panicking", scope: !84)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!102 = !{!0, !24, !34, !48, !60}
!103 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hec4c0f2202a248f5E", scope: !105, file: !104, line: 118, type: !107, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !113, retainedNodes: !109)
!104 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!105 = !DINamespace(name: "backtrace", scope: !106)
!106 = !DINamespace(name: "sys_common", scope: !17)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !20}
!109 = !{!110, !111}
!110 = !DILocalVariable(name: "f", arg: 1, scope: !103, file: !104, line: 118, type: !20)
!111 = !DILocalVariable(name: "result", scope: !112, file: !104, line: 122, type: !7, align: 1)
!112 = distinct !DILexicalBlock(scope: !103, file: !104, line: 122, column: 5)
!113 = !{!114, !115}
!114 = !DITemplateTypeParameter(name: "F", type: !20)
!115 = !DITemplateTypeParameter(name: "T", type: !7)
!116 = !DILocation(line: 122, column: 9, scope: !112)
!117 = !DILocation(line: 118, column: 43, scope: !103)
!118 = !DILocalVariable(name: "dummy", scope: !119, file: !104, line: 125, type: !7, align: 1)
!119 = !DILexicalBlockFile(scope: !120, file: !104, discriminator: 0)
!120 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h648ed02494cc9e5cE", scope: !122, file: !121, line: 225, type: !123, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !126, retainedNodes: !125)
!121 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!122 = !DINamespace(name: "hint", scope: !84)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !7}
!125 = !{!118}
!126 = !{!115}
!127 = !DILocation(line: 125, column: 5, scope: !119, inlinedAt: !128)
!128 = !DILocation(line: 125, column: 5, scope: !112)
!129 = !DILocation(line: 122, column: 18, scope: !103)
!130 = !{i32 3357937}
!131 = !DILocation(line: 128, column: 2, scope: !103)
!132 = !DILocation(line: 128, column: 1, scope: !103)
!133 = !DILocation(line: 118, column: 1, scope: !103)
!134 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17hf5ed1fa981022ec8E", scope: !16, file: !135, line: 139, type: !136, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !126, retainedNodes: !141)
!135 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !20, !138, !139}
!138 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !140, size: 64, align: 64, dwarfAddressSpace: 0)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !{!142, !143, !144, !145}
!142 = !DILocalVariable(name: "main", arg: 1, scope: !134, file: !135, line: 140, type: !20)
!143 = !DILocalVariable(name: "argc", arg: 2, scope: !134, file: !135, line: 141, type: !138)
!144 = !DILocalVariable(name: "argv", arg: 3, scope: !134, file: !135, line: 142, type: !139)
!145 = !DILocalVariable(name: "v", scope: !146, file: !135, line: 144, type: !138, align: 8)
!146 = distinct !DILexicalBlock(scope: !134, file: !135, line: 144, column: 5)
!147 = !DILocation(line: 140, column: 5, scope: !134)
!148 = !DILocation(line: 141, column: 5, scope: !134)
!149 = !DILocation(line: 142, column: 5, scope: !134)
!150 = !DILocation(line: 145, column: 10, scope: !134)
!151 = !DILocation(line: 145, column: 9, scope: !134)
!152 = !DILocation(line: 144, column: 17, scope: !134)
!153 = !DILocation(line: 144, column: 12, scope: !134)
!154 = !DILocation(line: 144, column: 12, scope: !146)
!155 = !DILocation(line: 150, column: 2, scope: !134)
!156 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h4825b7b8c1a6d261E", scope: !15, file: !135, line: 145, type: !157, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !126, retainedNodes: !160)
!157 = !DISubroutineType(types: !158)
!158 = !{!33, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!160 = !{!161}
!161 = !DILocalVariable(name: "main", scope: !156, file: !135, line: 140, type: !20, align: 8)
!162 = !{i64 8}
!163 = !DILocation(line: 140, column: 5, scope: !156)
!164 = !DILocalVariable(name: "self", scope: !165, file: !135, line: 145, type: !168, align: 1)
!165 = !DILexicalBlockFile(scope: !166, file: !135, discriminator: 0)
!166 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h72d8a92e13c9c826E", scope: !168, file: !167, line: 1808, type: !179, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !23, retainedNodes: !181)
!167 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !169, file: !2, size: 8, align: 8, elements: !170, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!169 = !DINamespace(name: "process", scope: !17)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !168, file: !2, baseType: !172, size: 8, align: 8)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !173, file: !2, size: 8, align: 8, elements: !177, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!173 = !DINamespace(name: "process_common", scope: !174)
!174 = !DINamespace(name: "process", scope: !175)
!175 = !DINamespace(name: "unix", scope: !176)
!176 = !DINamespace(name: "sys", scope: !17)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !172, file: !2, baseType: !85, size: 8, align: 8)
!179 = !DISubroutineType(types: !180)
!180 = !{!33, !168}
!181 = !{!164}
!182 = !DILocation(line: 145, column: 18, scope: !165, inlinedAt: !183)
!183 = !DILocation(line: 145, column: 18, scope: !156)
!184 = !DILocation(line: 145, column: 77, scope: !156)
!185 = !DILocalVariable(name: "self", scope: !186, file: !135, line: 145, type: !191, align: 8)
!186 = !DILexicalBlockFile(scope: !187, file: !135, discriminator: 0)
!187 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h49b7c047e60bd06eE", scope: !172, file: !188, line: 485, type: !189, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !23, retainedNodes: !192)
!188 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!189 = !DISubroutineType(types: !190)
!190 = !{!33, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !172, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !{!185}
!193 = !DILocation(line: 145, column: 18, scope: !186, inlinedAt: !194)
!194 = !DILocation(line: 1809, column: 9, scope: !166, inlinedAt: !183)
!195 = !DILocation(line: 145, column: 17, scope: !156)
!196 = distinct !DISubprogram(name: "fmt<[i32; 5]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h07ff429f70921d85E", scope: !198, file: !197, line: 2361, type: !199, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !258, retainedNodes: !255)
!197 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!198 = !DINamespace(name: "{impl#59}", scope: !83)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !218, !219}
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !202, file: !2, size: 8, align: 8, elements: !203, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!202 = !DINamespace(name: "result", scope: !84)
!203 = !{!204}
!204 = !DICompositeType(tag: DW_TAG_variant_part, scope: !201, file: !2, size: 8, align: 8, elements: !205, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !217)
!205 = !{!206, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !204, file: !2, baseType: !207, size: 8, align: 8, extraData: i64 0)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !201, file: !2, size: 8, align: 8, elements: !208, templateParams: !210, identifier: "cea751326735c343faf647063a65ad14")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !207, file: !2, baseType: !7, align: 8, offset: 8)
!210 = !{!115, !211}
!211 = !DITemplateTypeParameter(name: "E", type: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !83, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !204, file: !2, baseType: !214, size: 8, align: 8, extraData: i64 1)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !201, file: !2, size: 8, align: 8, elements: !215, templateParams: !210, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !214, file: !2, baseType: !212, align: 8, offset: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, scope: !201, file: !2, baseType: !85, size: 8, align: 8, flags: DIFlagArtificial)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 5]", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !220, size: 64, align: 64, dwarfAddressSpace: 0)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !83, file: !2, size: 512, align: 64, elements: !221, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!221 = !{!222, !224, !226, !227, !243, !244}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !220, file: !2, baseType: !223, size: 32, align: 32, offset: 384)
!223 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !220, file: !2, baseType: !225, size: 32, align: 32, offset: 416)
!225 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !220, file: !2, baseType: !80, size: 8, align: 8, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !220, file: !2, baseType: !228, size: 128, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !229, file: !2, size: 128, align: 64, elements: !230, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!229 = !DINamespace(name: "option", scope: !84)
!230 = !{!231}
!231 = !DICompositeType(tag: DW_TAG_variant_part, scope: !228, file: !2, size: 128, align: 64, elements: !232, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !241)
!232 = !{!233, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !231, file: !2, baseType: !234, size: 128, align: 64, extraData: i64 0)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !228, file: !2, size: 128, align: 64, elements: !23, templateParams: !235, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !9)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !231, file: !2, baseType: !238, size: 128, align: 64, extraData: i64 1)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !228, file: !2, size: 128, align: 64, elements: !239, templateParams: !235, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !238, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !2, baseType: !242, size: 64, align: 64, flags: DIFlagArtificial)
!242 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !220, file: !2, baseType: !228, size: 128, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !220, file: !2, baseType: !245, size: 128, align: 64, offset: 256)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !246, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!246 = !{!247, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !245, file: !2, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64, dwarfAddressSpace: 0)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !245, file: !2, baseType: !251, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !252, size: 64, align: 64, dwarfAddressSpace: 0)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 3, lowerBound: 0)
!255 = !{!256, !257}
!256 = !DILocalVariable(name: "self", arg: 1, scope: !196, file: !197, line: 2361, type: !218)
!257 = !DILocalVariable(name: "f", arg: 2, scope: !196, file: !197, line: 2361, type: !219)
!258 = !{!259}
!259 = !DITemplateTypeParameter(name: "T", type: !57)
!260 = !DILocation(line: 2361, column: 20, scope: !196)
!261 = !DILocation(line: 2361, column: 27, scope: !196)
!262 = !DILocation(line: 2361, column: 71, scope: !196)
!263 = !{i64 4}
!264 = !DILocation(line: 2361, column: 62, scope: !196)
!265 = !DILocation(line: 2361, column: 84, scope: !196)
!266 = distinct !DISubprogram(name: "fmt<&[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h2f6923c7d1ff7ef7E", scope: !198, file: !197, line: 2361, type: !267, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !273, retainedNodes: !270)
!267 = !DISubroutineType(types: !268)
!268 = !{!201, !269, !219}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&&[i32]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!270 = !{!271, !272}
!271 = !DILocalVariable(name: "self", arg: 1, scope: !266, file: !197, line: 2361, type: !269)
!272 = !DILocalVariable(name: "f", arg: 2, scope: !266, file: !197, line: 2361, type: !219)
!273 = !{!274}
!274 = !DITemplateTypeParameter(name: "T", type: !43)
!275 = !DILocation(line: 2361, column: 20, scope: !266)
!276 = !DILocation(line: 2361, column: 27, scope: !266)
!277 = !DILocation(line: 2361, column: 71, scope: !266)
!278 = !DILocation(line: 2361, column: 62, scope: !266)
!279 = !DILocation(line: 2361, column: 84, scope: !266)
!280 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h350233ea4a3e3af8E", scope: !198, file: !197, line: 2361, type: !281, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !284)
!281 = !DISubroutineType(types: !282)
!282 = !{!201, !283, !219}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!284 = !{!285, !286}
!285 = !DILocalVariable(name: "self", arg: 1, scope: !280, file: !197, line: 2361, type: !283)
!286 = !DILocalVariable(name: "f", arg: 2, scope: !280, file: !197, line: 2361, type: !219)
!287 = !{!288}
!288 = !DITemplateTypeParameter(name: "T", type: !33)
!289 = !DILocation(line: 2361, column: 20, scope: !280)
!290 = !DILocation(line: 2361, column: 27, scope: !280)
!291 = !DILocation(line: 2361, column: 71, scope: !280)
!292 = !DILocation(line: 2361, column: 62, scope: !280)
!293 = !DILocation(line: 2361, column: 84, scope: !280)
!294 = distinct !DISubprogram(name: "fmt<[i32; 31]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hd6f27fdc657deeeaE", scope: !198, file: !197, line: 2361, type: !295, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !301, retainedNodes: !298)
!295 = !DISubroutineType(types: !296)
!296 = !{!201, !297, !219}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 31]", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !{!299, !300}
!299 = !DILocalVariable(name: "self", arg: 1, scope: !294, file: !197, line: 2361, type: !297)
!300 = !DILocalVariable(name: "f", arg: 2, scope: !294, file: !197, line: 2361, type: !219)
!301 = !{!302}
!302 = !DITemplateTypeParameter(name: "T", type: !69)
!303 = !DILocation(line: 2361, column: 20, scope: !294)
!304 = !DILocation(line: 2361, column: 27, scope: !294)
!305 = !DILocation(line: 2361, column: 71, scope: !294)
!306 = !DILocation(line: 2361, column: 62, scope: !294)
!307 = !DILocation(line: 2361, column: 84, scope: !294)
!308 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hf5704ec34c7f559bE", scope: !198, file: !197, line: 2361, type: !309, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !311)
!309 = !DISubroutineType(types: !310)
!310 = !{!201, !42, !219}
!311 = !{!312, !313}
!312 = !DILocalVariable(name: "self", arg: 1, scope: !308, file: !197, line: 2361, type: !42)
!313 = !DILocalVariable(name: "f", arg: 2, scope: !308, file: !197, line: 2361, type: !219)
!314 = !DILocation(line: 2361, column: 20, scope: !308)
!315 = !DILocation(line: 2361, column: 27, scope: !308)
!316 = !DILocation(line: 2361, column: 71, scope: !308)
!317 = !DILocation(line: 2361, column: 62, scope: !308)
!318 = !DILocation(line: 2361, column: 84, scope: !308)
!319 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17h66049e441ae961f5E", scope: !320, file: !197, line: 2586, type: !321, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !323)
!320 = !DINamespace(name: "{impl#26}", scope: !83)
!321 = !DISubroutineType(types: !322)
!322 = !{!201, !43, !219}
!323 = !{!324, !325}
!324 = !DILocalVariable(name: "self", arg: 1, scope: !319, file: !197, line: 2586, type: !43)
!325 = !DILocalVariable(name: "f", arg: 2, scope: !319, file: !197, line: 2586, type: !219)
!326 = !DILocation(line: 2586, column: 12, scope: !319)
!327 = !DILocation(line: 2586, column: 19, scope: !319)
!328 = !DILocation(line: 2587, column: 9, scope: !319)
!329 = !DILocation(line: 2587, column: 32, scope: !319)
!330 = !DILocalVariable(name: "self", scope: !331, file: !197, line: 2587, type: !43, align: 8)
!331 = !DILexicalBlockFile(scope: !332, file: !197, discriminator: 0)
!332 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17hf2b68000ebe7565eE", scope: !334, file: !333, line: 734, type: !336, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !354)
!333 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!334 = !DINamespace(name: "{impl#0}", scope: !335)
!335 = !DINamespace(name: "slice", scope: !84)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !43}
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !339, file: !2, size: 128, align: 64, elements: !340, templateParams: !287, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!339 = !DINamespace(name: "iter", scope: !335)
!340 = !{!341, !348, !349}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !338, file: !2, baseType: !342, size: 64, align: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !343, file: !2, size: 64, align: 64, elements: !345, templateParams: !287, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!343 = !DINamespace(name: "non_null", scope: !344)
!344 = !DINamespace(name: "ptr", scope: !84)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !342, file: !2, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !338, file: !2, baseType: !347, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !338, file: !2, baseType: !350, align: 8)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !351, file: !2, align: 8, elements: !23, templateParams: !352, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!351 = !DINamespace(name: "marker", scope: !84)
!352 = !{!353}
!353 = !DITemplateTypeParameter(name: "T", type: !32)
!354 = !{!330}
!355 = !DILocation(line: 2587, column: 32, scope: !331, inlinedAt: !329)
!356 = !DILocation(line: 2588, column: 6, scope: !319)
!357 = distinct !DISubprogram(name: "eq<[i32], [i32]>", linkageName: "_ZN4core3cmp5impls69_$LT$impl$u20$core..cmp..PartialEq$LT$$RF$B$GT$$u20$for$u20$$RF$A$GT$2eq17hb9df5ab02c72617dE", scope: !359, file: !358, line: 1512, type: !362, scopeLine: 1512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !368, retainedNodes: !365)
!358 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!359 = !DINamespace(name: "{impl#9}", scope: !360)
!360 = !DINamespace(name: "impls", scope: !361)
!361 = !DINamespace(name: "cmp", scope: !84)
!362 = !DISubroutineType(types: !363)
!363 = !{!364, !42, !42}
!364 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!365 = !{!366, !367}
!366 = !DILocalVariable(name: "self", arg: 1, scope: !357, file: !358, line: 1512, type: !42)
!367 = !DILocalVariable(name: "other", arg: 2, scope: !357, file: !358, line: 1512, type: !42)
!368 = !{!369, !370}
!369 = !DITemplateTypeParameter(name: "A", type: !33)
!370 = !DITemplateTypeParameter(name: "B", type: !33)
!371 = !DILocation(line: 1512, column: 15, scope: !357)
!372 = !DILocation(line: 1512, column: 22, scope: !357)
!373 = !DILocation(line: 1513, column: 27, scope: !357)
!374 = !DILocation(line: 1513, column: 34, scope: !357)
!375 = !DILocation(line: 1513, column: 13, scope: !357)
!376 = !DILocation(line: 1514, column: 10, scope: !357)
!377 = distinct !DISubprogram(name: "arg<*mut unsafe extern \22C\22 fn(i8) -> i32>", linkageName: "_ZN4core3ffi10VaListImpl3arg17h415d4a67e3abf359E", scope: !379, file: !378, line: 510, type: !392, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !402, retainedNodes: !400)
!378 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ffi/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "042bf4c6210bbea7946ffc45f3c5e379")
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "VaListImpl", scope: !92, file: !2, size: 192, align: 64, elements: !380, templateParams: !23, identifier: "59481d630e596d9a79497278542848a7")
!380 = !{!381, !382, !383, !385, !386}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !379, file: !2, baseType: !33, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !379, file: !2, baseType: !33, size: 32, align: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !379, file: !2, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !379, file: !2, baseType: !384, size: 64, align: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !379, file: !2, baseType: !387, align: 8, offset: 192)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut &core::ffi::c_void>", scope: !351, file: !2, align: 8, elements: !23, templateParams: !388, identifier: "6defb32c455b0e6e35dcf92c27d8d2be")
!388 = !{!389}
!389 = !DITemplateTypeParameter(name: "T", type: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &core::ffi::c_void", baseType: !391, size: 64, align: 64, dwarfAddressSpace: 0)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ffi::c_void", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !399}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut unsafe extern \22C\22 fn(i8) -> i32", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(i8) -> i32", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DISubroutineType(types: !397)
!397 = !{!33, !398}
!398 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ffi::VaListImpl", baseType: !379, size: 64, align: 64, dwarfAddressSpace: 0)
!400 = !{!401}
!401 = !DILocalVariable(name: "self", arg: 1, scope: !377, file: !378, line: 510, type: !399)
!402 = !{!403}
!403 = !DITemplateTypeParameter(name: "T", type: !394)
!404 = !DILocation(line: 510, column: 51, scope: !377)
!405 = !DILocation(line: 512, column: 18, scope: !377)
!406 = !DILocation(line: 513, column: 6, scope: !377)
!407 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h6587bf8201687637E", scope: !409, file: !408, line: 185, type: !411, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !23, retainedNodes: !413)
!408 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!409 = !DINamespace(name: "{impl#80}", scope: !410)
!410 = !DINamespace(name: "num", scope: !83)
!411 = !DISubroutineType(types: !412)
!412 = !{!201, !32, !219}
!413 = !{!414, !415}
!414 = !DILocalVariable(name: "self", arg: 1, scope: !407, file: !408, line: 185, type: !32)
!415 = !DILocalVariable(name: "f", arg: 2, scope: !407, file: !408, line: 185, type: !219)
!416 = !DILocation(line: 185, column: 20, scope: !407)
!417 = !DILocation(line: 185, column: 27, scope: !407)
!418 = !DILocation(line: 186, column: 20, scope: !407)
!419 = !DILocation(line: 188, column: 27, scope: !407)
!420 = !DILocation(line: 187, column: 21, scope: !407)
!421 = !DILocation(line: 186, column: 17, scope: !407)
!422 = !DILocation(line: 193, column: 14, scope: !407)
!423 = !{i8 0, i8 2}
!424 = !DILocation(line: 191, column: 21, scope: !407)
!425 = !DILocation(line: 189, column: 21, scope: !407)
!426 = !DILocation(line: 188, column: 24, scope: !407)
!427 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hfd2cf739576db175E", scope: !429, file: !428, line: 637, type: !438, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !448, retainedNodes: !441)
!428 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !430, file: !2, size: 128, align: 64, elements: !431, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!430 = !DINamespace(name: "builders", scope: !83)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !429, file: !2, baseType: !433, size: 128, align: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !430, file: !2, size: 128, align: 64, elements: !434, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !433, file: !2, baseType: !219, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !433, file: !2, baseType: !201, size: 8, align: 8, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !433, file: !2, baseType: !364, size: 8, align: 8, offset: 72)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !440, !338}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !429, size: 64, align: 64, dwarfAddressSpace: 0)
!441 = !{!442, !443, !444, !446}
!442 = !DILocalVariable(name: "self", arg: 1, scope: !427, file: !428, line: 637, type: !440)
!443 = !DILocalVariable(name: "entries", arg: 2, scope: !427, file: !428, line: 637, type: !338)
!444 = !DILocalVariable(name: "iter", scope: !445, file: !428, line: 642, type: !338, align: 8)
!445 = distinct !DILexicalBlock(scope: !427, file: !428, line: 642, column: 9)
!446 = !DILocalVariable(name: "entry", scope: !447, file: !428, line: 642, type: !32, align: 8)
!447 = distinct !DILexicalBlock(scope: !445, file: !428, line: 642, column: 30)
!448 = !{!449, !450}
!449 = !DITemplateTypeParameter(name: "D", type: !32)
!450 = !DITemplateTypeParameter(name: "I", type: !338)
!451 = !DILocation(line: 637, column: 26, scope: !427)
!452 = !DILocation(line: 637, column: 37, scope: !427)
!453 = !DILocation(line: 642, column: 22, scope: !445)
!454 = !DILocation(line: 642, column: 13, scope: !447)
!455 = !DILocation(line: 642, column: 22, scope: !427)
!456 = !DILocation(line: 642, column: 9, scope: !445)
!457 = !DILocation(line: 642, column: 9, scope: !427)
!458 = !DILocation(line: 642, column: 13, scope: !445)
!459 = !DILocation(line: 643, column: 24, scope: !447)
!460 = !DILocation(line: 643, column: 13, scope: !447)
!461 = !DILocation(line: 644, column: 9, scope: !445)
!462 = !DILocation(line: 637, column: 5, scope: !427)
!463 = !DILocation(line: 646, column: 6, scope: !427)
!464 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hbd9a0c00d1b2c782E", scope: !465, file: !197, line: 390, type: !539, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !23, retainedNodes: !541)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !83, file: !2, size: 384, align: 64, elements: !466, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!466 = !{!467, !478, !523}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !465, file: !2, baseType: !468, size: 128, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !469, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!469 = !{!470, !477}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !468, file: !2, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !473, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !472, file: !2, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !472, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !465, file: !2, baseType: !479, size: 128, align: 64, offset: 128)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !229, file: !2, size: 128, align: 64, elements: !480, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!480 = !{!481}
!481 = !DICompositeType(tag: DW_TAG_variant_part, scope: !479, file: !2, size: 128, align: 64, elements: !482, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !522)
!482 = !{!483, !518}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !481, file: !2, baseType: !484, size: 128, align: 64, extraData: i64 0)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !479, file: !2, size: 128, align: 64, elements: !23, templateParams: !485, identifier: "742dbe7e160661d8ca36fcfff2574850")
!485 = !{!486}
!486 = !DITemplateTypeParameter(name: "T", type: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !488, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!488 = !{!489, !517}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !487, file: !2, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64, dwarfAddressSpace: 0)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !81, file: !2, size: 448, align: 64, elements: !492, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !491, file: !2, baseType: !9, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !491, file: !2, baseType: !495, size: 384, align: 64, offset: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !81, file: !2, size: 384, align: 64, elements: !496, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!496 = !{!497, !498, !499, !500, !516}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !495, file: !2, baseType: !225, size: 32, align: 32, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !495, file: !2, baseType: !80, size: 8, align: 8, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !2, baseType: !223, size: 32, align: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !495, file: !2, baseType: !501, size: 128, align: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !81, file: !2, size: 128, align: 64, elements: !502, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!502 = !{!503}
!503 = !DICompositeType(tag: DW_TAG_variant_part, scope: !501, file: !2, size: 128, align: 64, elements: !504, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !515)
!504 = !{!505, !509, !513}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !503, file: !2, baseType: !506, size: 128, align: 64, extraData: i64 0)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !501, file: !2, size: 128, align: 64, elements: !507, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !506, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !503, file: !2, baseType: !510, size: 128, align: 64, extraData: i64 1)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !501, file: !2, size: 128, align: 64, elements: !511, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !510, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !503, file: !2, baseType: !514, size: 128, align: 64, extraData: i64 2)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !501, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !501, file: !2, baseType: !242, size: 64, align: 64, flags: DIFlagArtificial)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !495, file: !2, baseType: !501, size: 128, align: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !487, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !481, file: !2, baseType: !519, size: 128, align: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !479, file: !2, size: 128, align: 64, elements: !520, templateParams: !485, identifier: "17f2fc106094349c7673abca4839c97a")
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !519, file: !2, baseType: !487, size: 128, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !479, file: !2, baseType: !242, size: 64, align: 64, flags: DIFlagArtificial)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !465, file: !2, baseType: !524, size: 128, align: 64, offset: 256)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !525, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!525 = !{!526, !538}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !524, file: !2, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64, dwarfAddressSpace: 0)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !83, file: !2, size: 128, align: 64, elements: !529, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!529 = !{!530, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !528, file: !2, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !532, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !533, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!533 = !DINamespace(name: "{extern#0}", scope: !83)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !528, file: !2, baseType: !535, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !536, size: 64, align: 64, dwarfAddressSpace: 0)
!536 = !DISubroutineType(types: !537)
!537 = !{!201, !531, !219}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !524, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!465, !468, !524}
!541 = !{!542, !543}
!542 = !DILocalVariable(name: "pieces", arg: 1, scope: !464, file: !197, line: 390, type: !468)
!543 = !DILocalVariable(name: "args", arg: 2, scope: !464, file: !197, line: 390, type: !524)
!544 = !DILocation(line: 390, column: 25, scope: !464)
!545 = !DILocation(line: 390, column: 53, scope: !464)
!546 = !DILocation(line: 391, column: 12, scope: !464)
!547 = !DILocation(line: 391, column: 56, scope: !464)
!548 = !DILocation(line: 391, column: 41, scope: !464)
!549 = !DILocation(line: 394, column: 34, scope: !464)
!550 = !DILocation(line: 394, column: 9, scope: !464)
!551 = !DILocation(line: 395, column: 6, scope: !464)
!552 = !DILocation(line: 392, column: 13, scope: !464)
!553 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hd03f0463aac53634E", scope: !555, file: !554, line: 248, type: !558, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !564, retainedNodes: !561)
!554 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!555 = !DINamespace(name: "FnOnce", scope: !556)
!556 = !DINamespace(name: "function", scope: !557)
!557 = !DINamespace(name: "ops", scope: !84)
!558 = !DISubroutineType(types: !559)
!559 = !{!33, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !{!562, !563}
!562 = !DILocalVariable(arg: 1, scope: !553, file: !554, line: 248, type: !560)
!563 = !DILocalVariable(arg: 2, scope: !553, file: !554, line: 248, type: !7)
!564 = !{!565, !566}
!565 = !DITemplateTypeParameter(name: "Self", type: !14)
!566 = !DITemplateTypeParameter(name: "Args", type: !7)
!567 = !DILocation(line: 248, column: 5, scope: !553)
!568 = distinct !DISubprogram(name: "call_once<pointer_tests::test_pointers::test_fn_ptrs::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h104b15f451b1ba71E", scope: !555, file: !554, line: 248, type: !569, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !578, retainedNodes: !575)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !571}
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !572, file: !2, align: 8, elements: !23, identifier: "e5639b449e206f53755e6646d25eee7")
!572 = !DINamespace(name: "test_fn_ptrs", scope: !573)
!573 = !DINamespace(name: "test_pointers", scope: !574)
!574 = !DINamespace(name: "pointer_tests", scope: null)
!575 = !{!576, !577}
!576 = !DILocalVariable(arg: 1, scope: !568, file: !554, line: 248, type: !571)
!577 = !DILocalVariable(arg: 2, scope: !568, file: !554, line: 248, type: !7)
!578 = !{!579, !566}
!579 = !DITemplateTypeParameter(name: "Self", type: !571)
!580 = !DILocation(line: 248, column: 5, scope: !568)
!581 = distinct !DISubprogram(name: "call_once<pointer_tests::test_pointers::test_init::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h48497be019f634f5E", scope: !555, file: !554, line: 248, type: !582, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !589, retainedNodes: !586)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !584}
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !585, file: !2, align: 8, elements: !23, identifier: "170f5eb4607a6457dc37fb5c4a4dd9e8")
!585 = !DINamespace(name: "test_init", scope: !573)
!586 = !{!587, !588}
!587 = !DILocalVariable(arg: 1, scope: !581, file: !554, line: 248, type: !584)
!588 = !DILocalVariable(arg: 2, scope: !581, file: !554, line: 248, type: !7)
!589 = !{!590, !566}
!590 = !DITemplateTypeParameter(name: "Self", type: !584)
!591 = !DILocation(line: 248, column: 5, scope: !581)
!592 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hb2c4079728abfdfeE", scope: !555, file: !554, line: 248, type: !593, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !564, retainedNodes: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{!33, !14}
!595 = !{!596, !597}
!596 = !DILocalVariable(arg: 1, scope: !592, file: !554, line: 248, type: !14)
!597 = !DILocalVariable(arg: 2, scope: !592, file: !554, line: 248, type: !7)
!598 = !DILocation(line: 248, column: 5, scope: !592)
!599 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf11d9ae6345df402E", scope: !555, file: !554, line: 248, type: !107, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !603, retainedNodes: !600)
!600 = !{!601, !602}
!601 = !DILocalVariable(arg: 1, scope: !599, file: !554, line: 248, type: !20)
!602 = !DILocalVariable(arg: 2, scope: !599, file: !554, line: 248, type: !7)
!603 = !{!604, !566}
!604 = !DITemplateTypeParameter(name: "Self", type: !20)
!605 = !DILocation(line: 248, column: 5, scope: !599)
!606 = distinct !DISubprogram(name: "call_once<pointer_tests::test_pointers::test_arith::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf9825313a0411a58E", scope: !555, file: !554, line: 248, type: !607, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !614, retainedNodes: !611)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609}
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !610, file: !2, align: 8, elements: !23, identifier: "65fcfe890cab3cdd1818bfe49ee3eec0")
!610 = !DINamespace(name: "test_arith", scope: !573)
!611 = !{!612, !613}
!612 = !DILocalVariable(arg: 1, scope: !606, file: !554, line: 248, type: !609)
!613 = !DILocalVariable(arg: 2, scope: !606, file: !554, line: 248, type: !7)
!614 = !{!615, !566}
!615 = !DITemplateTypeParameter(name: "Self", type: !609)
!616 = !DILocation(line: 248, column: 5, scope: !606)
!617 = distinct !DISubprogram(name: "eq<i32, i8>", linkageName: "_ZN4core3ptr118_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$unsafe$u20$extern$u20$$u22$C$u22$$u20$fn$LP$T$RP$$u20$.$GT$$u20$Ret$GT$2eq17hb3bc34956817cd06E", scope: !619, file: !618, line: 1862, type: !620, scopeLine: 1862, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !626, retainedNodes: !623)
!618 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!619 = !DINamespace(name: "{impl#56}", scope: !344)
!620 = !DISubroutineType(types: !621)
!621 = !{!364, !622, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&unsafe extern \22C\22 fn(i8) -> i32", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!623 = !{!624, !625}
!624 = !DILocalVariable(name: "self", arg: 1, scope: !617, file: !618, line: 1862, type: !622)
!625 = !DILocalVariable(name: "other", arg: 2, scope: !617, file: !618, line: 1862, type: !622)
!626 = !{!627, !628}
!627 = !DITemplateTypeParameter(name: "Ret", type: !33)
!628 = !DITemplateTypeParameter(name: "T", type: !398)
!629 = !DILocation(line: 1862, column: 23, scope: !617)
!630 = !DILocation(line: 1862, column: 30, scope: !617)
!631 = !DILocation(line: 1863, column: 21, scope: !617)
!632 = !DILocation(line: 1863, column: 39, scope: !617)
!633 = !DILocation(line: 1864, column: 18, scope: !617)
!634 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h1a045668aadb46adE", scope: !344, file: !618, line: 487, type: !635, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !352, retainedNodes: !638)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!638 = !{!639}
!639 = !DILocalVariable(arg: 1, scope: !634, file: !618, line: 487, type: !637)
!640 = !DILocation(line: 487, column: 1, scope: !634)
!641 = distinct !DISubprogram(name: "drop_in_place<&&[i32]>", linkageName: "_ZN4core3ptr42drop_in_place$LT$$RF$$RF$$u5b$i32$u5d$$GT$17h1ec70f77f85f04e0E", scope: !344, file: !618, line: 487, type: !642, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !647, retainedNodes: !645)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &&[i32]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!645 = !{!646}
!646 = !DILocalVariable(arg: 1, scope: !641, file: !618, line: 487, type: !644)
!647 = !{!648}
!648 = !DITemplateTypeParameter(name: "T", type: !42)
!649 = !DILocation(line: 487, column: 1, scope: !641)
!650 = distinct !DISubprogram(name: "drop_in_place<core::ffi::VaListImpl>", linkageName: "_ZN4core3ptr42drop_in_place$LT$core..ffi..VaListImpl$GT$17h96c49c1d0bc83d4dE", scope: !344, file: !618, line: 487, type: !651, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !656, retainedNodes: !654)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::VaListImpl", baseType: !379, size: 64, align: 64, dwarfAddressSpace: 0)
!654 = !{!655}
!655 = !DILocalVariable(arg: 1, scope: !650, file: !618, line: 487, type: !653)
!656 = !{!657}
!657 = !DITemplateTypeParameter(name: "T", type: !379)
!658 = !DILocation(line: 487, column: 1, scope: !650)
!659 = distinct !DISubprogram(name: "drop_in_place<&[i32; 5]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$5$u5d$$GT$17h620cb157784bf1f9E", scope: !344, file: !618, line: 487, type: !660, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !665, retainedNodes: !663)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 5]", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!663 = !{!664}
!664 = !DILocalVariable(arg: 1, scope: !659, file: !618, line: 487, type: !662)
!665 = !{!666}
!666 = !DITemplateTypeParameter(name: "T", type: !56)
!667 = !DILocation(line: 487, column: 1, scope: !659)
!668 = distinct !DISubprogram(name: "drop_in_place<&[i32; 31]>", linkageName: "_ZN4core3ptr50drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$31$u5d$$GT$17h51d4209fe257985eE", scope: !344, file: !618, line: 487, type: !669, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !674, retainedNodes: !672)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 31]", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!672 = !{!673}
!673 = !DILocalVariable(arg: 1, scope: !668, file: !618, line: 487, type: !671)
!674 = !{!675}
!675 = !DITemplateTypeParameter(name: "T", type: !68)
!676 = !DILocation(line: 487, column: 1, scope: !668)
!677 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h80e796e8bbd6c599E", scope: !344, file: !618, line: 487, type: !678, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !682, retainedNodes: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !560}
!680 = !{!681}
!681 = !DILocalVariable(arg: 1, scope: !677, file: !618, line: 487, type: !560)
!682 = !{!683}
!683 = !DITemplateTypeParameter(name: "T", type: !14)
!684 = !DILocation(line: 487, column: 1, scope: !677)
!685 = distinct !DISubprogram(name: "offset_from<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$11offset_from17h97d93ef5cc4158e2E", scope: !687, file: !686, line: 647, type: !689, scopeLine: 647, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !691)
!686 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!687 = !DINamespace(name: "{impl#0}", scope: !688)
!688 = !DINamespace(name: "const_ptr", scope: !344)
!689 = !DISubroutineType(types: !690)
!690 = !{!138, !347, !347}
!691 = !{!692, !693, !694}
!692 = !DILocalVariable(name: "self", arg: 1, scope: !685, file: !686, line: 647, type: !347)
!693 = !DILocalVariable(name: "origin", arg: 2, scope: !685, file: !686, line: 647, type: !347)
!694 = !DILocalVariable(name: "pointee_size", scope: !695, file: !686, line: 651, type: !9, align: 8)
!695 = distinct !DILexicalBlock(scope: !685, file: !686, line: 651, column: 9)
!696 = !DILocation(line: 647, column: 37, scope: !685)
!697 = !DILocation(line: 647, column: 43, scope: !685)
!698 = !DILocation(line: 651, column: 28, scope: !699, inlinedAt: !705)
!699 = !DILexicalBlockFile(scope: !700, file: !686, discriminator: 0)
!700 = distinct !DISubprogram(name: "size_of<i32>", linkageName: "_ZN4core3mem7size_of17h466d40a16967a06bE", scope: !702, file: !701, line: 314, type: !703, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !23)
!701 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "27c8869548c9dcb65186c5584c2586f6")
!702 = !DINamespace(name: "mem", scope: !84)
!703 = !DISubroutineType(types: !704)
!704 = !{!9}
!705 = !DILocation(line: 651, column: 28, scope: !685)
!706 = !DILocation(line: 651, column: 13, scope: !695)
!707 = !DILocation(line: 652, column: 17, scope: !695)
!708 = !DILocation(line: 652, column: 9, scope: !695)
!709 = !DILocation(line: 654, column: 18, scope: !695)
!710 = !DILocation(line: 655, column: 6, scope: !685)
!711 = distinct !DISubprogram(name: "fmt<i32, 31>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17h345b1367977e00a3E", scope: !713, file: !712, line: 251, type: !715, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !717)
!712 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e237aff39bff30ac55984ee183267020")
!713 = !DINamespace(name: "{impl#12}", scope: !714)
!714 = !DINamespace(name: "array", scope: !84)
!715 = !DISubroutineType(types: !716)
!716 = !{!201, !68, !219}
!717 = !{!718, !719}
!718 = !DILocalVariable(name: "self", arg: 1, scope: !711, file: !712, line: 251, type: !68)
!719 = !DILocalVariable(name: "f", arg: 2, scope: !711, file: !712, line: 251, type: !219)
!720 = !DILocation(line: 251, column: 12, scope: !711)
!721 = !DILocation(line: 251, column: 19, scope: !711)
!722 = !DILocalVariable(name: "index", scope: !723, file: !712, line: 252, type: !727, align: 1)
!723 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 31>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h8f7e75c90acc3168E", scope: !724, file: !712, line: 285, type: !725, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !739, retainedNodes: !737)
!724 = !DINamespace(name: "{impl#15}", scope: !714)
!725 = !DISubroutineType(types: !726)
!726 = !{!43, !68, !727, !729}
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !728, file: !2, align: 8, elements: !23, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!728 = !DINamespace(name: "range", scope: !557)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !730, size: 64, align: 64, dwarfAddressSpace: 0)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !731, file: !2, size: 192, align: 64, elements: !733, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!731 = !DINamespace(name: "location", scope: !732)
!732 = !DINamespace(name: "panic", scope: !84)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !730, file: !2, baseType: !472, size: 128, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !730, file: !2, baseType: !223, size: 32, align: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !730, file: !2, baseType: !223, size: 32, align: 32, offset: 160)
!737 = !{!738, !722}
!738 = !DILocalVariable(name: "self", scope: !723, file: !712, line: 252, type: !68, align: 8)
!739 = !{!288, !740}
!740 = !DITemplateTypeParameter(name: "I", type: !727)
!741 = !DILocation(line: 252, column: 27, scope: !723, inlinedAt: !742)
!742 = !DILocation(line: 252, column: 27, scope: !711)
!743 = !DILocalVariable(name: "index", scope: !744, file: !712, line: 252, type: !727, align: 1)
!744 = !DILexicalBlockFile(scope: !745, file: !712, discriminator: 0)
!745 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hbd4a9ac6cab12fd8E", scope: !747, file: !746, line: 17, type: !749, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !739, retainedNodes: !751)
!746 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!747 = !DINamespace(name: "{impl#0}", scope: !748)
!748 = !DINamespace(name: "index", scope: !335)
!749 = !DISubroutineType(types: !750)
!750 = !{!43, !43, !727, !729}
!751 = !{!752, !743}
!752 = !DILocalVariable(name: "self", scope: !744, file: !712, line: 252, type: !43, align: 8)
!753 = !DILocation(line: 252, column: 27, scope: !744, inlinedAt: !754)
!754 = !DILocation(line: 286, column: 9, scope: !723, inlinedAt: !742)
!755 = !DILocalVariable(name: "self", scope: !756, file: !712, line: 252, type: !727, align: 1)
!756 = !DILexicalBlockFile(scope: !757, file: !712, discriminator: 0)
!757 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hcbae90a2a5b48349E", scope: !758, file: !746, line: 432, type: !759, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !761)
!758 = !DINamespace(name: "{impl#6}", scope: !748)
!759 = !DISubroutineType(types: !760)
!760 = !{!43, !727, !43, !729}
!761 = !{!755, !762}
!762 = !DILocalVariable(name: "slice", scope: !756, file: !712, line: 252, type: !43, align: 8)
!763 = !DILocation(line: 252, column: 27, scope: !756, inlinedAt: !764)
!764 = !DILocation(line: 18, column: 9, scope: !745, inlinedAt: !754)
!765 = !DILocation(line: 252, column: 26, scope: !711)
!766 = !DILocation(line: 252, column: 9, scope: !711)
!767 = !DILocation(line: 253, column: 6, scope: !711)
!768 = distinct !DISubprogram(name: "fmt<i32, 5>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17ha134e43eb46d0b6bE", scope: !713, file: !712, line: 251, type: !769, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{!201, !56, !219}
!771 = !{!772, !773}
!772 = !DILocalVariable(name: "self", arg: 1, scope: !768, file: !712, line: 251, type: !56)
!773 = !DILocalVariable(name: "f", arg: 2, scope: !768, file: !712, line: 251, type: !219)
!774 = !DILocation(line: 251, column: 12, scope: !768)
!775 = !DILocation(line: 251, column: 19, scope: !768)
!776 = !DILocalVariable(name: "index", scope: !777, file: !712, line: 252, type: !727, align: 1)
!777 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 5>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17hc268db96f30cc1c2E", scope: !724, file: !712, line: 285, type: !778, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !739, retainedNodes: !780)
!778 = !DISubroutineType(types: !779)
!779 = !{!43, !56, !727, !729}
!780 = !{!781, !776}
!781 = !DILocalVariable(name: "self", scope: !777, file: !712, line: 252, type: !56, align: 8)
!782 = !DILocation(line: 252, column: 27, scope: !777, inlinedAt: !783)
!783 = !DILocation(line: 252, column: 27, scope: !768)
!784 = !DILocalVariable(name: "index", scope: !785, file: !712, line: 252, type: !727, align: 1)
!785 = !DILexicalBlockFile(scope: !786, file: !712, discriminator: 0)
!786 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hbd4a9ac6cab12fd8E", scope: !747, file: !746, line: 17, type: !749, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !739, retainedNodes: !787)
!787 = !{!788, !784}
!788 = !DILocalVariable(name: "self", scope: !785, file: !712, line: 252, type: !43, align: 8)
!789 = !DILocation(line: 252, column: 27, scope: !785, inlinedAt: !790)
!790 = !DILocation(line: 286, column: 9, scope: !777, inlinedAt: !783)
!791 = !DILocalVariable(name: "self", scope: !792, file: !712, line: 252, type: !727, align: 1)
!792 = !DILexicalBlockFile(scope: !793, file: !712, discriminator: 0)
!793 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hcbae90a2a5b48349E", scope: !758, file: !746, line: 432, type: !759, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !794)
!794 = !{!791, !795}
!795 = !DILocalVariable(name: "slice", scope: !792, file: !712, line: 252, type: !43, align: 8)
!796 = !DILocation(line: 252, column: 27, scope: !792, inlinedAt: !797)
!797 = !DILocation(line: 18, column: 9, scope: !786, inlinedAt: !790)
!798 = !DILocation(line: 252, column: 26, scope: !768)
!799 = !DILocation(line: 252, column: 9, scope: !768)
!800 = !DILocation(line: 253, column: 6, scope: !768)
!801 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 18>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h8c1e83dcdd9cf9edE", scope: !724, file: !712, line: 285, type: !802, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !739, retainedNodes: !808)
!802 = !DISubroutineType(types: !803)
!803 = !{!43, !804, !727, !729}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 18]", baseType: !805, size: 64, align: 64, dwarfAddressSpace: 0)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 576, align: 32, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 18, lowerBound: 0)
!808 = !{!809, !810}
!809 = !DILocalVariable(name: "self", arg: 1, scope: !801, file: !712, line: 285, type: !804)
!810 = !DILocalVariable(name: "index", arg: 2, scope: !801, file: !712, line: 285, type: !727)
!811 = !DILocation(line: 285, column: 14, scope: !801)
!812 = !DILocation(line: 285, column: 21, scope: !801)
!813 = !DILocation(line: 286, column: 22, scope: !801)
!814 = !DILocation(line: 286, column: 9, scope: !801)
!815 = !DILocation(line: 287, column: 6, scope: !801)
!816 = distinct !DISubprogram(name: "eq<i32, i32, 31>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17he9b9cd0af407f69eE", scope: !818, file: !817, line: 11, type: !820, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !368, retainedNodes: !822)
!817 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/equality.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b2a6ef978d2ec8f60a33a03ff9f5cb8")
!818 = !DINamespace(name: "{impl#0}", scope: !819)
!819 = !DINamespace(name: "equality", scope: !714)
!820 = !DISubroutineType(types: !821)
!821 = !{!364, !68, !68}
!822 = !{!823, !824}
!823 = !DILocalVariable(name: "self", arg: 1, scope: !816, file: !817, line: 11, type: !68)
!824 = !DILocalVariable(name: "other", arg: 2, scope: !816, file: !817, line: 11, type: !68)
!825 = !DILocation(line: 11, column: 11, scope: !816)
!826 = !DILocation(line: 11, column: 18, scope: !816)
!827 = !DILocation(line: 12, column: 9, scope: !816)
!828 = !DILocation(line: 13, column: 6, scope: !816)
!829 = distinct !DISubprogram(name: "eq<i32, i32, 5>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17hfbac44b8d19bfb2eE", scope: !818, file: !817, line: 11, type: !830, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !368, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!364, !56, !56}
!832 = !{!833, !834}
!833 = !DILocalVariable(name: "self", arg: 1, scope: !829, file: !817, line: 11, type: !56)
!834 = !DILocalVariable(name: "other", arg: 2, scope: !829, file: !817, line: 11, type: !56)
!835 = !DILocation(line: 11, column: 11, scope: !829)
!836 = !DILocation(line: 11, column: 18, scope: !829)
!837 = !DILocation(line: 12, column: 9, scope: !829)
!838 = !DILocation(line: 13, column: 6, scope: !829)
!839 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h9eb99fc6db42f33eE", scope: !334, file: !333, line: 506, type: !840, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !847)
!840 = !DISubroutineType(types: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i32]", file: !2, size: 128, align: 64, elements: !844, templateParams: !23, identifier: "e558f8cebf02444c46b3d01510c8747d")
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !843, file: !2, baseType: !46, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !843, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!847 = !{!848}
!848 = !DILocalVariable(name: "self", arg: 1, scope: !839, file: !333, line: 506, type: !843)
!849 = !DILocation(line: 506, column: 29, scope: !839)
!850 = !DILocation(line: 507, column: 9, scope: !839)
!851 = !DILocation(line: 508, column: 6, scope: !839)
!852 = distinct !DISubprogram(name: "eq<i32, i32>", linkageName: "_ZN4core5slice3cmp81_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u5d$$GT$$u20$for$u20$$u5b$A$u5d$$GT$2eq17hdc221ba69ac18796E", scope: !854, file: !853, line: 25, type: !856, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !368, retainedNodes: !858)
!853 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "d8ffa992b82fe6d1648610bb489e30e6")
!854 = !DINamespace(name: "{impl#0}", scope: !855)
!855 = !DINamespace(name: "cmp", scope: !335)
!856 = !DISubroutineType(types: !857)
!857 = !{!364, !43, !43}
!858 = !{!859, !860}
!859 = !DILocalVariable(name: "self", arg: 1, scope: !852, file: !853, line: 25, type: !43)
!860 = !DILocalVariable(name: "other", arg: 2, scope: !852, file: !853, line: 25, type: !43)
!861 = !DILocation(line: 25, column: 11, scope: !852)
!862 = !DILocation(line: 25, column: 18, scope: !852)
!863 = !DILocation(line: 26, column: 9, scope: !852)
!864 = !DILocation(line: 27, column: 6, scope: !852)
!865 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h5a8ae98aafd94c26E", scope: !338, file: !866, line: 88, type: !336, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !867)
!866 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "36678af40fdc22d7150f6f91e11271b3")
!867 = !{!868, !869, !871}
!868 = !DILocalVariable(name: "slice", arg: 1, scope: !865, file: !866, line: 88, type: !43)
!869 = !DILocalVariable(name: "ptr", scope: !870, file: !866, line: 89, type: !347, align: 8)
!870 = distinct !DILexicalBlock(scope: !865, file: !866, line: 89, column: 9)
!871 = !DILocalVariable(name: "end", scope: !872, file: !866, line: 94, type: !347, align: 8)
!872 = distinct !DILexicalBlock(scope: !870, file: !866, line: 94, column: 13)
!873 = !DILocation(line: 88, column: 23, scope: !865)
!874 = !DILocation(line: 94, column: 17, scope: !872)
!875 = !DILocalVariable(name: "metadata", scope: !876, file: !866, line: 92, type: !7, align: 1)
!876 = !DILexicalBlockFile(scope: !877, file: !866, discriminator: 0)
!877 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h0f39f8f607f67c02E", scope: !879, file: !878, line: 110, type: !880, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !884, retainedNodes: !882)
!878 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!879 = !DINamespace(name: "metadata", scope: !344)
!880 = !DISubroutineType(types: !881)
!881 = !{!140, !6, !7}
!882 = !{!883, !875}
!883 = !DILocalVariable(name: "data_address", scope: !876, file: !866, line: 92, type: !6, align: 8)
!884 = !{!885}
!885 = !DITemplateTypeParameter(name: "T", type: !85)
!886 = !DILocation(line: 92, column: 21, scope: !876, inlinedAt: !887)
!887 = !DILocation(line: 513, column: 5, scope: !888, inlinedAt: !891)
!888 = distinct !DISubprogram(name: "null<u8>", linkageName: "_ZN4core3ptr4null17h63ff5f7f3f9d99f7E", scope: !344, file: !618, line: 512, type: !889, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !884, retainedNodes: !23)
!889 = !DISubroutineType(types: !890)
!890 = !{!140}
!891 = !DILocation(line: 39, column: 43, scope: !892, inlinedAt: !898)
!892 = distinct !DISubprogram(name: "is_null<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h2ad91382e1d0477aE", scope: !687, file: !686, line: 36, type: !893, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !895)
!893 = !DISubroutineType(types: !894)
!894 = !{!364, !347}
!895 = !{!896}
!896 = !DILocalVariable(name: "self", scope: !897, file: !866, line: 92, type: !347, align: 8)
!897 = !DILexicalBlockFile(scope: !892, file: !866, discriminator: 0)
!898 = !DILocation(line: 92, column: 21, scope: !870)
!899 = !DILocation(line: 89, column: 19, scope: !865)
!900 = !DILocalVariable(name: "self", scope: !901, file: !866, line: 89, type: !43, align: 8)
!901 = !DILexicalBlockFile(scope: !902, file: !866, discriminator: 0)
!902 = distinct !DISubprogram(name: "as_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17h832dcaee4acb1ffbE", scope: !334, file: !333, line: 476, type: !903, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!347, !43}
!905 = !{!900}
!906 = !DILocation(line: 89, column: 19, scope: !901, inlinedAt: !899)
!907 = !DILocation(line: 89, column: 13, scope: !870)
!908 = !DILocation(line: 92, column: 21, scope: !897, inlinedAt: !898)
!909 = !DILocalVariable(name: "self", scope: !910, file: !866, line: 92, type: !140, align: 8)
!910 = !DILexicalBlockFile(scope: !911, file: !866, discriminator: 0)
!911 = distinct !DISubprogram(name: "guaranteed_eq<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13guaranteed_eq17hd04c9bd32a6fd8a6E", scope: !687, file: !686, line: 777, type: !912, scopeLine: 777, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !884, retainedNodes: !914)
!912 = !DISubroutineType(types: !913)
!913 = !{!364, !140, !140}
!914 = !{!909, !915}
!915 = !DILocalVariable(name: "other", scope: !910, file: !866, line: 92, type: !140, align: 8)
!916 = !DILocation(line: 92, column: 21, scope: !910, inlinedAt: !917)
!917 = !DILocation(line: 39, column: 9, scope: !892, inlinedAt: !898)
!918 = !DILocation(line: 92, column: 21, scope: !919, inlinedAt: !925)
!919 = !DILexicalBlockFile(scope: !920, file: !866, discriminator: 0)
!920 = distinct !DISubprogram(name: "invalid<()>", linkageName: "_ZN4core3ptr7invalid17h8b5db5be87c533d8E", scope: !344, file: !618, line: 538, type: !921, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !126, retainedNodes: !923)
!921 = !DISubroutineType(types: !922)
!922 = !{!6, !9}
!923 = !{!924}
!924 = !DILocalVariable(name: "addr", scope: !919, file: !866, line: 92, type: !9, align: 8)
!925 = !DILocation(line: 513, column: 20, scope: !888, inlinedAt: !891)
!926 = !DILocation(line: 92, column: 20, scope: !870)
!927 = !DILocation(line: 92, column: 13, scope: !870)
!928 = !DILocation(line: 94, column: 26, scope: !870)
!929 = !DILocation(line: 95, column: 17, scope: !870)
!930 = !DILocalVariable(name: "self", scope: !931, file: !866, line: 95, type: !140, align: 8)
!931 = !DILexicalBlockFile(scope: !932, file: !866, discriminator: 0)
!932 = distinct !DISubprogram(name: "wrapping_add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$12wrapping_add17h78cd2fbf0087babbE", scope: !687, file: !686, line: 1042, type: !933, scopeLine: 1042, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !884, retainedNodes: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{!140, !140, !9}
!935 = !{!930, !936}
!936 = !DILocalVariable(name: "count", scope: !931, file: !866, line: 95, type: !9, align: 8)
!937 = !DILocation(line: 95, column: 17, scope: !931, inlinedAt: !929)
!938 = !DILocation(line: 95, column: 49, scope: !870)
!939 = !DILocalVariable(name: "self", scope: !940, file: !866, line: 95, type: !140, align: 8)
!940 = !DILexicalBlockFile(scope: !941, file: !866, discriminator: 0)
!941 = distinct !DISubprogram(name: "wrapping_offset<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$15wrapping_offset17hb0c316a6c326e3d0E", scope: !687, file: !686, line: 536, type: !942, scopeLine: 536, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !884, retainedNodes: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{!140, !140, !138}
!944 = !{!939, !945}
!945 = !DILocalVariable(name: "count", scope: !940, file: !866, line: 95, type: !138, align: 8)
!946 = !DILocation(line: 95, column: 17, scope: !940, inlinedAt: !947)
!947 = !DILocation(line: 1046, column: 9, scope: !932, inlinedAt: !929)
!948 = !DILocation(line: 97, column: 17, scope: !870)
!949 = !DILocalVariable(name: "self", scope: !950, file: !866, line: 97, type: !347, align: 8)
!950 = !DILexicalBlockFile(scope: !951, file: !866, discriminator: 0)
!951 = distinct !DISubprogram(name: "add<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hc680fc99bd18ab4bE", scope: !687, file: !686, line: 871, type: !952, scopeLine: 871, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !954)
!952 = !DISubroutineType(types: !953)
!953 = !{!347, !347, !9}
!954 = !{!949, !955}
!955 = !DILocalVariable(name: "count", scope: !950, file: !866, line: 97, type: !9, align: 8)
!956 = !DILocation(line: 97, column: 17, scope: !950, inlinedAt: !948)
!957 = !DILocation(line: 97, column: 25, scope: !870)
!958 = !DILocalVariable(name: "self", scope: !959, file: !866, line: 97, type: !347, align: 8)
!959 = !DILexicalBlockFile(scope: !960, file: !866, discriminator: 0)
!960 = distinct !DISubprogram(name: "offset<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17hbbfef87276102d56E", scope: !687, file: !686, line: 453, type: !961, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !963)
!961 = !DISubroutineType(types: !962)
!962 = !{!347, !347, !138}
!963 = !{!958, !964}
!964 = !DILocalVariable(name: "count", scope: !959, file: !866, line: 97, type: !138, align: 8)
!965 = !DILocation(line: 97, column: 17, scope: !959, inlinedAt: !966)
!966 = !DILocation(line: 876, column: 18, scope: !951, inlinedAt: !948)
!967 = !DILocation(line: 94, column: 23, scope: !870)
!968 = !DILocation(line: 100, column: 48, scope: !872)
!969 = !DILocalVariable(name: "ptr", scope: !970, file: !866, line: 100, type: !842, align: 8)
!970 = !DILexicalBlockFile(scope: !971, file: !866, discriminator: 0)
!971 = distinct !DISubprogram(name: "new_unchecked<i32>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h6680d8cac53c3a9dE", scope: !342, file: !972, line: 196, type: !973, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !287, retainedNodes: !975)
!972 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "856acc92efd7925b83dd1e3c577ddbdc")
!973 = !DISubroutineType(types: !974)
!974 = !{!342, !842}
!975 = !{!969}
!976 = !DILocation(line: 100, column: 25, scope: !970, inlinedAt: !977)
!977 = !DILocation(line: 100, column: 25, scope: !872)
!978 = !DILocation(line: 100, column: 64, scope: !872)
!979 = !DILocation(line: 100, column: 13, scope: !872)
!980 = !DILocation(line: 102, column: 6, scope: !865)
!981 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hbd4a9ac6cab12fd8E", scope: !747, file: !746, line: 17, type: !749, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !739, retainedNodes: !982)
!982 = !{!983, !984}
!983 = !DILocalVariable(name: "self", arg: 1, scope: !981, file: !746, line: 17, type: !43)
!984 = !DILocalVariable(name: "index", arg: 2, scope: !981, file: !746, line: 17, type: !727)
!985 = !DILocation(line: 17, column: 14, scope: !981)
!986 = !DILocation(line: 17, column: 21, scope: !981)
!987 = !DILocation(line: 18, column: 9, scope: !981)
!988 = !DILocation(line: 19, column: 6, scope: !981)
!989 = distinct !DISubprogram(name: "expect<unsafe extern \22C\22 fn(i8, i32) -> i32>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h19997f26a84fe966E", scope: !991, file: !990, line: 735, type: !1007, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !997, retainedNodes: !1009)
!990 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "86a5483c3993f03690545387e943de77")
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(i8, i32) -> i32>", scope: !229, file: !2, size: 64, align: 64, elements: !992, templateParams: !23, identifier: "e6caa3eef052fdab8517d3105bbe9f2c")
!992 = !{!993}
!993 = !DICompositeType(tag: DW_TAG_variant_part, scope: !991, file: !2, size: 64, align: 64, elements: !994, templateParams: !23, identifier: "8ce0079eb765476a24ec40c7f1d5a44", discriminator: !1006)
!994 = !{!995, !1002}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !993, file: !2, baseType: !996, size: 64, align: 64, extraData: i64 0)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !991, file: !2, size: 64, align: 64, elements: !23, templateParams: !997, identifier: "74991995c162acfd5a87aa600e981e8d")
!997 = !{!998}
!998 = !DITemplateTypeParameter(name: "T", type: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(i8, i32) -> i32", baseType: !1000, size: 64, align: 64, dwarfAddressSpace: 0)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!33, !398, !33}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !993, file: !2, baseType: !1003, size: 64, align: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !991, file: !2, size: 64, align: 64, elements: !1004, templateParams: !997, identifier: "e83b8f63490cd931a11b5dcbaf53de68")
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1003, file: !2, baseType: !999, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, scope: !991, file: !2, baseType: !242, size: 64, align: 64, flags: DIFlagArtificial)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!999, !991, !472, !729}
!1009 = !{!1010, !1011, !1012}
!1010 = !DILocalVariable(name: "self", arg: 1, scope: !989, file: !990, line: 735, type: !991)
!1011 = !DILocalVariable(name: "msg", arg: 2, scope: !989, file: !990, line: 735, type: !472)
!1012 = !DILocalVariable(name: "val", scope: !1013, file: !990, line: 737, type: !999, align: 8)
!1013 = distinct !DILexicalBlock(scope: !989, file: !990, line: 737, column: 13)
!1014 = !DILocation(line: 735, column: 25, scope: !989)
!1015 = !DILocation(line: 735, column: 31, scope: !989)
!1016 = !DILocation(line: 736, column: 15, scope: !989)
!1017 = !DILocation(line: 736, column: 9, scope: !989)
!1018 = !DILocation(line: 738, column: 21, scope: !989)
!1019 = !DILocation(line: 737, column: 18, scope: !989)
!1020 = !DILocation(line: 737, column: 18, scope: !1013)
!1021 = !DILocation(line: 740, column: 6, scope: !989)
!1022 = distinct !DISubprogram(name: "expect<unsafe extern \22C\22 fn(i8, ...) -> i32>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h1d5e87e6d0d4ee89E", scope: !1023, file: !990, line: 735, type: !1037, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !1029, retainedNodes: !1039)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(i8, ...) -> i32>", scope: !229, file: !2, size: 64, align: 64, elements: !1024, templateParams: !23, identifier: "91f4dafae8317299c5129af64d591a16")
!1024 = !{!1025}
!1025 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1023, file: !2, size: 64, align: 64, elements: !1026, templateParams: !23, identifier: "dfc52bb1e0688dd5fe39af6ec3a4e64f", discriminator: !1036)
!1026 = !{!1027, !1032}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !1025, file: !2, baseType: !1028, size: 64, align: 64, extraData: i64 0)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !1023, file: !2, size: 64, align: 64, elements: !23, templateParams: !1029, identifier: "336c4835d3f1c02bb004a117c1b13")
!1029 = !{!1030}
!1030 = !DITemplateTypeParameter(name: "T", type: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(i8, ...) -> i32", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !1025, file: !2, baseType: !1033, size: 64, align: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !1023, file: !2, size: 64, align: 64, elements: !1034, templateParams: !1029, identifier: "943f75aa2794c8156bc14ba8f2c3a13")
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1033, file: !2, baseType: !1031, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, scope: !1023, file: !2, baseType: !242, size: 64, align: 64, flags: DIFlagArtificial)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1031, !1023, !472, !729}
!1039 = !{!1040, !1041, !1042}
!1040 = !DILocalVariable(name: "self", arg: 1, scope: !1022, file: !990, line: 735, type: !1023)
!1041 = !DILocalVariable(name: "msg", arg: 2, scope: !1022, file: !990, line: 735, type: !472)
!1042 = !DILocalVariable(name: "val", scope: !1043, file: !990, line: 737, type: !1031, align: 8)
!1043 = distinct !DILexicalBlock(scope: !1022, file: !990, line: 737, column: 13)
!1044 = !DILocation(line: 735, column: 25, scope: !1022)
!1045 = !DILocation(line: 735, column: 31, scope: !1022)
!1046 = !DILocation(line: 736, column: 15, scope: !1022)
!1047 = !DILocation(line: 736, column: 9, scope: !1022)
!1048 = !DILocation(line: 738, column: 21, scope: !1022)
!1049 = !DILocation(line: 737, column: 18, scope: !1022)
!1050 = !DILocation(line: 737, column: 18, scope: !1043)
!1051 = !DILocation(line: 740, column: 6, scope: !1022)
!1052 = distinct !DISubprogram(name: "expect<unsafe extern \22C\22 fn() -> i32>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h4bc449a0ade0070dE", scope: !1053, file: !990, line: 735, type: !1069, scopeLine: 735, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !77, templateParams: !1059, retainedNodes: !1071)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn() -> i32>", scope: !229, file: !2, size: 64, align: 64, elements: !1054, templateParams: !23, identifier: "eeb53efbf21581d63020b6e0ff8cdb0")
!1054 = !{!1055}
!1055 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1053, file: !2, size: 64, align: 64, elements: !1056, templateParams: !23, identifier: "f940ccca1fdfc5bad2c919babd7dfccf", discriminator: !1068)
!1056 = !{!1057, !1064}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !1055, file: !2, baseType: !1058, size: 64, align: 64, extraData: i64 0)
!1058 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !1053, file: !2, size: 64, align: 64, elements: !23, templateParams: !1059, identifier: "cdbef4ef5c358293ec43fda3cffe5b56")
!1059 = !{!1060}
!1060 = !DITemplateTypeParameter(name: "T", type: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn() -> i32", baseType: !1062, size: 64, align: 64, dwarfAddressSpace: 0)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!33}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !1055, file: !2, baseType: !1065, size: 64, align: 64)
