; ModuleID = '24gv3y10vt3ug10t'
source_filename = "24gv3y10vt3ug10t"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::ffi::c_str::CStr" = type { [0 x i8] }
%"core::ffi::VaListImpl" = type { i32, i32, i8*, i8*, %"core::marker::PhantomData<&mut &core::ffi::c_void>" }
%"core::marker::PhantomData<&mut &core::ffi::c_void>" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_varargs.rs:73:1: 79:2]" = type {}
%"[closure@src/test_noop.rs:22:1: 28:2]" = type {}
%"[closure@src/test_varargs.rs:41:1: 46:2]" = type {}
%"[closure@src/test_varargs.rs:83:1: 89:2]" = type {}
%"[closure@src/test_varargs.rs:51:1: 57:2]" = type {}
%"[closure@src/test_varargs.rs:103:1: 109:2]" = type {}
%"[closure@src/test_noop.rs:14:1: 19:2]" = type {}
%"[closure@src/test_functions.rs:9:1: 14:2]" = type {}
%"[closure@src/test_linking.rs:12:1: 28:2]" = type {}
%"[closure@src/test_fn_attrs.rs:4:1: 64:2]" = type {}
%"[closure@src/test_varargs.rs:62:1: 69:2]" = type {}
%"[closure@src/test_varargs.rs:93:1: 99:2]" = type {}
%"[closure@src/test_varargs.rs:113:1: 119:2]" = type {}
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "1b870bd9431ccc1d71adabe14fa4d734")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !33, file: !2, size: 256, align: 64, elements: !36, templateParams: !23, identifier: "f0b155880f0e8602fd0be3023df941a4")
!33 = !DINamespace(name: "c_str", scope: !34)
!34 = !DINamespace(name: "ffi", scope: !35)
!35 = !DINamespace(name: "alloc", scope: null)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !32, file: !2, baseType: !9, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !32, file: !2, baseType: !39, size: 192, align: 64, offset: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !40, file: !2, size: 192, align: 64, elements: !41, templateParams: !68, identifier: "f48a096c1ed19eb7ba15a7173429013")
!40 = !DINamespace(name: "vec", scope: !35)
!41 = !{!42, !70}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !2, baseType: !43, size: 128, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !44, file: !2, size: 128, align: 64, elements: !45, templateParams: !68, identifier: "d09dab1a097018b9dd4dad6f3ce84c27")
!44 = !DINamespace(name: "raw_vec", scope: !35)
!45 = !{!46, !64, !65}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, file: !2, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !48, file: !2, size: 64, align: 64, elements: !51, templateParams: !59, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!48 = !DINamespace(name: "unique", scope: !49)
!49 = !DINamespace(name: "ptr", scope: !50)
!50 = !DINamespace(name: "core", scope: null)
!51 = !{!52, !61}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !47, file: !2, baseType: !53, size: 64, align: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !54, file: !2, size: 64, align: 64, elements: !55, templateParams: !59, identifier: "3160283ea80cecf6149fff38a2e996de")
!54 = !DINamespace(name: "non_null", scope: !49)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !2, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "T", type: !58)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !47, file: !2, baseType: !62, align: 8)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !63, file: !2, align: 8, elements: !23, templateParams: !59, identifier: "e338a8151f1037c76eadd10ab3c53972")
!63 = !DINamespace(name: "marker", scope: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !43, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !43, file: !2, baseType: !66, align: 8)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !67, file: !2, align: 8, elements: !23, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!67 = !DINamespace(name: "alloc", scope: !35)
!68 = !{!60, !69}
!69 = !DITemplateTypeParameter(name: "A", type: !66)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "<&f64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !74, vtableHolder: !79, templateParams: !23, identifier: "6b62788b1bf0b7aff81411b24fc1f74")
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !73, file: !2, baseType: !6, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !73, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f64", baseType: !80, size: 64, align: 64, dwarfAddressSpace: 0)
!80 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !84, vtableHolder: !89, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !83, file: !2, baseType: !6, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !83, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "rust_mut", scope: !93, file: !95, line: 11, type: !90, isLocal: false, isDefinition: true, align: 32)
!93 = !DINamespace(name: "linking", scope: !94)
!94 = !DINamespace(name: "items_tests", scope: null)
!95 = !DIFile(filename: "src/linking.rs", directory: "/home/calvin/git/c2rust/tests/items", checksumkind: CSK_MD5, checksum: "380c05951a1a19cb4c2cf66283a31dda")
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "rust_y", scope: !93, file: !95, line: 13, type: !90, isLocal: false, isDefinition: true, align: 32)
!98 = !{i32 7, !"PIC Level", i32 2}
!99 = !{i32 7, !"PIE Level", i32 2}
!100 = !{i32 2, !"RtLibUseGOT", i32 1}
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !104, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !105, globals: !202)
!104 = !DIFile(filename: "src/lib.rs/@/24gv3y10vt3ug10t", directory: "/home/calvin/git/c2rust/tests/items")
!105 = !{!106, !115, !122, !127, !196}
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !107, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagEnumClass, elements: !110)
!107 = !DINamespace(name: "v1", scope: !108)
!108 = !DINamespace(name: "rt", scope: !109)
!109 = !DINamespace(name: "fmt", scope: !50)
!110 = !{!111, !112, !113, !114}
!111 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !116, file: !2, baseType: !117, size: 8, align: 8, flags: DIFlagEnumClass, elements: !118)
!116 = !DINamespace(name: "cmp", scope: !50)
!117 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "Less", value: 255)
!120 = !DIEnumerator(name: "Equal", value: 0)
!121 = !DIEnumerator(name: "Greater", value: 1)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !123, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagEnumClass, elements: !124)
!123 = !DINamespace(name: "ffi", scope: !50)
!124 = !{!125, !126}
!125 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !128, file: !2, baseType: !130, size: 64, align: 64, flags: DIFlagEnumClass, elements: !131)
!128 = !DINamespace(name: "valid_align", scope: !129)
!129 = !DINamespace(name: "mem", scope: !50)
!130 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!132 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !197, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagEnumClass, elements: !198)
!197 = !DINamespace(name: "panicking", scope: !50)
!198 = !{!199, !200, !201}
!199 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!200 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!201 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!202 = !{!0, !24, !71, !81, !91, !96}
!203 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..non_null..NonNull$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..unique..Unique$LT$T$GT$$GT$$GT$4from17hb17d977b9330e67cE", scope: !205, file: !204, line: 770, type: !206, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !59, retainedNodes: !208)
!204 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "856acc92efd7925b83dd1e3c577ddbdc")
!205 = !DINamespace(name: "{impl#16}", scope: !54)
!206 = !DISubroutineType(types: !207)
!207 = !{!53, !47}
!208 = !{!209}
!209 = !DILocalVariable(name: "unique", arg: 1, scope: !203, file: !204, line: 770, type: !47)
!210 = !DILocation(line: 770, column: 13, scope: !203)
!211 = !DILocation(line: 773, column: 41, scope: !203)
!212 = !DILocalVariable(name: "self", scope: !213, file: !204, line: 773, type: !47, align: 8)
!213 = !DILexicalBlockFile(scope: !214, file: !204, discriminator: 0)
!214 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17h5320855f8912af5eE", scope: !47, file: !215, line: 103, type: !216, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !59, retainedNodes: !219)
!215 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/unique.rs", directory: "", checksumkind: CSK_MD5, checksum: "acdefab5f14df6e5aef1141fd6b768c9")
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !47}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !{!212}
!220 = !DILocation(line: 773, column: 41, scope: !213, inlinedAt: !211)
!221 = !DILocalVariable(name: "self", scope: !222, file: !204, line: 773, type: !53, align: 8)
!222 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h8512f7527c176464E", scope: !53, file: !204, line: 330, type: !223, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !59, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!218, !53}
!225 = !{!221}
!226 = !DILocation(line: 773, column: 41, scope: !222, inlinedAt: !227)
!227 = !DILocation(line: 104, column: 9, scope: !214, inlinedAt: !211)
!228 = !DILocalVariable(name: "ptr", scope: !229, file: !204, line: 773, type: !218, align: 8)
!229 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h2b684da21c9d4e5cE", scope: !53, file: !204, line: 196, type: !230, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !59, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!53, !218}
!232 = !{!228}
!233 = !DILocation(line: 773, column: 18, scope: !229, inlinedAt: !234)
!234 = !DILocation(line: 773, column: 18, scope: !203)
!235 = !DILocation(line: 774, column: 6, scope: !203)
!236 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h3dcbdf874863fb13E", scope: !238, file: !237, line: 118, type: !240, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !246, retainedNodes: !242)
!237 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!238 = !DINamespace(name: "backtrace", scope: !239)
!239 = !DINamespace(name: "sys_common", scope: !17)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !20}
!242 = !{!243, !244}
!243 = !DILocalVariable(name: "f", arg: 1, scope: !236, file: !237, line: 118, type: !20)
!244 = !DILocalVariable(name: "result", scope: !245, file: !237, line: 122, type: !7, align: 1)
!245 = distinct !DILexicalBlock(scope: !236, file: !237, line: 122, column: 5)
!246 = !{!247, !248}
!247 = !DITemplateTypeParameter(name: "F", type: !20)
!248 = !DITemplateTypeParameter(name: "T", type: !7)
!249 = !DILocation(line: 122, column: 9, scope: !245)
!250 = !DILocation(line: 118, column: 43, scope: !236)
!251 = !DILocalVariable(name: "dummy", scope: !252, file: !237, line: 125, type: !7, align: 1)
!252 = !DILexicalBlockFile(scope: !253, file: !237, discriminator: 0)
!253 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17ha7760403761ef3a4E", scope: !255, file: !254, line: 225, type: !256, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !259, retainedNodes: !258)
!254 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!255 = !DINamespace(name: "hint", scope: !50)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !7}
!258 = !{!251}
!259 = !{!248}
!260 = !DILocation(line: 125, column: 5, scope: !252, inlinedAt: !261)
!261 = !DILocation(line: 125, column: 5, scope: !245)
!262 = !DILocation(line: 122, column: 18, scope: !236)
!263 = !{i32 3358776}
!264 = !DILocation(line: 128, column: 2, scope: !236)
!265 = !DILocation(line: 128, column: 1, scope: !236)
!266 = !DILocation(line: 118, column: 1, scope: !236)
!267 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h65989a39d4366ac2E", scope: !16, file: !268, line: 139, type: !269, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !259, retainedNodes: !273)
!268 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !20, !271, !272}
!271 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!273 = !{!274, !275, !276, !277}
!274 = !DILocalVariable(name: "main", arg: 1, scope: !267, file: !268, line: 140, type: !20)
!275 = !DILocalVariable(name: "argc", arg: 2, scope: !267, file: !268, line: 141, type: !271)
!276 = !DILocalVariable(name: "argv", arg: 3, scope: !267, file: !268, line: 142, type: !272)
!277 = !DILocalVariable(name: "v", scope: !278, file: !268, line: 144, type: !271, align: 8)
!278 = distinct !DILexicalBlock(scope: !267, file: !268, line: 144, column: 5)
!279 = !DILocation(line: 140, column: 5, scope: !267)
!280 = !DILocation(line: 141, column: 5, scope: !267)
!281 = !DILocation(line: 142, column: 5, scope: !267)
!282 = !DILocation(line: 145, column: 10, scope: !267)
!283 = !DILocation(line: 145, column: 9, scope: !267)
!284 = !DILocation(line: 144, column: 17, scope: !267)
!285 = !DILocation(line: 144, column: 12, scope: !267)
!286 = !DILocation(line: 144, column: 12, scope: !278)
!287 = !DILocation(line: 150, column: 2, scope: !267)
!288 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hd0fde3f377fa9f03E", scope: !15, file: !268, line: 145, type: !289, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !259, retainedNodes: !292)
!289 = !DISubroutineType(types: !290)
!290 = !{!90, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!292 = !{!293}
!293 = !DILocalVariable(name: "main", scope: !288, file: !268, line: 140, type: !20, align: 8)
!294 = !{i64 8}
!295 = !DILocation(line: 140, column: 5, scope: !288)
!296 = !DILocalVariable(name: "self", scope: !297, file: !268, line: 145, type: !300, align: 1)
!297 = !DILexicalBlockFile(scope: !298, file: !268, discriminator: 0)
!298 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h2f3d6db67a956e8cE", scope: !300, file: !299, line: 1808, type: !311, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !313)
!299 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !301, file: !2, size: 8, align: 8, elements: !302, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!301 = !DINamespace(name: "process", scope: !17)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !300, file: !2, baseType: !304, size: 8, align: 8)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !305, file: !2, size: 8, align: 8, elements: !309, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!305 = !DINamespace(name: "process_common", scope: !306)
!306 = !DINamespace(name: "process", scope: !307)
!307 = !DINamespace(name: "unix", scope: !308)
!308 = !DINamespace(name: "sys", scope: !17)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !304, file: !2, baseType: !58, size: 8, align: 8)
!311 = !DISubroutineType(types: !312)
!312 = !{!90, !300}
!313 = !{!296}
!314 = !DILocation(line: 145, column: 18, scope: !297, inlinedAt: !315)
!315 = !DILocation(line: 145, column: 18, scope: !288)
!316 = !DILocation(line: 145, column: 77, scope: !288)
!317 = !DILocalVariable(name: "self", scope: !318, file: !268, line: 145, type: !323, align: 8)
!318 = !DILexicalBlockFile(scope: !319, file: !268, discriminator: 0)
!319 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217hc13213167324334dE", scope: !304, file: !320, line: 485, type: !321, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !324)
!320 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!321 = !DISubroutineType(types: !322)
!322 = !{!90, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !304, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !{!317}
!325 = !DILocation(line: 145, column: 18, scope: !318, inlinedAt: !326)
!326 = !DILocation(line: 1809, column: 9, scope: !298, inlinedAt: !315)
!327 = !DILocation(line: 145, column: 17, scope: !288)
!328 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h4cc1ce3e266e3b6dE", scope: !330, file: !329, line: 2361, type: !331, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !389, retainedNodes: !386)
!329 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!330 = !DINamespace(name: "{impl#59}", scope: !109)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !350, !351}
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !334, file: !2, size: 8, align: 8, elements: !335, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!334 = !DINamespace(name: "result", scope: !50)
!335 = !{!336}
!336 = !DICompositeType(tag: DW_TAG_variant_part, scope: !333, file: !2, size: 8, align: 8, elements: !337, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !349)
!337 = !{!338, !345}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !336, file: !2, baseType: !339, size: 8, align: 8, extraData: i64 0)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !333, file: !2, size: 8, align: 8, elements: !340, templateParams: !342, identifier: "cea751326735c343faf647063a65ad14")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !339, file: !2, baseType: !7, align: 8, offset: 8)
!342 = !{!248, !343}
!343 = !DITemplateTypeParameter(name: "E", type: !344)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !109, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !336, file: !2, baseType: !346, size: 8, align: 8, extraData: i64 1)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !333, file: !2, size: 8, align: 8, elements: !347, templateParams: !342, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !346, file: !2, baseType: !344, align: 8, offset: 8)
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !333, file: !2, baseType: !58, size: 8, align: 8, flags: DIFlagArtificial)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !352, size: 64, align: 64, dwarfAddressSpace: 0)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !109, file: !2, size: 512, align: 64, elements: !353, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!353 = !{!354, !356, !358, !359, !374, !375}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !2, baseType: !355, size: 32, align: 32, offset: 384)
!355 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !352, file: !2, baseType: !357, size: 32, align: 32, offset: 416)
!357 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !352, file: !2, baseType: !106, size: 8, align: 8, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !352, file: !2, baseType: !360, size: 128, align: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !361, file: !2, size: 128, align: 64, elements: !362, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!361 = !DINamespace(name: "option", scope: !50)
!362 = !{!363}
!363 = !DICompositeType(tag: DW_TAG_variant_part, scope: !360, file: !2, size: 128, align: 64, elements: !364, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !373)
!364 = !{!365, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !363, file: !2, baseType: !366, size: 128, align: 64, extraData: i64 0)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !360, file: !2, size: 128, align: 64, elements: !23, templateParams: !367, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "T", type: !9)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !363, file: !2, baseType: !370, size: 128, align: 64, extraData: i64 1)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !360, file: !2, size: 128, align: 64, elements: !371, templateParams: !367, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !370, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !360, file: !2, baseType: !130, size: 64, align: 64, flags: DIFlagArtificial)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !352, file: !2, baseType: !360, size: 128, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !352, file: !2, baseType: !376, size: 128, align: 64, offset: 256)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !377, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!377 = !{!378, !381}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !376, file: !2, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64, dwarfAddressSpace: 0)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !376, file: !2, baseType: !382, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !383, size: 64, align: 64, dwarfAddressSpace: 0)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 3, lowerBound: 0)
!386 = !{!387, !388}
!387 = !DILocalVariable(name: "self", arg: 1, scope: !328, file: !329, line: 2361, type: !350)
!388 = !DILocalVariable(name: "f", arg: 2, scope: !328, file: !329, line: 2361, type: !351)
!389 = !{!390}
!390 = !DITemplateTypeParameter(name: "T", type: !90)
!391 = !DILocation(line: 2361, column: 20, scope: !328)
!392 = !DILocation(line: 2361, column: 27, scope: !328)
!393 = !DILocation(line: 2361, column: 71, scope: !328)
!394 = !{i64 4}
!395 = !DILocation(line: 2361, column: 62, scope: !328)
!396 = !DILocation(line: 2361, column: 84, scope: !328)
!397 = distinct !DISubprogram(name: "fmt<f64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h9be428947809936eE", scope: !330, file: !329, line: 2361, type: !398, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !404, retainedNodes: !401)
!398 = !DISubroutineType(types: !399)
!399 = !{!333, !400, !351}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f64", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !{!402, !403}
!402 = !DILocalVariable(name: "self", arg: 1, scope: !397, file: !329, line: 2361, type: !400)
!403 = !DILocalVariable(name: "f", arg: 2, scope: !397, file: !329, line: 2361, type: !351)
!404 = !{!405}
!405 = !DITemplateTypeParameter(name: "T", type: !80)
!406 = !DILocation(line: 2361, column: 20, scope: !397)
!407 = !DILocation(line: 2361, column: 27, scope: !397)
!408 = !DILocation(line: 2361, column: 71, scope: !397)
!409 = !DILocation(line: 2361, column: 62, scope: !397)
!410 = !DILocation(line: 2361, column: 84, scope: !397)
!411 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN49_$LT$usize$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17h225f3d09039f53a3E", scope: !413, file: !412, line: 189, type: !416, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !418)
!412 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "a5e6372fb466d62a237d46ecffb4676a")
!413 = !DINamespace(name: "{impl#37}", scope: !414)
!414 = !DINamespace(name: "range", scope: !415)
!415 = !DINamespace(name: "iter", scope: !50)
!416 = !DISubroutineType(types: !417)
!417 = !{!9, !9, !9}
!418 = !{!419, !420}
!419 = !DILocalVariable(name: "start", arg: 1, scope: !411, file: !412, line: 189, type: !9)
!420 = !DILocalVariable(name: "n", arg: 2, scope: !411, file: !412, line: 189, type: !9)
!421 = !DILocation(line: 189, column: 37, scope: !411)
!422 = !DILocation(line: 189, column: 50, scope: !411)
!423 = !DILocation(line: 191, column: 22, scope: !411)
!424 = !DILocalVariable(name: "self", scope: !425, file: !412, line: 191, type: !9, align: 8)
!425 = !DILexicalBlockFile(scope: !426, file: !412, discriminator: 0)
!426 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$13unchecked_add17h248c853f68583999E", scope: !428, file: !427, line: 463, type: !416, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !430)
!427 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "510cfe98475d713af9de72a29146058c")
!428 = !DINamespace(name: "{impl#11}", scope: !429)
!429 = !DINamespace(name: "num", scope: !50)
!430 = !{!424, !431}
!431 = !DILocalVariable(name: "rhs", scope: !425, file: !412, line: 191, type: !9, align: 8)
!432 = !DILocation(line: 191, column: 22, scope: !425, inlinedAt: !423)
!433 = !DILocation(line: 191, column: 42, scope: !411)
!434 = !DILocation(line: 192, column: 10, scope: !411)
!435 = distinct !DISubprogram(name: "backward_unchecked", linkageName: "_ZN49_$LT$usize$u20$as$u20$core..iter..range..Step$GT$18backward_unchecked17h5d3b8e6580969331E", scope: !413, file: !412, line: 195, type: !416, scopeLine: 195, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !436)
!436 = !{!437, !438}
!437 = !DILocalVariable(name: "start", arg: 1, scope: !435, file: !412, line: 195, type: !9)
!438 = !DILocalVariable(name: "n", arg: 2, scope: !435, file: !412, line: 195, type: !9)
!439 = !DILocation(line: 195, column: 38, scope: !435)
!440 = !DILocation(line: 195, column: 51, scope: !435)
!441 = !DILocation(line: 197, column: 22, scope: !435)
!442 = !DILocalVariable(name: "self", scope: !443, file: !412, line: 197, type: !9, align: 8)
!443 = !DILexicalBlockFile(scope: !444, file: !412, discriminator: 0)
!444 = distinct !DISubprogram(name: "unchecked_sub", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$13unchecked_sub17hb344cc35ba2c7b8eE", scope: !428, file: !427, line: 533, type: !416, scopeLine: 533, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !445)
!445 = !{!442, !446}
!446 = !DILocalVariable(name: "rhs", scope: !443, file: !412, line: 197, type: !9, align: 8)
!447 = !DILocation(line: 197, column: 22, scope: !443, inlinedAt: !441)
!448 = !DILocation(line: 197, column: 42, scope: !435)
!449 = !DILocation(line: 198, column: 10, scope: !435)
!450 = distinct !DISubprogram(name: "const_eval_select<(&[u8]), fn(&[u8]) -> &core::ffi::c_str::CStr, fn(&[u8]) -> &core::ffi::c_str::CStr, &core::ffi::c_str::CStr>", linkageName: "_ZN4core10intrinsics17const_eval_select17h168407bbf0f28c3dE", scope: !452, file: !451, line: 2687, type: !453, scopeLine: 2687, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !479, retainedNodes: !475)
!451 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "f96ba730d7cf23ae45fdc72e7caf5f1b")
!452 = !DINamespace(name: "intrinsics", scope: !50)
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !464, !472, !472}
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "&core::ffi::c_str::CStr", file: !2, size: 128, align: 64, elements: !456, templateParams: !23, identifier: "9a691f075a9e4b9c7e7049abca5ed1fb")
!456 = !{!457, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !455, file: !2, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !460, file: !2, align: 8, elements: !461, templateParams: !23, identifier: "2da013c6b133655882cf6258a2093276")
!460 = !DINamespace(name: "c_str", scope: !123)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !459, file: !2, baseType: !117, align: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !455, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&[u8])", file: !2, size: 128, align: 64, elements: !465, templateParams: !23, identifier: "65821ee449d7484056bb2ad385d752b8")
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !464, file: !2, baseType: !467, size: 128, align: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !468, templateParams: !23, identifier: "7d49e60d2ca720f66806f7375f860e2")
!468 = !{!469, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !467, file: !2, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !467, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&[u8]) -> &core::ffi::c_str::CStr", baseType: !473, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!455, !467}
!475 = !{!476, !477, !478}
!476 = !DILocalVariable(name: "arg", arg: 1, scope: !450, file: !451, line: 2688, type: !464)
!477 = !DILocalVariable(name: "_called_in_const", arg: 2, scope: !450, file: !451, line: 2689, type: !472)
!478 = !DILocalVariable(name: "called_at_rt", arg: 3, scope: !450, file: !451, line: 2690, type: !472)
!479 = !{!480, !481, !482, !483}
!480 = !DITemplateTypeParameter(name: "ARG", type: !464)
!481 = !DITemplateTypeParameter(name: "F", type: !472)
!482 = !DITemplateTypeParameter(name: "G", type: !472)
!483 = !DITemplateTypeParameter(name: "RET", type: !455)
!484 = !DILocation(line: 2688, column: 5, scope: !450)
!485 = !DILocation(line: 2689, column: 5, scope: !450)
!486 = !DILocation(line: 2690, column: 5, scope: !450)
!487 = !DILocation(line: 2696, column: 5, scope: !450)
!488 = !DILocation(line: 2697, column: 1, scope: !450)
!489 = !DILocation(line: 2687, column: 1, scope: !450)
!490 = !DILocation(line: 2697, column: 2, scope: !450)
!491 = distinct !DISubprogram(name: "max<usize>", linkageName: "_ZN4core3cmp3Ord3max17heb94650d3533541dE", scope: !493, file: !492, line: 800, type: !416, scopeLine: 800, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !497, retainedNodes: !494)
!492 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!493 = !DINamespace(name: "Ord", scope: !116)
!494 = !{!495, !496}
!495 = !DILocalVariable(name: "self", arg: 1, scope: !491, file: !492, line: 800, type: !9)
!496 = !DILocalVariable(name: "other", arg: 2, scope: !491, file: !492, line: 800, type: !9)
!497 = !{!498}
!498 = !DITemplateTypeParameter(name: "Self", type: !9)
!499 = !DILocation(line: 800, column: 12, scope: !491)
!500 = !DILocation(line: 800, column: 18, scope: !491)
!501 = !DILocation(line: 808, column: 15, scope: !491)
!502 = !{i8 -1, i8 2}
!503 = !DILocation(line: 812, column: 5, scope: !491)
!504 = !DILocation(line: 808, column: 9, scope: !491)
!505 = !{i8 0, i8 2}
!506 = !DILocation(line: 809, column: 49, scope: !491)
!507 = !DILocation(line: 810, column: 34, scope: !491)
!508 = !DILocation(line: 800, column: 5, scope: !491)
!509 = !DILocation(line: 812, column: 6, scope: !491)
!510 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls50_$LT$impl$u20$core..cmp..Ord$u20$for$u20$usize$GT$3cmp17hb3f07e57d892c0cbE", scope: !511, file: !492, line: 1436, type: !513, scopeLine: 1436, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !516)
!511 = !DINamespace(name: "{impl#55}", scope: !512)
!512 = !DINamespace(name: "impls", scope: !116)
!513 = !DISubroutineType(types: !514)
!514 = !{!115, !515, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!516 = !{!517, !518}
!517 = !DILocalVariable(name: "self", arg: 1, scope: !510, file: !492, line: 1436, type: !515)
!518 = !DILocalVariable(name: "other", arg: 2, scope: !510, file: !492, line: 1436, type: !515)
!519 = !DILocation(line: 1436, column: 24, scope: !510)
!520 = !DILocation(line: 1436, column: 31, scope: !510)
!521 = !DILocation(line: 1439, column: 24, scope: !510)
!522 = !DILocation(line: 1439, column: 32, scope: !510)
!523 = !DILocation(line: 1440, column: 29, scope: !510)
!524 = !DILocation(line: 1440, column: 38, scope: !510)
!525 = !DILocation(line: 1439, column: 41, scope: !510)
!526 = !DILocation(line: 1439, column: 21, scope: !510)
!527 = !DILocation(line: 1442, column: 18, scope: !510)
!528 = !DILocation(line: 1441, column: 28, scope: !510)
!529 = !DILocation(line: 1440, column: 26, scope: !510)
!530 = !DILocation(line: 1440, column: 47, scope: !510)
!531 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls57_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$usize$GT$2lt17h36ac290b4ba6899eE", scope: !532, file: !492, line: 1423, type: !533, scopeLine: 1423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !536)
!532 = !DINamespace(name: "{impl#54}", scope: !512)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !515, !515}
!535 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!536 = !{!537, !538}
!537 = !DILocalVariable(name: "self", arg: 1, scope: !531, file: !492, line: 1423, type: !515)
!538 = !DILocalVariable(name: "other", arg: 2, scope: !531, file: !492, line: 1423, type: !515)
!539 = !DILocation(line: 1423, column: 23, scope: !531)
!540 = !DILocation(line: 1423, column: 30, scope: !531)
!541 = !DILocation(line: 1423, column: 52, scope: !531)
!542 = !DILocation(line: 1423, column: 62, scope: !531)
!543 = !DILocation(line: 1423, column: 72, scope: !531)
!544 = distinct !DISubprogram(name: "as_va_list", linkageName: "_ZN4core3ffi10VaListImpl10as_va_list17h002e33e9454b942dE", scope: !546, file: !545, line: 417, type: !559, scopeLine: 417, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !569)
!545 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ffi/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "042bf4c6210bbea7946ffc45f3c5e379")
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "VaListImpl", scope: !123, file: !2, size: 192, align: 64, elements: !547, templateParams: !23, identifier: "59481d630e596d9a79497278542848a7")
!547 = !{!548, !549, !550, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !546, file: !2, baseType: !90, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !546, file: !2, baseType: !90, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !546, file: !2, baseType: !551, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !122, size: 64, align: 64, dwarfAddressSpace: 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !546, file: !2, baseType: !551, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !546, file: !2, baseType: !554, align: 8, offset: 192)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut &core::ffi::c_void>", scope: !63, file: !2, align: 8, elements: !23, templateParams: !555, identifier: "6defb32c455b0e6e35dcf92c27d8d2be")
!555 = !{!556}
!556 = !DITemplateTypeParameter(name: "T", type: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &core::ffi::c_void", baseType: !558, size: 64, align: 64, dwarfAddressSpace: 0)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ffi::c_void", baseType: !122, size: 64, align: 64, dwarfAddressSpace: 0)
!559 = !DISubroutineType(types: !560)
!560 = !{!561, !564}
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "VaList", scope: !123, file: !2, size: 64, align: 64, elements: !562, templateParams: !23, identifier: "6e6594fcf21c75184ec73a5dbe1c4b87")
!562 = !{!563, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !561, file: !2, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ffi::VaListImpl", baseType: !546, size: 64, align: 64, dwarfAddressSpace: 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !561, file: !2, baseType: !566, align: 8)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut core::ffi::VaListImpl>", scope: !63, file: !2, align: 8, elements: !23, templateParams: !567, identifier: "b5623cd03dccb927dfadefb6df041441")
!567 = !{!568}
!568 = !DITemplateTypeParameter(name: "T", type: !564)
!569 = !{!570}
!570 = !DILocalVariable(name: "self", arg: 1, scope: !544, file: !545, line: 417, type: !564)
!571 = !DILocation(line: 417, column: 27, scope: !544)
!572 = !DILocation(line: 418, column: 9, scope: !544)
!573 = !DILocation(line: 419, column: 6, scope: !544)
!574 = distinct !DISubprogram(name: "arg<i32>", linkageName: "_ZN4core3ffi10VaListImpl3arg17h346cf3d2ff706f30E", scope: !546, file: !545, line: 510, type: !575, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !389, retainedNodes: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{!90, !564}
!577 = !{!578}
!578 = !DILocalVariable(name: "self", arg: 1, scope: !574, file: !545, line: 510, type: !564)
!579 = !DILocation(line: 510, column: 51, scope: !574)
!580 = !DILocation(line: 512, column: 18, scope: !574)
!581 = !DILocation(line: 513, column: 6, scope: !574)
!582 = distinct !DISubprogram(name: "arg<f64>", linkageName: "_ZN4core3ffi10VaListImpl3arg17h527596819821ca88E", scope: !546, file: !545, line: 510, type: !583, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !404, retainedNodes: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!80, !564}
!585 = !{!586}
!586 = !DILocalVariable(name: "self", arg: 1, scope: !582, file: !545, line: 510, type: !564)
!587 = !DILocation(line: 510, column: 51, scope: !582)
!588 = !DILocation(line: 512, column: 18, scope: !582)
!589 = !DILocation(line: 513, column: 6, scope: !582)
!590 = distinct !DISubprogram(name: "arg<*mut i8>", linkageName: "_ZN4core3ffi10VaListImpl3arg17hf947328bb00d6431E", scope: !546, file: !545, line: 510, type: !591, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !596, retainedNodes: !594)
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !564}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!594 = !{!595}
!595 = !DILocalVariable(name: "self", arg: 1, scope: !590, file: !545, line: 510, type: !564)
!596 = !{!597}
!597 = !DITemplateTypeParameter(name: "T", type: !593)
!598 = !DILocation(line: 510, column: 51, scope: !590)
!599 = !DILocation(line: 512, column: 18, scope: !590)
!600 = !DILocation(line: 513, column: 6, scope: !590)
!601 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3ffi5c_str4CStr6as_ptr17h8ee0d6d5d74d8703E", scope: !459, file: !602, line: 475, type: !603, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !606)
!602 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ffi/c_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "a50c941e663797b3cd132afeffc32d87")
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !455}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!606 = !{!607}
!607 = !DILocalVariable(name: "self", arg: 1, scope: !601, file: !602, line: 475, type: !455)
!608 = !DILocation(line: 475, column: 25, scope: !601)
!609 = !DILocation(line: 476, column: 9, scope: !601)
!610 = !DILocalVariable(name: "self", scope: !611, file: !602, line: 476, type: !618, align: 8)
!611 = !DILexicalBlockFile(scope: !612, file: !602, discriminator: 0)
!612 = distinct !DISubprogram(name: "as_ptr<i8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17h0e41b38e6c263ba8E", scope: !614, file: !613, line: 476, type: !616, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !624, retainedNodes: !623)
!613 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!614 = !DINamespace(name: "{impl#0}", scope: !615)
!615 = !DINamespace(name: "slice", scope: !50)
!616 = !DISubroutineType(types: !617)
!617 = !{!605, !618}
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i8]", file: !2, size: 128, align: 64, elements: !619, templateParams: !23, identifier: "cc2ad320ed202ac3c13bb57e7e44d101")
!619 = !{!620, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !618, file: !2, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !618, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!623 = !{!610}
!624 = !{!625}
!625 = !DITemplateTypeParameter(name: "T", type: !117)
!626 = !DILocation(line: 476, column: 9, scope: !611, inlinedAt: !609)
!627 = !DILocation(line: 477, column: 6, scope: !601)
!628 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hcddc92d572cb5de9E", scope: !630, file: !629, line: 185, type: !632, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !634)
!629 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!630 = !DINamespace(name: "{impl#80}", scope: !631)
!631 = !DINamespace(name: "num", scope: !109)
!632 = !DISubroutineType(types: !633)
!633 = !{!333, !89, !351}
!634 = !{!635, !636}
!635 = !DILocalVariable(name: "self", arg: 1, scope: !628, file: !629, line: 185, type: !89)
!636 = !DILocalVariable(name: "f", arg: 2, scope: !628, file: !629, line: 185, type: !351)
!637 = !DILocation(line: 185, column: 20, scope: !628)
!638 = !DILocation(line: 185, column: 27, scope: !628)
!639 = !DILocation(line: 186, column: 20, scope: !628)
!640 = !DILocation(line: 188, column: 27, scope: !628)
!641 = !DILocation(line: 187, column: 21, scope: !628)
!642 = !DILocation(line: 186, column: 17, scope: !628)
!643 = !DILocation(line: 193, column: 14, scope: !628)
!644 = !DILocation(line: 191, column: 21, scope: !628)
!645 = !DILocation(line: 189, column: 21, scope: !628)
!646 = !DILocation(line: 188, column: 24, scope: !628)
!647 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h1abf688bf72f1613E", scope: !648, file: !329, line: 390, type: !721, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !723)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !109, file: !2, size: 384, align: 64, elements: !649, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!649 = !{!650, !660, !705}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !648, file: !2, baseType: !651, size: 128, align: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !652, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!652 = !{!653, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !651, file: !2, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64, dwarfAddressSpace: 0)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !656, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !655, file: !2, baseType: !470, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !655, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !648, file: !2, baseType: !661, size: 128, align: 64, offset: 128)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !361, file: !2, size: 128, align: 64, elements: !662, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!662 = !{!663}
!663 = !DICompositeType(tag: DW_TAG_variant_part, scope: !661, file: !2, size: 128, align: 64, elements: !664, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !704)
!664 = !{!665, !700}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !663, file: !2, baseType: !666, size: 128, align: 64, extraData: i64 0)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !661, file: !2, size: 128, align: 64, elements: !23, templateParams: !667, identifier: "742dbe7e160661d8ca36fcfff2574850")
!667 = !{!668}
!668 = !DITemplateTypeParameter(name: "T", type: !669)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !670, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!670 = !{!671, !699}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !669, file: !2, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !107, file: !2, size: 448, align: 64, elements: !674, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !673, file: !2, baseType: !9, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !673, file: !2, baseType: !677, size: 384, align: 64, offset: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !107, file: !2, size: 384, align: 64, elements: !678, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!678 = !{!679, !680, !681, !682, !698}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !677, file: !2, baseType: !357, size: 32, align: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !677, file: !2, baseType: !106, size: 8, align: 8, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !2, baseType: !355, size: 32, align: 32, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !677, file: !2, baseType: !683, size: 128, align: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !107, file: !2, size: 128, align: 64, elements: !684, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!684 = !{!685}
!685 = !DICompositeType(tag: DW_TAG_variant_part, scope: !683, file: !2, size: 128, align: 64, elements: !686, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !697)
!686 = !{!687, !691, !695}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !685, file: !2, baseType: !688, size: 128, align: 64, extraData: i64 0)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !683, file: !2, size: 128, align: 64, elements: !689, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !688, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !685, file: !2, baseType: !692, size: 128, align: 64, extraData: i64 1)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !683, file: !2, size: 128, align: 64, elements: !693, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !692, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !685, file: !2, baseType: !696, size: 128, align: 64, extraData: i64 2)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !683, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!697 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !2, baseType: !130, size: 64, align: 64, flags: DIFlagArtificial)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !677, file: !2, baseType: !683, size: 128, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !669, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !663, file: !2, baseType: !701, size: 128, align: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !661, file: !2, size: 128, align: 64, elements: !702, templateParams: !667, identifier: "17f2fc106094349c7673abca4839c97a")
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !701, file: !2, baseType: !669, size: 128, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !2, baseType: !130, size: 64, align: 64, flags: DIFlagArtificial)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !648, file: !2, baseType: !706, size: 128, align: 64, offset: 256)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !707, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!707 = !{!708, !720}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !706, file: !2, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64, dwarfAddressSpace: 0)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !109, file: !2, size: 128, align: 64, elements: !711, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!711 = !{!712, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !710, file: !2, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !714, size: 64, align: 64, dwarfAddressSpace: 0)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !715, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!715 = !DINamespace(name: "{extern#0}", scope: !109)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !710, file: !2, baseType: !717, size: 64, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !718, size: 64, align: 64, dwarfAddressSpace: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{!333, !713, !351}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !706, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!648, !651, !706}
!723 = !{!724, !725}
!724 = !DILocalVariable(name: "pieces", arg: 1, scope: !647, file: !329, line: 390, type: !651)
!725 = !DILocalVariable(name: "args", arg: 2, scope: !647, file: !329, line: 390, type: !706)
!726 = !DILocation(line: 390, column: 25, scope: !647)
!727 = !DILocation(line: 390, column: 53, scope: !647)
!728 = !DILocation(line: 391, column: 12, scope: !647)
!729 = !DILocation(line: 391, column: 56, scope: !647)
!730 = !DILocation(line: 391, column: 41, scope: !647)
!731 = !DILocation(line: 394, column: 34, scope: !647)
!732 = !DILocation(line: 394, column: 9, scope: !647)
!733 = !DILocation(line: 395, column: 6, scope: !647)
!734 = !DILocation(line: 392, column: 13, scope: !647)
!735 = distinct !DISubprogram(name: "replace<usize>", linkageName: "_ZN4core3mem7replace17ha68ea4317dd069c4E", scope: !129, file: !736, line: 913, type: !737, scopeLine: 913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !740)
!736 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "27c8869548c9dcb65186c5584c2586f6")
!737 = !DISubroutineType(types: !738)
!738 = !{!9, !739, !9}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!740 = !{!741, !742, !743}
!741 = !DILocalVariable(name: "dest", arg: 1, scope: !735, file: !736, line: 913, type: !739)
!742 = !DILocalVariable(name: "src", arg: 2, scope: !735, file: !736, line: 913, type: !9)
!743 = !DILocalVariable(name: "result", scope: !744, file: !736, line: 918, type: !9, align: 8)
!744 = distinct !DILexicalBlock(scope: !735, file: !736, line: 918, column: 9)
!745 = !DILocation(line: 913, column: 25, scope: !735)
!746 = !DILocation(line: 913, column: 39, scope: !735)
!747 = !DILocalVariable(name: "src", scope: !748, file: !736, line: 919, type: !9, align: 8)
!748 = !DILexicalBlockFile(scope: !749, file: !736, discriminator: 0)
!749 = distinct !DISubprogram(name: "write<usize>", linkageName: "_ZN4core3ptr5write17hccfee852a2f0d924E", scope: !49, file: !750, line: 1296, type: !751, scopeLine: 1296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !754)
!750 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!751 = !DISubroutineType(types: !752)
!752 = !{null, !753, !9}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!754 = !{!755, !747}
!755 = !DILocalVariable(name: "dst", scope: !748, file: !736, line: 919, type: !753, align: 8)
!756 = !DILocation(line: 919, column: 9, scope: !748, inlinedAt: !757)
!757 = !DILocation(line: 919, column: 9, scope: !744)
!758 = !DILocalVariable(name: "tmp", scope: !759, file: !736, line: 918, type: !768, align: 8)
!759 = !DILexicalBlockFile(scope: !760, file: !736, discriminator: 0)
!760 = distinct !DILexicalBlock(scope: !761, file: !750, line: 1107, column: 5)
!761 = distinct !DISubprogram(name: "read<usize>", linkageName: "_ZN4core3ptr4read17h372d95e2696bb010E", scope: !49, file: !750, line: 1099, type: !762, scopeLine: 1099, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !765)
!762 = !DISubroutineType(types: !763)
!763 = !{!9, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!765 = !{!766, !758}
!766 = !DILocalVariable(name: "src", scope: !767, file: !736, line: 918, type: !764, align: 8)
!767 = !DILexicalBlockFile(scope: !761, file: !736, discriminator: 0)
!768 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<usize>", scope: !769, file: !2, size: 64, align: 64, elements: !770, templateParams: !367, identifier: "d5eca075936c223cc2b20ecedd1e4e46")
!769 = !DINamespace(name: "maybe_uninit", scope: !129)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !768, file: !2, baseType: !7, align: 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !768, file: !2, baseType: !773, size: 64, align: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<usize>", scope: !774, file: !2, size: 64, align: 64, elements: !775, templateParams: !367, identifier: "446cb116741bbe0e5138064f6b058dad")
!774 = !DINamespace(name: "manually_drop", scope: !129)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !773, file: !2, baseType: !9, size: 64, align: 64)
!777 = !DILocation(line: 918, column: 22, scope: !759, inlinedAt: !778)
!778 = !DILocation(line: 918, column: 22, scope: !735)
!779 = !DILocation(line: 918, column: 32, scope: !735)
!780 = !DILocation(line: 918, column: 22, scope: !767, inlinedAt: !778)
!781 = !DILocation(line: 918, column: 22, scope: !782, inlinedAt: !787)
!782 = !DILexicalBlockFile(scope: !783, file: !736, discriminator: 0)
!783 = distinct !DISubprogram(name: "uninit<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$6uninit17h9b97dd79ba95e5fcE", scope: !768, file: !784, line: 320, type: !785, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !23)
!784 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "d75c93d9a93fe65ef19edc0e8e272278")
!785 = !DISubroutineType(types: !786)
!786 = !{!768}
!787 = !DILocation(line: 1107, column: 19, scope: !761, inlinedAt: !778)
!788 = !DILocalVariable(name: "self", scope: !789, file: !736, line: 918, type: !793, align: 8)
!789 = !DILexicalBlockFile(scope: !790, file: !736, discriminator: 0)
!790 = distinct !DISubprogram(name: "as_mut_ptr<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17h17addc3a28a88ddaE", scope: !768, file: !784, line: 574, type: !791, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !794)
!791 = !DISubroutineType(types: !792)
!792 = !{!753, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<usize>", baseType: !768, size: 64, align: 64, dwarfAddressSpace: 0)
!794 = !{!788}
!795 = !DILocation(line: 918, column: 22, scope: !789, inlinedAt: !796)
!796 = !DILocation(line: 1115, column: 34, scope: !760, inlinedAt: !778)
!797 = !DILocalVariable(name: "self", scope: !798, file: !736, line: 918, type: !768, align: 8)
!798 = !DILexicalBlockFile(scope: !799, file: !736, discriminator: 0)
!799 = distinct !DISubprogram(name: "assume_init<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$11assume_init17h2170458c85112e1fE", scope: !768, file: !784, line: 629, type: !800, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !810)
!800 = !DISubroutineType(types: !801)
!801 = !{!9, !768, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !803, size: 64, align: 64, dwarfAddressSpace: 0)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !804, file: !2, size: 192, align: 64, elements: !806, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!804 = !DINamespace(name: "location", scope: !805)
!805 = !DINamespace(name: "panic", scope: !50)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !803, file: !2, baseType: !655, size: 128, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !803, file: !2, baseType: !355, size: 32, align: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !803, file: !2, baseType: !355, size: 32, align: 32, offset: 160)
!810 = !{!797}
!811 = !DILocation(line: 918, column: 22, scope: !798, inlinedAt: !812)
!812 = !DILocation(line: 1116, column: 9, scope: !760, inlinedAt: !778)
!813 = !DILocalVariable(name: "slot", scope: !814, file: !736, line: 918, type: !773, align: 8)
!814 = !DILexicalBlockFile(scope: !815, file: !736, discriminator: 0)
!815 = distinct !DISubprogram(name: "into_inner<usize>", linkageName: "_ZN4core3mem13manually_drop21ManuallyDrop$LT$T$GT$10into_inner17hc5114d3bdaf8e8eeE", scope: !773, file: !816, line: 88, type: !817, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !367, retainedNodes: !819)
!816 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/mem/manually_drop.rs", directory: "", checksumkind: CSK_MD5, checksum: "a34f39f0c1c25c8378cd3f4ec0bf00c3")
!817 = !DISubroutineType(types: !818)
!818 = !{!9, !773}
!819 = !{!813}
!820 = !DILocation(line: 918, column: 22, scope: !814, inlinedAt: !821)
!821 = !DILocation(line: 634, column: 13, scope: !799, inlinedAt: !812)
!822 = !DILocation(line: 918, column: 13, scope: !744)
!823 = !DILocation(line: 919, column: 20, scope: !744)
!824 = !DILocation(line: 919, column: 26, scope: !744)
!825 = !DILocation(line: 922, column: 2, scope: !735)
!826 = !DILocation(line: 922, column: 1, scope: !735)
!827 = !DILocation(line: 913, column: 1, scope: !735)
!828 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$11checked_mul17h47da74691c4ba223E", scope: !428, file: !427, line: 555, type: !829, scopeLine: 555, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{!360, !9, !9}
!831 = !{!832, !833, !834, !836}
!832 = !DILocalVariable(name: "self", arg: 1, scope: !828, file: !427, line: 555, type: !9)
!833 = !DILocalVariable(name: "rhs", arg: 2, scope: !828, file: !427, line: 555, type: !9)
!834 = !DILocalVariable(name: "a", scope: !835, file: !427, line: 556, type: !9, align: 8)
!835 = distinct !DILexicalBlock(scope: !828, file: !427, line: 556, column: 13)
!836 = !DILocalVariable(name: "b", scope: !835, file: !427, line: 556, type: !535, align: 1)
!837 = !DILocation(line: 555, column: 34, scope: !828)
!838 = !DILocation(line: 555, column: 40, scope: !828)
!839 = !DILocation(line: 556, column: 26, scope: !828)
!840 = !DILocalVariable(name: "self", scope: !841, file: !427, line: 556, type: !9, align: 8)
!841 = distinct !DISubprogram(name: "overflowing_mul", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_mul17hce0beb250bffdecdE", scope: !428, file: !427, line: 1688, type: !842, scopeLine: 1688, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !23, retainedNodes: !848)
!842 = !DISubroutineType(types: !843)
!843 = !{!844, !9, !9}
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !2, size: 128, align: 64, elements: !845, templateParams: !23, identifier: "23309350ccb628a7900e37caa17b1249")
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !844, file: !2, baseType: !9, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !844, file: !2, baseType: !535, size: 8, align: 8, offset: 64)
!848 = !{!840, !849, !850, !852}
!849 = !DILocalVariable(name: "rhs", scope: !841, file: !427, line: 556, type: !9, align: 8)
!850 = !DILocalVariable(name: "a", scope: !851, file: !427, line: 556, type: !130, align: 8)
!851 = distinct !DILexicalBlock(scope: !841, file: !427, line: 1689, column: 13)
!852 = !DILocalVariable(name: "b", scope: !851, file: !427, line: 556, type: !535, align: 1)
!853 = !DILocation(line: 556, column: 26, scope: !841, inlinedAt: !839)
!854 = !DILocation(line: 556, column: 47, scope: !828)
!855 = !DILocation(line: 556, column: 26, scope: !851, inlinedAt: !839)
!856 = !DILocation(line: 556, column: 18, scope: !828)
!857 = !DILocation(line: 556, column: 18, scope: !835)
!858 = !DILocation(line: 556, column: 21, scope: !828)
!859 = !DILocation(line: 556, column: 21, scope: !835)
!860 = !DILocation(line: 557, column: 16, scope: !835)
!861 = !DILocation(line: 557, column: 42, scope: !835)
!862 = !DILocation(line: 557, column: 13, scope: !835)
!863 = !DILocation(line: 557, column: 30, scope: !835)
!864 = !DILocation(line: 558, column: 10, scope: !828)
!865 = !{i64 0, i64 2}
!866 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17he3358dbf817acd06E", scope: !868, file: !867, line: 248, type: !871, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !877, retainedNodes: !874)
!867 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!868 = !DINamespace(name: "FnOnce", scope: !869)
!869 = !DINamespace(name: "function", scope: !870)
!870 = !DINamespace(name: "ops", scope: !50)
!871 = !DISubroutineType(types: !872)
!872 = !{!90, !873}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!874 = !{!875, !876}
!875 = !DILocalVariable(arg: 1, scope: !866, file: !867, line: 248, type: !873)
!876 = !DILocalVariable(arg: 2, scope: !866, file: !867, line: 248, type: !7)
!877 = !{!878, !879}
!878 = !DITemplateTypeParameter(name: "Self", type: !14)
!879 = !DITemplateTypeParameter(name: "Args", type: !7)
!880 = !DILocation(line: 248, column: 5, scope: !866)
!881 = distinct !DISubprogram(name: "call_once<fn(&[u8]) -> &core::ffi::c_str::CStr, (&[u8])>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h461c99379196a0a7E", scope: !868, file: !867, line: 248, type: !882, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !887, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{!455, !472, !467}
!884 = !{!885, !886}
!885 = !DILocalVariable(arg: 1, scope: !881, file: !867, line: 248, type: !472)
!886 = !DILocalVariable(arg: 2, scope: !881, file: !867, line: 248, type: !464)
!887 = !{!888, !889}
!888 = !DITemplateTypeParameter(name: "Self", type: !472)
!889 = !DITemplateTypeParameter(name: "Args", type: !464)
!890 = !DILocation(line: 248, column: 5, scope: !881)
!891 = !{i64 1}
!892 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_simple_vacopy::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h470a16ca416fea68E", scope: !868, file: !867, line: 248, type: !893, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !901, retainedNodes: !898)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !895}
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !896, file: !2, align: 8, elements: !23, identifier: "5fb7b334dfcdd0bbd06f3e5a12bd18be")
!896 = !DINamespace(name: "test_simple_vacopy", scope: !897)
!897 = !DINamespace(name: "test_varargs", scope: !94)
!898 = !{!899, !900}
!899 = !DILocalVariable(arg: 1, scope: !892, file: !867, line: 248, type: !895)
!900 = !DILocalVariable(arg: 2, scope: !892, file: !867, line: 248, type: !7)
!901 = !{!902, !879}
!902 = !DITemplateTypeParameter(name: "Self", type: !895)
!903 = !DILocation(line: 248, column: 5, scope: !892)
!904 = distinct !DISubprogram(name: "call_once<items_tests::test_noop::test_nofnargs::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5736f6ce427174a2E", scope: !868, file: !867, line: 248, type: !905, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !913, retainedNodes: !910)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !907}
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !908, file: !2, align: 8, elements: !23, identifier: "4ac780d8d42286145f009589bb3091fa")
!908 = !DINamespace(name: "test_nofnargs", scope: !909)
!909 = !DINamespace(name: "test_noop", scope: !94)
!910 = !{!911, !912}
!911 = !DILocalVariable(arg: 1, scope: !904, file: !867, line: 248, type: !907)
!912 = !DILocalVariable(arg: 2, scope: !904, file: !867, line: 248, type: !7)
!913 = !{!914, !879}
!914 = !DITemplateTypeParameter(name: "Self", type: !907)
!915 = !DILocation(line: 248, column: 5, scope: !904)
!916 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_call_printf::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h6214936ae3873b08E", scope: !868, file: !867, line: 248, type: !917, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !924, retainedNodes: !921)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !919}
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !920, file: !2, align: 8, elements: !23, identifier: "4d47db48d937fe96f2cc6c0543ac000e")
!920 = !DINamespace(name: "test_call_printf", scope: !897)
!921 = !{!922, !923}
!922 = !DILocalVariable(arg: 1, scope: !916, file: !867, line: 248, type: !919)
!923 = !DILocalVariable(arg: 2, scope: !916, file: !867, line: 248, type: !7)
!924 = !{!925, !879}
!925 = !DITemplateTypeParameter(name: "Self", type: !919)
!926 = !DILocation(line: 248, column: 5, scope: !916)
!927 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_valist_struct_member::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h77268db247ff65b5E", scope: !868, file: !867, line: 248, type: !928, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !935, retainedNodes: !932)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !930}
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !931, file: !2, align: 8, elements: !23, identifier: "703e1b8b4e869cbec6e7f9260d77baf9")
!931 = !DINamespace(name: "test_valist_struct_member", scope: !897)
!932 = !{!933, !934}
!933 = !DILocalVariable(arg: 1, scope: !927, file: !867, line: 248, type: !930)
!934 = !DILocalVariable(arg: 2, scope: !927, file: !867, line: 248, type: !7)
!935 = !{!936, !879}
!936 = !DITemplateTypeParameter(name: "Self", type: !930)
!937 = !DILocation(line: 248, column: 5, scope: !927)
!938 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_call_vprintf::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h77aa248235f6fc7bE", scope: !868, file: !867, line: 248, type: !939, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !946, retainedNodes: !943)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !941}
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !942, file: !2, align: 8, elements: !23, identifier: "267a4103a38f0043e944b4dff6627be2")
!942 = !DINamespace(name: "test_call_vprintf", scope: !897)
!943 = !{!944, !945}
!944 = !DILocalVariable(arg: 1, scope: !938, file: !867, line: 248, type: !941)
!945 = !DILocalVariable(arg: 2, scope: !938, file: !867, line: 248, type: !7)
!946 = !{!947, !879}
!947 = !DITemplateTypeParameter(name: "Self", type: !941)
!948 = !DILocation(line: 248, column: 5, scope: !938)
!949 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h793ca64f3c1536f2E", scope: !868, file: !867, line: 248, type: !240, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !953, retainedNodes: !950)
!950 = !{!951, !952}
!951 = !DILocalVariable(arg: 1, scope: !949, file: !867, line: 248, type: !20)
!952 = !DILocalVariable(arg: 2, scope: !949, file: !867, line: 248, type: !7)
!953 = !{!954, !879}
!954 = !DITemplateTypeParameter(name: "Self", type: !20)
!955 = !DILocation(line: 248, column: 5, scope: !949)
!956 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_restart_valist::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h861b3bcfb9bac322E", scope: !868, file: !867, line: 248, type: !957, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !964, retainedNodes: !961)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !959}
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !960, file: !2, align: 8, elements: !23, identifier: "c54a161649b336137847d15333063f6")
!960 = !DINamespace(name: "test_restart_valist", scope: !897)
!961 = !{!962, !963}
!962 = !DILocalVariable(arg: 1, scope: !956, file: !867, line: 248, type: !959)
!963 = !DILocalVariable(arg: 2, scope: !956, file: !867, line: 248, type: !7)
!964 = !{!965, !879}
!965 = !DITemplateTypeParameter(name: "Self", type: !959)
!966 = !DILocation(line: 248, column: 5, scope: !956)
!967 = distinct !DISubprogram(name: "call_once<items_tests::test_noop::test_noop::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17ha270832fbeaf6911E", scope: !868, file: !867, line: 248, type: !968, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !975, retainedNodes: !972)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !970}
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !971, file: !2, align: 8, elements: !23, identifier: "b029796c8acce9eb83883d3f1065995b")
!971 = !DINamespace(name: "test_noop", scope: !909)
!972 = !{!973, !974}
!973 = !DILocalVariable(arg: 1, scope: !967, file: !867, line: 248, type: !970)
!974 = !DILocalVariable(arg: 2, scope: !967, file: !867, line: 248, type: !7)
!975 = !{!976, !879}
!976 = !DITemplateTypeParameter(name: "Self", type: !970)
!977 = !DILocation(line: 248, column: 5, scope: !967)
!978 = distinct !DISubprogram(name: "call_once<items_tests::test_functions::test_coreutils_static_assert::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hca7b06276e5a34b4E", scope: !868, file: !867, line: 248, type: !979, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !987, retainedNodes: !984)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !981}
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !982, file: !2, align: 8, elements: !23, identifier: "14dbc9fb717bc044446d42a3212b1953")
!982 = !DINamespace(name: "test_coreutils_static_assert", scope: !983)
!983 = !DINamespace(name: "test_functions", scope: !94)
!984 = !{!985, !986}
!985 = !DILocalVariable(arg: 1, scope: !978, file: !867, line: 248, type: !981)
!986 = !DILocalVariable(arg: 2, scope: !978, file: !867, line: 248, type: !7)
!987 = !{!988, !879}
!988 = !DITemplateTypeParameter(name: "Self", type: !981)
!989 = !DILocation(line: 248, column: 5, scope: !978)
!990 = distinct !DISubprogram(name: "call_once<items_tests::test_linking::test_linking::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd483a72806981ebcE", scope: !868, file: !867, line: 248, type: !991, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !999, retainedNodes: !996)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !993}
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !994, file: !2, align: 8, elements: !23, identifier: "27f342ea57649443ba41271ecab1df1e")
!994 = !DINamespace(name: "test_linking", scope: !995)
!995 = !DINamespace(name: "test_linking", scope: !94)
!996 = !{!997, !998}
!997 = !DILocalVariable(arg: 1, scope: !990, file: !867, line: 248, type: !993)
!998 = !DILocalVariable(arg: 2, scope: !990, file: !867, line: 248, type: !7)
!999 = !{!1000, !879}
!1000 = !DITemplateTypeParameter(name: "Self", type: !993)
!1001 = !DILocation(line: 248, column: 5, scope: !990)
!1002 = distinct !DISubprogram(name: "call_once<items_tests::test_fn_attrs::test_fn_attrs::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd56a9f4381f21938E", scope: !868, file: !867, line: 248, type: !1003, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1011, retainedNodes: !1008)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !1005}
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1006, file: !2, align: 8, elements: !23, identifier: "a5a8bf001d9c1a6d9e13f881cbd1ef43")
!1006 = !DINamespace(name: "test_fn_attrs", scope: !1007)
!1007 = !DINamespace(name: "test_fn_attrs", scope: !94)
!1008 = !{!1009, !1010}
!1009 = !DILocalVariable(arg: 1, scope: !1002, file: !867, line: 248, type: !1005)
!1010 = !DILocalVariable(arg: 2, scope: !1002, file: !867, line: 248, type: !7)
!1011 = !{!1012, !879}
!1012 = !DITemplateTypeParameter(name: "Self", type: !1005)
!1013 = !DILocation(line: 248, column: 5, scope: !1002)
!1014 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_my_printf::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd6c9cf14983b1622E", scope: !868, file: !867, line: 248, type: !1015, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1022, retainedNodes: !1019)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !1017}
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1018, file: !2, align: 8, elements: !23, identifier: "76a034c462efb4c4429ed043711d81f0")
!1018 = !DINamespace(name: "test_my_printf", scope: !897)
!1019 = !{!1020, !1021}
!1020 = !DILocalVariable(arg: 1, scope: !1014, file: !867, line: 248, type: !1017)
!1021 = !DILocalVariable(arg: 2, scope: !1014, file: !867, line: 248, type: !7)
!1022 = !{!1023, !879}
!1023 = !DITemplateTypeParameter(name: "Self", type: !1017)
!1024 = !DILocation(line: 248, column: 5, scope: !1014)
!1025 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_valist_struct_pointer_member::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd8abc731315913cdE", scope: !868, file: !867, line: 248, type: !1026, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1033, retainedNodes: !1030)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !1028}
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1029, file: !2, align: 8, elements: !23, identifier: "105b8126c804c2534745ca51813bbb52")
!1029 = !DINamespace(name: "test_valist_struct_pointer_member", scope: !897)
!1030 = !{!1031, !1032}
!1031 = !DILocalVariable(arg: 1, scope: !1025, file: !867, line: 248, type: !1028)
!1032 = !DILocalVariable(arg: 2, scope: !1025, file: !867, line: 248, type: !7)
!1033 = !{!1034, !879}
!1034 = !DITemplateTypeParameter(name: "Self", type: !1028)
!1035 = !DILocation(line: 248, column: 5, scope: !1025)
!1036 = distinct !DISubprogram(name: "call_once<items_tests::test_varargs::test_sample_stddev::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he9f295bdf9616028E", scope: !868, file: !867, line: 248, type: !1037, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1044, retainedNodes: !1041)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !1039}
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !1040, file: !2, align: 8, elements: !23, identifier: "60691db0e34567af6f7a76b245825f42")
!1040 = !DINamespace(name: "test_sample_stddev", scope: !897)
!1041 = !{!1042, !1043}
!1042 = !DILocalVariable(arg: 1, scope: !1036, file: !867, line: 248, type: !1039)
!1043 = !DILocalVariable(arg: 2, scope: !1036, file: !867, line: 248, type: !7)
!1044 = !{!1045, !879}
!1045 = !DITemplateTypeParameter(name: "Self", type: !1039)
!1046 = !DILocation(line: 248, column: 5, scope: !1036)
!1047 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf73420e894a2abd6E", scope: !868, file: !867, line: 248, type: !1048, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !877, retainedNodes: !1050)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!90, !14}
!1050 = !{!1051, !1052}
!1051 = !DILocalVariable(arg: 1, scope: !1047, file: !867, line: 248, type: !14)
!1052 = !DILocalVariable(arg: 2, scope: !1047, file: !867, line: 248, type: !7)
!1053 = !DILocation(line: 248, column: 5, scope: !1047)
!1054 = distinct !DISubprogram(name: "drop_in_place<&f64>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f64$GT$17h6a3355b55063efb7E", scope: !49, file: !750, line: 487, type: !1055, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1060, retainedNodes: !1058)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{null, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f64", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!1058 = !{!1059}
!1059 = !DILocalVariable(arg: 1, scope: !1054, file: !750, line: 487, type: !1057)
!1060 = !{!1061}
!1061 = !DITemplateTypeParameter(name: "T", type: !79)
!1062 = !DILocation(line: 487, column: 1, scope: !1054)
!1063 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h7a6644d12aade1d6E", scope: !49, file: !750, line: 487, type: !1064, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1069, retainedNodes: !1067)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!1067 = !{!1068}
!1068 = !DILocalVariable(arg: 1, scope: !1063, file: !750, line: 487, type: !1066)
!1069 = !{!1070}
!1070 = !DITemplateTypeParameter(name: "T", type: !89)
!1071 = !DILocation(line: 487, column: 1, scope: !1063)
!1072 = distinct !DISubprogram(name: "drop_in_place<core::ffi::VaListImpl>", linkageName: "_ZN4core3ptr42drop_in_place$LT$core..ffi..VaListImpl$GT$17h3a1e24ff022acba3E", scope: !49, file: !750, line: 487, type: !1073, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, templateParams: !1078, retainedNodes: !1076)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::VaListImpl", baseType: !546, size: 64, align: 64, dwarfAddressSpace: 0)
!1076 = !{!1077}
!1077 = !DILocalVariable(arg: 1, scope: !1072, file: !750, line: 487, type: !1075)
!1078 = !{!1079}
