; ModuleID = '1dbfis198ez035fu'
source_filename = "1dbfis198ez035fu"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_comments.rs:4:1: 7:2]" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }
%"test::types::TestName" = type { i8, [39 x i8] }
%"test::options::ShouldPanic" = type { i64, [2 x i64] }
%"test::types::TestFn" = type { i64, [2 x i64] }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [6 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !{i32 7, !"PIC Level", i32 2}
!35 = !{i32 7, !"PIE Level", i32 2}
!36 = !{i32 2, !"RtLibUseGOT", i32 1}
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !40, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !41, globals: !59)
!40 = !DIFile(filename: "src/lib.rs/@/1dbfis198ez035fu", directory: "/home/calvin/git/c2rust/tests/comments")
!41 = !{!42, !53}
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !43, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagEnumClass, elements: !48)
!43 = !DINamespace(name: "v1", scope: !44)
!44 = !DINamespace(name: "rt", scope: !45)
!45 = !DINamespace(name: "fmt", scope: !46)
!46 = !DINamespace(name: "core", scope: null)
!47 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !54, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagEnumClass, elements: !55)
!54 = !DINamespace(name: "panicking", scope: !46)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!59 = !{!0, !24}
!60 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h5b8e5f2874f54e1eE", scope: !62, file: !61, line: 118, type: !64, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !70, retainedNodes: !66)
!61 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!62 = !DINamespace(name: "backtrace", scope: !63)
!63 = !DINamespace(name: "sys_common", scope: !17)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !20}
!66 = !{!67, !68}
!67 = !DILocalVariable(name: "f", arg: 1, scope: !60, file: !61, line: 118, type: !20)
!68 = !DILocalVariable(name: "result", scope: !69, file: !61, line: 122, type: !7, align: 1)
!69 = distinct !DILexicalBlock(scope: !60, file: !61, line: 122, column: 5)
!70 = !{!71, !72}
!71 = !DITemplateTypeParameter(name: "F", type: !20)
!72 = !DITemplateTypeParameter(name: "T", type: !7)
!73 = !DILocation(line: 122, column: 9, scope: !69)
!74 = !DILocation(line: 118, column: 43, scope: !60)
!75 = !DILocalVariable(name: "dummy", scope: !76, file: !61, line: 125, type: !7, align: 1)
!76 = !DILexicalBlockFile(scope: !77, file: !61, discriminator: 0)
!77 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h288717bc8ba05d19E", scope: !79, file: !78, line: 225, type: !80, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !83, retainedNodes: !82)
!78 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!79 = !DINamespace(name: "hint", scope: !46)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !7}
!82 = !{!75}
!83 = !{!72}
!84 = !DILocation(line: 125, column: 5, scope: !76, inlinedAt: !85)
!85 = !DILocation(line: 125, column: 5, scope: !69)
!86 = !DILocation(line: 122, column: 18, scope: !60)
!87 = !{i32 3342614}
!88 = !DILocation(line: 128, column: 2, scope: !60)
!89 = !DILocation(line: 128, column: 1, scope: !60)
!90 = !DILocation(line: 118, column: 1, scope: !60)
!91 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17hf08a5764270d9db9E", scope: !16, file: !92, line: 139, type: !93, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !83, retainedNodes: !98)
!92 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !20, !95, !96}
!95 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !{!99, !100, !101, !102}
!99 = !DILocalVariable(name: "main", arg: 1, scope: !91, file: !92, line: 140, type: !20)
!100 = !DILocalVariable(name: "argc", arg: 2, scope: !91, file: !92, line: 141, type: !95)
!101 = !DILocalVariable(name: "argv", arg: 3, scope: !91, file: !92, line: 142, type: !96)
!102 = !DILocalVariable(name: "v", scope: !103, file: !92, line: 144, type: !95, align: 8)
!103 = distinct !DILexicalBlock(scope: !91, file: !92, line: 144, column: 5)
!104 = !DILocation(line: 140, column: 5, scope: !91)
!105 = !DILocation(line: 141, column: 5, scope: !91)
!106 = !DILocation(line: 142, column: 5, scope: !91)
!107 = !DILocation(line: 145, column: 10, scope: !91)
!108 = !DILocation(line: 145, column: 9, scope: !91)
!109 = !DILocation(line: 144, column: 17, scope: !91)
!110 = !DILocation(line: 144, column: 12, scope: !91)
!111 = !DILocation(line: 144, column: 12, scope: !103)
!112 = !DILocation(line: 150, column: 2, scope: !91)
!113 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h129e38c9e4b999e6E", scope: !15, file: !92, line: 145, type: !114, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !83, retainedNodes: !117)
!114 = !DISubroutineType(types: !115)
!115 = !{!33, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!117 = !{!118}
!118 = !DILocalVariable(name: "main", scope: !113, file: !92, line: 140, type: !20, align: 8)
!119 = !{i64 8}
!120 = !DILocation(line: 140, column: 5, scope: !113)
!121 = !DILocalVariable(name: "self", scope: !122, file: !92, line: 145, type: !125, align: 1)
!122 = !DILexicalBlockFile(scope: !123, file: !92, discriminator: 0)
!123 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hfab0bd976cda1d01E", scope: !125, file: !124, line: 1808, type: !136, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !138)
!124 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !126, file: !2, size: 8, align: 8, elements: !127, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!126 = !DINamespace(name: "process", scope: !17)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !125, file: !2, baseType: !129, size: 8, align: 8)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !130, file: !2, size: 8, align: 8, elements: !134, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!130 = !DINamespace(name: "process_common", scope: !131)
!131 = !DINamespace(name: "process", scope: !132)
!132 = !DINamespace(name: "unix", scope: !133)
!133 = !DINamespace(name: "sys", scope: !17)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !129, file: !2, baseType: !47, size: 8, align: 8)
!136 = !DISubroutineType(types: !137)
!137 = !{!33, !125}
!138 = !{!121}
!139 = !DILocation(line: 145, column: 18, scope: !122, inlinedAt: !140)
!140 = !DILocation(line: 145, column: 18, scope: !113)
!141 = !DILocation(line: 145, column: 77, scope: !113)
!142 = !DILocalVariable(name: "self", scope: !143, file: !92, line: 145, type: !148, align: 8)
!143 = !DILexicalBlockFile(scope: !144, file: !92, discriminator: 0)
!144 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h3772b25b20d45b53E", scope: !129, file: !145, line: 485, type: !146, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !149)
!145 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!146 = !DISubroutineType(types: !147)
!147 = !{!33, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !{!142}
!150 = !DILocation(line: 145, column: 18, scope: !143, inlinedAt: !151)
!151 = !DILocation(line: 1809, column: 9, scope: !123, inlinedAt: !140)
!152 = !DILocation(line: 145, column: 17, scope: !113)
!153 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h3d5d885dadc8b751E", scope: !155, file: !154, line: 2361, type: !156, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !215, retainedNodes: !212)
!154 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!155 = !DINamespace(name: "{impl#59}", scope: !45)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !175, !176}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !159, file: !2, size: 8, align: 8, elements: !160, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!159 = !DINamespace(name: "result", scope: !46)
!160 = !{!161}
!161 = !DICompositeType(tag: DW_TAG_variant_part, scope: !158, file: !2, size: 8, align: 8, elements: !162, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !174)
!162 = !{!163, !170}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !161, file: !2, baseType: !164, size: 8, align: 8, extraData: i64 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !158, file: !2, size: 8, align: 8, elements: !165, templateParams: !167, identifier: "cea751326735c343faf647063a65ad14")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !2, baseType: !7, align: 8, offset: 8)
!167 = !{!72, !168}
!168 = !DITemplateTypeParameter(name: "E", type: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !161, file: !2, baseType: !171, size: 8, align: 8, extraData: i64 1)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !158, file: !2, size: 8, align: 8, elements: !172, templateParams: !167, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !2, baseType: !169, align: 8, offset: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !2, baseType: !47, size: 8, align: 8, flags: DIFlagArtificial)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !45, file: !2, size: 512, align: 64, elements: !178, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!178 = !{!179, !181, !183, !184, !200, !201}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !2, baseType: !180, size: 32, align: 32, offset: 384)
!180 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !177, file: !2, baseType: !182, size: 32, align: 32, offset: 416)
!182 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !177, file: !2, baseType: !42, size: 8, align: 8, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !177, file: !2, baseType: !185, size: 128, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !186, file: !2, size: 128, align: 64, elements: !187, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!186 = !DINamespace(name: "option", scope: !46)
!187 = !{!188}
!188 = !DICompositeType(tag: DW_TAG_variant_part, scope: !185, file: !2, size: 128, align: 64, elements: !189, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !198)
!189 = !{!190, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !188, file: !2, baseType: !191, size: 128, align: 64, extraData: i64 0)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !185, file: !2, size: 128, align: 64, elements: !23, templateParams: !192, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!192 = !{!193}
!193 = !DITemplateTypeParameter(name: "T", type: !9)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !188, file: !2, baseType: !195, size: 128, align: 64, extraData: i64 1)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !185, file: !2, size: 128, align: 64, elements: !196, templateParams: !192, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !195, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagArtificial)
!199 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !177, file: !2, baseType: !185, size: 128, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !177, file: !2, baseType: !202, size: 128, align: 64, offset: 256)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !203, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!203 = !{!204, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !202, file: !2, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64, dwarfAddressSpace: 0)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !202, file: !2, baseType: !208, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !209, size: 64, align: 64, dwarfAddressSpace: 0)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3, lowerBound: 0)
!212 = !{!213, !214}
!213 = !DILocalVariable(name: "self", arg: 1, scope: !153, file: !154, line: 2361, type: !175)
!214 = !DILocalVariable(name: "f", arg: 2, scope: !153, file: !154, line: 2361, type: !176)
!215 = !{!216}
!216 = !DITemplateTypeParameter(name: "T", type: !33)
!217 = !DILocation(line: 2361, column: 20, scope: !153)
!218 = !DILocation(line: 2361, column: 27, scope: !153)
!219 = !DILocation(line: 2361, column: 71, scope: !153)
!220 = !{i64 4}
!221 = !DILocation(line: 2361, column: 62, scope: !153)
!222 = !DILocation(line: 2361, column: 84, scope: !153)
!223 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h0d9d9fa4013459dfE", scope: !225, file: !224, line: 185, type: !227, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !229)
!224 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!225 = !DINamespace(name: "{impl#80}", scope: !226)
!226 = !DINamespace(name: "num", scope: !45)
!227 = !DISubroutineType(types: !228)
!228 = !{!158, !32, !176}
!229 = !{!230, !231}
!230 = !DILocalVariable(name: "self", arg: 1, scope: !223, file: !224, line: 185, type: !32)
!231 = !DILocalVariable(name: "f", arg: 2, scope: !223, file: !224, line: 185, type: !176)
!232 = !DILocation(line: 185, column: 20, scope: !223)
!233 = !DILocation(line: 185, column: 27, scope: !223)
!234 = !DILocation(line: 186, column: 20, scope: !223)
!235 = !DILocation(line: 188, column: 27, scope: !223)
!236 = !DILocation(line: 187, column: 21, scope: !223)
!237 = !DILocation(line: 186, column: 17, scope: !223)
!238 = !DILocation(line: 193, column: 14, scope: !223)
!239 = !{i8 0, i8 2}
!240 = !DILocation(line: 191, column: 21, scope: !223)
!241 = !DILocation(line: 189, column: 21, scope: !223)
!242 = !DILocation(line: 188, column: 24, scope: !223)
!243 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hc8994225e3b57be9E", scope: !244, file: !154, line: 390, type: !318, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !320)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !45, file: !2, size: 384, align: 64, elements: !245, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!245 = !{!246, !257, !302}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !244, file: !2, baseType: !247, size: 128, align: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !248, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!248 = !{!249, !256}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !247, file: !2, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !252, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!252 = !{!253, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !251, file: !2, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !251, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !247, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !244, file: !2, baseType: !258, size: 128, align: 64, offset: 128)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !186, file: !2, size: 128, align: 64, elements: !259, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!259 = !{!260}
!260 = !DICompositeType(tag: DW_TAG_variant_part, scope: !258, file: !2, size: 128, align: 64, elements: !261, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !301)
!261 = !{!262, !297}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !260, file: !2, baseType: !263, size: 128, align: 64, extraData: i64 0)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !258, file: !2, size: 128, align: 64, elements: !23, templateParams: !264, identifier: "742dbe7e160661d8ca36fcfff2574850")
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !267, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!267 = !{!268, !296}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !266, file: !2, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64, dwarfAddressSpace: 0)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !43, file: !2, size: 448, align: 64, elements: !271, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !270, file: !2, baseType: !9, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !270, file: !2, baseType: !274, size: 384, align: 64, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !43, file: !2, size: 384, align: 64, elements: !275, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!275 = !{!276, !277, !278, !279, !295}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !274, file: !2, baseType: !182, size: 32, align: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !274, file: !2, baseType: !42, size: 8, align: 8, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !2, baseType: !180, size: 32, align: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !274, file: !2, baseType: !280, size: 128, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !43, file: !2, size: 128, align: 64, elements: !281, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!281 = !{!282}
!282 = !DICompositeType(tag: DW_TAG_variant_part, scope: !280, file: !2, size: 128, align: 64, elements: !283, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !294)
!283 = !{!284, !288, !292}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !282, file: !2, baseType: !285, size: 128, align: 64, extraData: i64 0)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !280, file: !2, size: 128, align: 64, elements: !286, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !285, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !282, file: !2, baseType: !289, size: 128, align: 64, extraData: i64 1)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !280, file: !2, size: 128, align: 64, elements: !290, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !289, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !282, file: !2, baseType: !293, size: 128, align: 64, extraData: i64 2)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !280, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!294 = !DIDerivedType(tag: DW_TAG_member, scope: !280, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagArtificial)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !274, file: !2, baseType: !280, size: 128, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !266, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !260, file: !2, baseType: !298, size: 128, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !258, file: !2, size: 128, align: 64, elements: !299, templateParams: !264, identifier: "17f2fc106094349c7673abca4839c97a")
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !298, file: !2, baseType: !266, size: 128, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, scope: !258, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagArtificial)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !244, file: !2, baseType: !303, size: 128, align: 64, offset: 256)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !304, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!304 = !{!305, !317}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !303, file: !2, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64, dwarfAddressSpace: 0)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !45, file: !2, size: 128, align: 64, elements: !308, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!308 = !{!309, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !307, file: !2, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !311, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !312, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!312 = !DINamespace(name: "{extern#0}", scope: !45)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !307, file: !2, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !315, size: 64, align: 64, dwarfAddressSpace: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{!158, !310, !176}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !303, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!244, !247, !303}
!320 = !{!321, !322}
!321 = !DILocalVariable(name: "pieces", arg: 1, scope: !243, file: !154, line: 390, type: !247)
!322 = !DILocalVariable(name: "args", arg: 2, scope: !243, file: !154, line: 390, type: !303)
!323 = !DILocation(line: 390, column: 25, scope: !243)
!324 = !DILocation(line: 390, column: 53, scope: !243)
!325 = !DILocation(line: 391, column: 12, scope: !243)
!326 = !DILocation(line: 391, column: 56, scope: !243)
!327 = !DILocation(line: 391, column: 41, scope: !243)
!328 = !DILocation(line: 394, column: 34, scope: !243)
!329 = !DILocation(line: 394, column: 9, scope: !243)
!330 = !DILocation(line: 395, column: 6, scope: !243)
!331 = !DILocation(line: 392, column: 13, scope: !243)
!332 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h3a88ac04347e7a6bE", scope: !334, file: !333, line: 248, type: !337, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !343, retainedNodes: !340)
!333 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!334 = !DINamespace(name: "FnOnce", scope: !335)
!335 = !DINamespace(name: "function", scope: !336)
!336 = !DINamespace(name: "ops", scope: !46)
!337 = !DISubroutineType(types: !338)
!338 = !{!33, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !{!341, !342}
!341 = !DILocalVariable(arg: 1, scope: !332, file: !333, line: 248, type: !339)
!342 = !DILocalVariable(arg: 2, scope: !332, file: !333, line: 248, type: !7)
!343 = !{!344, !345}
!344 = !DITemplateTypeParameter(name: "Self", type: !14)
!345 = !DITemplateTypeParameter(name: "Args", type: !7)
!346 = !DILocation(line: 248, column: 5, scope: !332)
!347 = distinct !DISubprogram(name: "call_once<comments_tests::test_comments::test_comments::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h1657f3198ae1723cE", scope: !334, file: !333, line: 248, type: !348, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !357, retainedNodes: !354)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350}
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !351, file: !2, align: 8, elements: !23, identifier: "7b59343968e83df5c119669adebaee2b")
!351 = !DINamespace(name: "test_comments", scope: !352)
!352 = !DINamespace(name: "test_comments", scope: !353)
!353 = !DINamespace(name: "comments_tests", scope: null)
!354 = !{!355, !356}
!355 = !DILocalVariable(arg: 1, scope: !347, file: !333, line: 248, type: !350)
!356 = !DILocalVariable(arg: 2, scope: !347, file: !333, line: 248, type: !7)
!357 = !{!358, !345}
!358 = !DITemplateTypeParameter(name: "Self", type: !350)
!359 = !DILocation(line: 248, column: 5, scope: !347)
!360 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h8c7326f4e7401772E", scope: !334, file: !333, line: 248, type: !361, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !343, retainedNodes: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!33, !14}
!363 = !{!364, !365}
!364 = !DILocalVariable(arg: 1, scope: !360, file: !333, line: 248, type: !14)
!365 = !DILocalVariable(arg: 2, scope: !360, file: !333, line: 248, type: !7)
!366 = !DILocation(line: 248, column: 5, scope: !360)
!367 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf5135b2d4bb02974E", scope: !334, file: !333, line: 248, type: !64, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !371, retainedNodes: !368)
!368 = !{!369, !370}
!369 = !DILocalVariable(arg: 1, scope: !367, file: !333, line: 248, type: !20)
!370 = !DILocalVariable(arg: 2, scope: !367, file: !333, line: 248, type: !7)
!371 = !{!372, !345}
!372 = !DITemplateTypeParameter(name: "Self", type: !20)
!373 = !DILocation(line: 248, column: 5, scope: !367)
!374 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h034c0159fb38a487E", scope: !376, file: !375, line: 487, type: !377, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !382, retainedNodes: !380)
!375 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!376 = !DINamespace(name: "ptr", scope: !46)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!380 = !{!381}
!381 = !DILocalVariable(arg: 1, scope: !374, file: !375, line: 487, type: !379)
!382 = !{!383}
!383 = !DITemplateTypeParameter(name: "T", type: !32)
!384 = !DILocation(line: 487, column: 1, scope: !374)
!385 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17hcfe2d8bc3e667b2aE", scope: !376, file: !375, line: 487, type: !386, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !390, retainedNodes: !388)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !339}
!388 = !{!389}
!389 = !DILocalVariable(arg: 1, scope: !385, file: !375, line: 487, type: !339)
!390 = !{!391}
!391 = !DITemplateTypeParameter(name: "T", type: !14)
!392 = !DILocation(line: 487, column: 1, scope: !385)
!393 = distinct !DISubprogram(name: "assert_failed<i32, i32>", linkageName: "_ZN4core9panicking13assert_failed17h2f7de79f81d470e7E", scope: !54, file: !394, line: 171, type: !395, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !423, retainedNodes: !418)
!394 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "89dbfc153a7177bd0202715dd5809289")
!395 = !DISubroutineType(types: !396)
!396 = !{null, !53, !32, !32, !397, !410}
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Arguments>", scope: !186, file: !2, size: 384, align: 64, elements: !398, templateParams: !23, identifier: "91782c25c0cb4075178b67ca76527846")
!398 = !{!399}
!399 = !DICompositeType(tag: DW_TAG_variant_part, scope: !397, file: !2, size: 384, align: 64, elements: !400, templateParams: !23, identifier: "d3d8c93b36d851336035bb39c7913979", discriminator: !409)
!400 = !{!401, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !399, file: !2, baseType: !402, size: 384, align: 64, extraData: i64 0)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !397, file: !2, size: 384, align: 64, elements: !23, templateParams: !403, identifier: "94094742b636673213b46bf0a5389cae")
!403 = !{!404}
!404 = !DITemplateTypeParameter(name: "T", type: !244)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !399, file: !2, baseType: !406, size: 384, align: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !397, file: !2, size: 384, align: 64, elements: !407, templateParams: !403, identifier: "424137f74f76139e10918065dfb817dc")
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !406, file: !2, baseType: !244, size: 384, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagArtificial)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !411, size: 64, align: 64, dwarfAddressSpace: 0)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !412, file: !2, size: 192, align: 64, elements: !414, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!412 = !DINamespace(name: "location", scope: !413)
!413 = !DINamespace(name: "panic", scope: !46)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !411, file: !2, baseType: !251, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !411, file: !2, baseType: !180, size: 32, align: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !411, file: !2, baseType: !180, size: 32, align: 32, offset: 160)
!418 = !{!419, !420, !421, !422}
!419 = !DILocalVariable(name: "kind", arg: 1, scope: !393, file: !394, line: 172, type: !53)
!420 = !DILocalVariable(name: "left", arg: 2, scope: !393, file: !394, line: 173, type: !32)
!421 = !DILocalVariable(name: "right", arg: 3, scope: !393, file: !394, line: 174, type: !32)
!422 = !DILocalVariable(name: "args", arg: 4, scope: !393, file: !394, line: 175, type: !397)
!423 = !{!216, !424}
!424 = !DITemplateTypeParameter(name: "U", type: !33)
!425 = !DILocation(line: 172, column: 5, scope: !393)
!426 = !DILocation(line: 173, column: 5, scope: !393)
!427 = !DILocation(line: 174, column: 5, scope: !393)
!428 = !DILocation(line: 175, column: 5, scope: !393)
!429 = !DILocation(line: 181, column: 31, scope: !393)
!430 = !DILocation(line: 181, column: 38, scope: !393)
!431 = !DILocation(line: 181, column: 46, scope: !393)
!432 = !DILocation(line: 181, column: 5, scope: !393)
!433 = distinct !DISubprogram(name: "assert_test_result<()>", linkageName: "_ZN4test18assert_test_result17h16dec9d4f4e3a874E", scope: !435, file: !434, line: 182, type: !80, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !83, retainedNodes: !436)
!434 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/test/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "762a73d08c70c6e433bc6b670465b31f")
!435 = !DINamespace(name: "test", scope: null)
!436 = !{!437, !438, !440, !444, !445}
!437 = !DILocalVariable(name: "result", arg: 1, scope: !433, file: !434, line: 182, type: !7)
!438 = !DILocalVariable(name: "code", scope: !439, file: !434, line: 183, type: !33, align: 4)
!439 = distinct !DILexicalBlock(scope: !433, file: !434, line: 183, column: 5)
!440 = !DILocalVariable(name: "left_val", scope: !441, file: !434, line: 184, type: !32, align: 8)
!441 = !DILexicalBlockFile(scope: !442, file: !434, discriminator: 0)
!442 = distinct !DILexicalBlock(scope: !439, file: !443, line: 52, column: 13)
!443 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/macros/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "92818cc67b0fce20f16574f7676a5426")
!444 = !DILocalVariable(name: "right_val", scope: !441, file: !434, line: 184, type: !32, align: 8)
!445 = !DILocalVariable(name: "kind", scope: !446, file: !434, line: 184, type: !53, align: 1)
!446 = !DILexicalBlockFile(scope: !447, file: !434, discriminator: 0)
!447 = distinct !DILexicalBlock(scope: !442, file: !443, line: 54, column: 21)
!448 = !DILocation(line: 182, column: 43, scope: !433)
!449 = !DILocation(line: 183, column: 9, scope: !439)
!450 = !DILocalVariable(name: "self", scope: !451, file: !434, line: 183, type: !125, align: 1)
!451 = !DILexicalBlockFile(scope: !452, file: !434, discriminator: 0)
!452 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hfab0bd976cda1d01E", scope: !125, file: !124, line: 1808, type: !136, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !453)
!453 = !{!450}
!454 = !DILocation(line: 183, column: 16, scope: !451, inlinedAt: !455)
!455 = !DILocation(line: 183, column: 16, scope: !433)
!456 = !DILocalVariable(name: "self", scope: !457, file: !434, line: 183, type: !148, align: 8)
!457 = !DILexicalBlockFile(scope: !458, file: !434, discriminator: 0)
!458 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h3772b25b20d45b53E", scope: !129, file: !145, line: 485, type: !146, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !39, templateParams: !23, retainedNodes: !459)
!459 = !{!456}
!460 = !DILocation(line: 183, column: 16, scope: !457, inlinedAt: !461)
