; ModuleID = 'e58tyxovi14hay4'
source_filename = "e58tyxovi14hay4"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std_detect::detect::cache::Cache" = type { %"core::sync::atomic::AtomicUsize" }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"x86::VectorInitLists" = type { <4 x float>, [2 x i64], <8 x float>, <2 x double>, [2 x i64], <4 x double>, <2 x i64>, [2 x i64], <4 x i64> }
%"x86::ShuffleVectors" = type { <4 x float>, <2 x double>, <8 x float>, <4 x double>, <4 x double>, <2 x i64>, <2 x i64>, <2 x i64>, <2 x i64>, <4 x i64>, <4 x i64>, <4 x i64>, <2 x i64>, [2 x i64], <4 x i64>, <4 x i64>, <4 x i64>, <2 x i64>, [2 x i64] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"[closure@src/test_x86.rs:206:1: 235:2]" = type {}
%"[closure@src/test_x86.rs:144:1: 153:2]" = type {}
%"[closure@src/test_x86.rs:113:1: 141:2]" = type {}
%"[closure@src/test_x86.rs:191:1: 203:2]" = type {}
%"[closure@src/test_x86.rs:156:1: 167:2]" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&simd_tests::x86::ShuffleVectors as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&simd_tests::x86::ShuffleVectors as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "48b0bd3347c26a91a2846963fde700a5")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&simd_tests::x86::ShuffleVectors", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShuffleVectors", scope: !34, file: !2, size: 3584, align: 256, elements: !36, templateParams: !23, identifier: "f92d80fe411d0c9ed3095017db514de7")
!34 = !DINamespace(name: "x86", scope: !35)
!35 = !DINamespace(name: "simd_tests", scope: null)
!36 = !{!37, !48, !54, !65, !72, !73, !79, !80, !81, !82, !89, !90, !91, !92, !93, !94, !95}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !33, file: !2, baseType: !38, size: 128, align: 128)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m128", scope: !39, file: !2, size: 128, align: 128, elements: !42, templateParams: !23, identifier: "e514506f95fb400ecb8e2395edadda3")
!39 = !DINamespace(name: "x86", scope: !40)
!40 = !DINamespace(name: "core_arch", scope: !41)
!41 = !DINamespace(name: "core", scope: null)
!42 = !{!43, !45, !46, !47}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !2, baseType: !44, size: 32, align: 32)
!44 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !38, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !38, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !38, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !33, file: !2, baseType: !49, size: 128, align: 128, offset: 128)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m128d", scope: !39, file: !2, size: 128, align: 128, elements: !50, templateParams: !23, identifier: "9dafd537a537f092c38d1d60e65bb548")
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !49, file: !2, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !49, file: !2, baseType: !52, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !33, file: !2, baseType: !55, size: 256, align: 256, offset: 256)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m256", scope: !39, file: !2, size: 256, align: 256, elements: !56, templateParams: !23, identifier: "c4346e58c6559959a36ec29775e8049b")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !55, file: !2, baseType: !44, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__4", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__5", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__6", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__7", scope: !55, file: !2, baseType: !44, size: 32, align: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !33, file: !2, baseType: !66, size: 256, align: 256, offset: 512)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m256d", scope: !39, file: !2, size: 256, align: 256, elements: !67, templateParams: !23, identifier: "c78563ccb47b9afce96960d15fa07b77")
!67 = !{!68, !69, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !66, file: !2, baseType: !52, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !66, file: !2, baseType: !52, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !66, file: !2, baseType: !52, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !66, file: !2, baseType: !52, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !33, file: !2, baseType: !66, size: 256, align: 256, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !33, file: !2, baseType: !74, size: 128, align: 128, offset: 1024)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m128i", scope: !39, file: !2, size: 128, align: 128, elements: !75, templateParams: !23, identifier: "2d02d6ddeba41fb67870585adaf8c4a9")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !74, file: !2, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !74, file: !2, baseType: !77, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !33, file: !2, baseType: !74, size: 128, align: 128, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !33, file: !2, baseType: !74, size: 128, align: 128, offset: 1280)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !33, file: !2, baseType: !74, size: 128, align: 128, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !33, file: !2, baseType: !83, size: 256, align: 256, offset: 1536)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m256i", scope: !39, file: !2, size: 256, align: 256, elements: !84, templateParams: !23, identifier: "8576ddf74d4b37259070b6243af50027")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !83, file: !2, baseType: !77, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !83, file: !2, baseType: !77, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !83, file: !2, baseType: !77, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !83, file: !2, baseType: !77, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !33, file: !2, baseType: !83, size: 256, align: 256, offset: 1792)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !33, file: !2, baseType: !83, size: 256, align: 256, offset: 2048)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !33, file: !2, baseType: !74, size: 128, align: 128, offset: 2304)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !33, file: !2, baseType: !83, size: 256, align: 256, offset: 2560)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !33, file: !2, baseType: !83, size: 256, align: 256, offset: 2816)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !33, file: !2, baseType: !83, size: 256, align: 256, offset: 3072)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !33, file: !2, baseType: !74, size: 128, align: 128, offset: 3328)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !99, vtableHolder: !104, templateParams: !23, identifier: "56f3ae9cd35b4a6d41c32c0359fd0048")
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !98, file: !2, baseType: !6, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !98, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !98, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !105, size: 64, align: 64, dwarfAddressSpace: 0)
!105 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "<&simd_tests::x86::VectorInitLists as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&simd_tests::x86::VectorInitLists as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !109, vtableHolder: !114, templateParams: !23, identifier: "568e1db1e54a26ca820198d5771b74a1")
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !108, file: !2, baseType: !6, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !108, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !108, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !108, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&simd_tests::x86::VectorInitLists", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "VectorInitLists", scope: !34, file: !2, size: 1536, align: 256, elements: !116, templateParams: !23, identifier: "c22487b01f3353fdfefe28cb46f63d7b")
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !115, file: !2, baseType: !38, size: 128, align: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !115, file: !2, baseType: !55, size: 256, align: 256, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !115, file: !2, baseType: !49, size: 128, align: 128, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !115, file: !2, baseType: !66, size: 256, align: 256, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !115, file: !2, baseType: !74, size: 128, align: 128, offset: 1024)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !115, file: !2, baseType: !83, size: 256, align: 256, offset: 1280)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !126, vtableHolder: !131, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !125, file: !2, baseType: !6, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !125, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !125, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !125, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !132, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "<&i64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !136, vtableHolder: !141, templateParams: !23, identifier: "e169c1c375cda469280253610f57bfe1")
!136 = !{!137, !138, !139, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !135, file: !2, baseType: !6, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !135, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !135, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !135, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i64", baseType: !77, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "<&u128 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u128 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !145, vtableHolder: !150, templateParams: !23, identifier: "879c0c34658d2d688b698333d8a710a9")
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !144, file: !2, baseType: !6, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !144, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !144, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !144, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u128", baseType: !151, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "<&f64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !155, vtableHolder: !160, templateParams: !23, identifier: "6b62788b1bf0b7aff81411b24fc1f74")
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !154, file: !2, baseType: !6, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !154, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !154, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f64", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "<&f32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !164, vtableHolder: !169, templateParams: !23, identifier: "167dd032769a3561d40fd3e6fbb4e28f")
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !163, file: !2, baseType: !6, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !163, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !163, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "UNSAFETY_ERROR", linkageName: "_ZN10simd_tests8test_x8614UNSAFETY_ERROR17hbfe48eeaf2df37bcE", scope: !172, file: !173, line: 48, type: !174, isLocal: true, isDefinition: true, align: 64)
!172 = !DINamespace(name: "test_x86", scope: !35)
!173 = !DIFile(filename: "src/test_x86.rs", directory: "/home/calvin/git/c2rust/tests/simd.x86_64", checksumkind: CSK_MD5, checksum: "bec54ddeaa1892c032b95e166aa87f8e")
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !175, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!175 = !{!176, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !174, file: !2, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !174, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "rust_static_m128", scope: !34, file: !182, line: 421, type: !38, isLocal: false, isDefinition: true, align: 128)
!182 = !DIFile(filename: "src/x86.rs", directory: "/home/calvin/git/c2rust/tests/simd.x86_64", checksumkind: CSK_MD5, checksum: "c7cdc21ec3f54d7f1d7329f97225b4f5")
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "rust_static_m256", scope: !34, file: !182, line: 425, type: !55, isLocal: false, isDefinition: true, align: 256)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "rust_static_m128d", scope: !34, file: !182, line: 438, type: !49, isLocal: false, isDefinition: true, align: 128)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "rust_static_m256d", scope: !34, file: !182, line: 442, type: !66, isLocal: false, isDefinition: true, align: 256)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "rust_static_m128i", scope: !34, file: !182, line: 446, type: !74, isLocal: false, isDefinition: true, align: 128)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "rust_static_m256i", scope: !34, file: !182, line: 450, type: !83, isLocal: false, isDefinition: true, align: 256)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "rust_static_uninit_m128", scope: !34, file: !182, line: 459, type: !38, isLocal: false, isDefinition: true, align: 128)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "rust_static_uninit_m256", scope: !34, file: !182, line: 463, type: !55, isLocal: false, isDefinition: true, align: 256)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "rust_static_uninit_m128d", scope: !34, file: !182, line: 467, type: !49, isLocal: false, isDefinition: true, align: 128)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "rust_static_uninit_m256d", scope: !34, file: !182, line: 471, type: !66, isLocal: false, isDefinition: true, align: 256)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "rust_static_uninit_m128i", scope: !34, file: !182, line: 475, type: !74, isLocal: false, isDefinition: true, align: 128)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "rust_static_uninit_m256i", scope: !34, file: !182, line: 479, type: !83, isLocal: false, isDefinition: true, align: 256)
!205 = !{i32 7, !"PIC Level", i32 2}
!206 = !{i32 7, !"PIE Level", i32 2}
!207 = !{i32 2, !"RtLibUseGOT", i32 1}
!208 = !{i32 2, !"Dwarf Version", i32 4}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !211, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !212, globals: !293)
!211 = !DIFile(filename: "src/lib.rs/@/e58tyxovi14hay4", directory: "/home/calvin/git/c2rust/tests/simd.x86_64")
!212 = !{!213, !269, !278, !287}
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Feature", scope: !214, file: !2, baseType: !178, size: 8, align: 8, flags: DIFlagEnumClass, elements: !218)
!214 = !DINamespace(name: "x86", scope: !215)
!215 = !DINamespace(name: "arch", scope: !216)
!216 = !DINamespace(name: "detect", scope: !217)
!217 = !DINamespace(name: "std_detect", scope: null)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!219 = !DIEnumerator(name: "aes", value: 0, isUnsigned: true)
!220 = !DIEnumerator(name: "pclmulqdq", value: 1, isUnsigned: true)
!221 = !DIEnumerator(name: "rdrand", value: 2, isUnsigned: true)
!222 = !DIEnumerator(name: "rdseed", value: 3, isUnsigned: true)
!223 = !DIEnumerator(name: "tsc", value: 4, isUnsigned: true)
!224 = !DIEnumerator(name: "mmx", value: 5, isUnsigned: true)
!225 = !DIEnumerator(name: "sse", value: 6, isUnsigned: true)
!226 = !DIEnumerator(name: "sse2", value: 7, isUnsigned: true)
!227 = !DIEnumerator(name: "sse3", value: 8, isUnsigned: true)
!228 = !DIEnumerator(name: "ssse3", value: 9, isUnsigned: true)
!229 = !DIEnumerator(name: "sse4_1", value: 10, isUnsigned: true)
!230 = !DIEnumerator(name: "sse4_2", value: 11, isUnsigned: true)
!231 = !DIEnumerator(name: "sse4a", value: 12, isUnsigned: true)
!232 = !DIEnumerator(name: "sha", value: 13, isUnsigned: true)
!233 = !DIEnumerator(name: "avx", value: 14, isUnsigned: true)
!234 = !DIEnumerator(name: "avx2", value: 15, isUnsigned: true)
!235 = !DIEnumerator(name: "avx512f", value: 16, isUnsigned: true)
!236 = !DIEnumerator(name: "avx512cd", value: 17, isUnsigned: true)
!237 = !DIEnumerator(name: "avx512er", value: 18, isUnsigned: true)
!238 = !DIEnumerator(name: "avx512pf", value: 19, isUnsigned: true)
!239 = !DIEnumerator(name: "avx512bw", value: 20, isUnsigned: true)
!240 = !DIEnumerator(name: "avx512dq", value: 21, isUnsigned: true)
!241 = !DIEnumerator(name: "avx512vl", value: 22, isUnsigned: true)
!242 = !DIEnumerator(name: "avx512ifma", value: 23, isUnsigned: true)
!243 = !DIEnumerator(name: "avx512vbmi", value: 24, isUnsigned: true)
!244 = !DIEnumerator(name: "avx512vpopcntdq", value: 25, isUnsigned: true)
!245 = !DIEnumerator(name: "avx512vbmi2", value: 26, isUnsigned: true)
!246 = !DIEnumerator(name: "avx512gfni", value: 27, isUnsigned: true)
!247 = !DIEnumerator(name: "avx512vaes", value: 28, isUnsigned: true)
!248 = !DIEnumerator(name: "avx512vpclmulqdq", value: 29, isUnsigned: true)
!249 = !DIEnumerator(name: "avx512vnni", value: 30, isUnsigned: true)
!250 = !DIEnumerator(name: "avx512bitalg", value: 31, isUnsigned: true)
!251 = !DIEnumerator(name: "avx512bf16", value: 32, isUnsigned: true)
!252 = !DIEnumerator(name: "avx512vp2intersect", value: 33, isUnsigned: true)
!253 = !DIEnumerator(name: "f16c", value: 34, isUnsigned: true)
!254 = !DIEnumerator(name: "fma", value: 35, isUnsigned: true)
!255 = !DIEnumerator(name: "bmi1", value: 36, isUnsigned: true)
!256 = !DIEnumerator(name: "bmi2", value: 37, isUnsigned: true)
!257 = !DIEnumerator(name: "lzcnt", value: 38, isUnsigned: true)
!258 = !DIEnumerator(name: "tbm", value: 39, isUnsigned: true)
!259 = !DIEnumerator(name: "popcnt", value: 40, isUnsigned: true)
!260 = !DIEnumerator(name: "fxsr", value: 41, isUnsigned: true)
!261 = !DIEnumerator(name: "xsave", value: 42, isUnsigned: true)
!262 = !DIEnumerator(name: "xsaveopt", value: 43, isUnsigned: true)
!263 = !DIEnumerator(name: "xsaves", value: 44, isUnsigned: true)
!264 = !DIEnumerator(name: "xsavec", value: 45, isUnsigned: true)
!265 = !DIEnumerator(name: "cmpxchg16b", value: 46, isUnsigned: true)
!266 = !DIEnumerator(name: "adx", value: 47, isUnsigned: true)
!267 = !DIEnumerator(name: "rtm", value: 48, isUnsigned: true)
!268 = !DIEnumerator(name: "_last", value: 49, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !270, file: !2, baseType: !178, size: 8, align: 8, flags: DIFlagEnumClass, elements: !272)
!270 = !DINamespace(name: "atomic", scope: !271)
!271 = !DINamespace(name: "sync", scope: !41)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!274 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!277 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !279, file: !2, baseType: !178, size: 8, align: 8, flags: DIFlagEnumClass, elements: !282)
!279 = !DINamespace(name: "v1", scope: !280)
!280 = !DINamespace(name: "rt", scope: !281)
!281 = !DINamespace(name: "fmt", scope: !41)
!282 = !{!283, !284, !285, !286}
!283 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !288, file: !2, baseType: !178, size: 8, align: 8, flags: DIFlagEnumClass, elements: !289)
!288 = !DINamespace(name: "panicking", scope: !41)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!293 = !{!0, !24, !96, !106, !123, !133, !142, !152, !161, !170, !180, !183, !185, !187, !189, !191, !193, !195, !197, !199, !201, !203}
!294 = distinct !DISubprogram(name: "avx", linkageName: "_ZN10std_detect6detect4arch3x8621__is_feature_detected3avx17h6fef41e5e181697cE", scope: !296, file: !295, line: 147, type: !297, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !23)
!295 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/stdarch/crates/std_detect/src/detect/macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "ec03dfb11c584cff012d9a71045342b9")
!296 = !DINamespace(name: "__is_feature_detected", scope: !214)
!297 = !DISubroutineType(types: !298)
!298 = !{!299}
!299 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!300 = !DILocation(line: 148, column: 21, scope: !301, inlinedAt: !308)
!301 = !DILexicalBlockFile(scope: !302, file: !295, discriminator: 0)
!302 = distinct !DISubprogram(name: "check_for", linkageName: "_ZN10std_detect6detect9check_for17hd7ef83325a9261b2E", scope: !216, file: !303, line: 71, type: !304, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !306)
!303 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/stdarch/crates/std_detect/src/detect/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "85a2b15a7b06487c092f3e1de697e665")
!304 = !DISubroutineType(types: !305)
!305 = !{!299, !213}
!306 = !{!307}
!307 = !DILocalVariable(name: "x", scope: !301, file: !295, line: 148, type: !213, align: 1)
!308 = !DILocation(line: 148, column: 21, scope: !294)
!309 = !DILocation(line: 149, column: 18, scope: !294)
!310 = distinct !DISubprogram(name: "mmx", linkageName: "_ZN10std_detect6detect4arch3x8621__is_feature_detected3mmx17h3ca72275528eb664E", scope: !296, file: !295, line: 147, type: !297, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !23)
!311 = !DILocation(line: 148, column: 21, scope: !312, inlinedAt: !316)
!312 = !DILexicalBlockFile(scope: !313, file: !295, discriminator: 0)
!313 = distinct !DISubprogram(name: "check_for", linkageName: "_ZN10std_detect6detect9check_for17hd7ef83325a9261b2E", scope: !216, file: !303, line: 71, type: !304, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !314)
!314 = !{!315}
!315 = !DILocalVariable(name: "x", scope: !312, file: !295, line: 148, type: !213, align: 1)
!316 = !DILocation(line: 148, column: 21, scope: !310)
!317 = !DILocation(line: 149, column: 18, scope: !310)
!318 = distinct !DISubprogram(name: "ssse3", linkageName: "_ZN10std_detect6detect4arch3x8621__is_feature_detected5ssse317h62ad16f9a0fbca19E", scope: !296, file: !295, line: 147, type: !297, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !23)
!319 = !DILocation(line: 148, column: 21, scope: !320, inlinedAt: !324)
!320 = !DILexicalBlockFile(scope: !321, file: !295, discriminator: 0)
!321 = distinct !DISubprogram(name: "check_for", linkageName: "_ZN10std_detect6detect9check_for17hd7ef83325a9261b2E", scope: !216, file: !303, line: 71, type: !304, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !322)
!322 = !{!323}
!323 = !DILocalVariable(name: "x", scope: !320, file: !295, line: 148, type: !213, align: 1)
!324 = !DILocation(line: 148, column: 21, scope: !318)
!325 = !DILocation(line: 149, column: 18, scope: !318)
!326 = distinct !DISubprogram(name: "sse4_2", linkageName: "_ZN10std_detect6detect4arch3x8621__is_feature_detected6sse4_217h493fc77a3accb8dcE", scope: !296, file: !295, line: 147, type: !297, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !23)
!327 = !DILocation(line: 148, column: 21, scope: !328, inlinedAt: !332)
!328 = !DILexicalBlockFile(scope: !329, file: !295, discriminator: 0)
!329 = distinct !DISubprogram(name: "check_for", linkageName: "_ZN10std_detect6detect9check_for17hd7ef83325a9261b2E", scope: !216, file: !303, line: 71, type: !304, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !330)
!330 = !{!331}
!331 = !DILocalVariable(name: "x", scope: !328, file: !295, line: 148, type: !213, align: 1)
!332 = !DILocation(line: 148, column: 21, scope: !326)
!333 = !DILocation(line: 149, column: 18, scope: !326)
!334 = distinct !DISubprogram(name: "test", linkageName: "_ZN10std_detect6detect5cache4test17hca4712075c628faeE", scope: !336, file: !335, line: 185, type: !337, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !339)
!335 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/stdarch/crates/std_detect/src/detect/cache.rs", directory: "", checksumkind: CSK_MD5, checksum: "6c775b6a96387b264e77cbf75c03e4ea")
!336 = !DINamespace(name: "cache", scope: !216)
!337 = !DISubroutineType(types: !338)
!338 = !{!299, !105}
!339 = !{!340, !341, !343}
!340 = !DILocalVariable(name: "bit", arg: 1, scope: !334, file: !335, line: 185, type: !105)
!341 = !DILocalVariable(name: "relative_bit", scope: !342, file: !335, line: 186, type: !105, align: 4)
!342 = distinct !DILexicalBlock(scope: !334, file: !335, line: 186, column: 5)
!343 = !DILocalVariable(name: "idx", scope: !342, file: !335, line: 186, type: !9, align: 8)
!344 = !DILocation(line: 185, column: 20, scope: !334)
!345 = !DILocalVariable(name: "self", scope: !346, file: !335, line: 191, type: !349, align: 1)
!346 = !DILexicalBlockFile(scope: !347, file: !335, discriminator: 0)
!347 = distinct !DISubprogram(name: "unwrap_or_else<bool, std_detect::detect::cache::test::{closure_env#0}>", linkageName: "_ZN4core6option15Option$LT$T$GT$14unwrap_or_else17hb39ee0e1163cacf8E", scope: !349, file: !348, line: 818, type: !363, scopeLine: 818, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !374, retainedNodes: !369)
!348 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "86a5483c3993f03690545387e943de77")
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bool>", scope: !350, file: !2, size: 8, align: 8, elements: !351, templateParams: !23, identifier: "8ca893378d8176ad7ee1a8a3e1f576f9")
!350 = !DINamespace(name: "option", scope: !41)
!351 = !{!352}
!352 = !DICompositeType(tag: DW_TAG_variant_part, scope: !349, file: !2, size: 8, align: 8, elements: !353, templateParams: !23, identifier: "da5019aea4d8b18d701bdab161ae49b0", discriminator: !362)
!353 = !{!354, !358}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !352, file: !2, baseType: !355, size: 8, align: 8, extraData: i64 2)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !349, file: !2, size: 8, align: 8, elements: !23, templateParams: !356, identifier: "626b2df65f039b34774ca0e29a769720")
!356 = !{!357}
!357 = !DITemplateTypeParameter(name: "T", type: !299)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !352, file: !2, baseType: !359, size: 8, align: 8)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !349, file: !2, size: 8, align: 8, elements: !360, templateParams: !356, identifier: "1c261429ee6e77dd7f4eb04dd3ea241d")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !359, file: !2, baseType: !299, size: 8, align: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, scope: !349, file: !2, baseType: !178, size: 8, align: 8, flags: DIFlagArtificial)
!363 = !DISubroutineType(types: !364)
!364 = !{!299, !349, !365}
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !366, file: !2, size: 64, align: 64, elements: !367, templateParams: !23, identifier: "6d312ad8bf33f868e4f9b899308fe4be")
!366 = !DINamespace(name: "test", scope: !336)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__bit", scope: !365, file: !2, baseType: !104, size: 64, align: 64)
!369 = !{!345, !370, !371}
!370 = !DILocalVariable(name: "f", scope: !346, file: !335, line: 191, type: !365, align: 8)
!371 = !DILocalVariable(name: "x", scope: !372, file: !335, line: 191, type: !299, align: 1)
!372 = !DILexicalBlockFile(scope: !373, file: !335, discriminator: 0)
!373 = distinct !DILexicalBlock(scope: !347, file: !348, line: 824, column: 13)
!374 = !{!357, !375}
!375 = !DITemplateTypeParameter(name: "F", type: !365)
!376 = !DILocation(line: 191, column: 5, scope: !346, inlinedAt: !377)
!377 = !DILocation(line: 191, column: 5, scope: !342)
!378 = !DILocation(line: 186, column: 34, scope: !334)
!379 = !DILocation(line: 189, column: 10, scope: !334)
!380 = !DILocation(line: 189, column: 9, scope: !334)
!381 = !DILocation(line: 186, column: 31, scope: !334)
!382 = !DILocation(line: 187, column: 10, scope: !334)
!383 = !DILocation(line: 187, column: 9, scope: !334)
!384 = !DILocation(line: 186, column: 10, scope: !334)
!385 = !DILocation(line: 186, column: 10, scope: !342)
!386 = !DILocation(line: 186, column: 24, scope: !334)
!387 = !DILocation(line: 186, column: 24, scope: !342)
!388 = !{i8 0, i8 3}
!389 = !DILocation(line: 193, column: 25, scope: !342)
!390 = !{i64 4}
!391 = !{i8 0, i8 2}
!392 = !DILocation(line: 191, column: 5, scope: !372, inlinedAt: !377)
!393 = !DILocation(line: 194, column: 2, scope: !334)
!394 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN10std_detect6detect5cache4test28_$u7b$$u7b$closure$u7d$$u7d$17hcc91021c1856c20cE", scope: !366, file: !335, line: 193, type: !395, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!299, !365}
!397 = !{!398}
!398 = !DILocalVariable(name: "bit", scope: !394, file: !335, line: 185, type: !105, align: 4)
!399 = !DILocation(line: 185, column: 20, scope: !394)
!400 = !DILocation(line: 193, column: 28, scope: !394)
!401 = !DILocalVariable(name: "self", scope: !402, file: !335, line: 193, type: !403, align: 8)
!402 = distinct !DISubprogram(name: "test", linkageName: "_ZN10std_detect6detect5cache11Initializer4test17h8075bb80ff1fdc86E", scope: !403, file: !335, line: 47, type: !407, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !409)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Initializer", scope: !336, file: !2, size: 64, align: 64, elements: !404, templateParams: !23, identifier: "5bbaf7c889b7ab57132a860a3896bfb7")
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !403, file: !2, baseType: !406, size: 64, align: 64)
!406 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!407 = !DISubroutineType(types: !408)
!408 = !{!299, !403, !105}
!409 = !{!401, !410}
!410 = !DILocalVariable(name: "bit", scope: !402, file: !335, line: 193, type: !105, align: 4)
!411 = !DILocation(line: 193, column: 28, scope: !402, inlinedAt: !400)
!412 = !DILocation(line: 193, column: 57, scope: !394)
!413 = !DILocalVariable(name: "x", scope: !414, file: !335, line: 193, type: !406, align: 8)
!414 = distinct !DISubprogram(name: "test_bit", linkageName: "_ZN10std_detect6detect5cache8test_bit17hb78df664fbe703a1E", scope: !336, file: !335, line: 18, type: !415, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{!299, !406, !105}
!417 = !{!413, !418}
!418 = !DILocalVariable(name: "bit", scope: !414, file: !335, line: 193, type: !105, align: 4)
!419 = !DILocation(line: 193, column: 28, scope: !414, inlinedAt: !420)
!420 = !DILocation(line: 52, column: 9, scope: !402, inlinedAt: !400)
!421 = !DILocation(line: 193, column: 27, scope: !394)
!422 = distinct !DISubprogram(name: "test", linkageName: "_ZN10std_detect6detect5cache5Cache4test17h941abdb7528aa6d2E", scope: !423, file: !335, line: 105, type: !435, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !438)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cache", scope: !336, file: !2, size: 64, align: 64, elements: !424, templateParams: !23, identifier: "c31986e1d769bc8915b4db71645886d7")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !423, file: !2, baseType: !426, size: 64, align: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !270, file: !2, size: 64, align: 64, elements: !427, templateParams: !23, identifier: "7ffec6c78d83ad83b9e8e18b9f044e78")
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !426, file: !2, baseType: !429, size: 64, align: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !430, file: !2, size: 64, align: 64, elements: !431, templateParams: !433, identifier: "1096bf4d22c004093180ac32ada74dc8")
!430 = !DINamespace(name: "cell", scope: !41)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !429, file: !2, baseType: !9, size: 64, align: 64)
!433 = !{!434}
!434 = !DITemplateTypeParameter(name: "T", type: !9)
!435 = !DISubroutineType(types: !436)
!436 = !{!349, !437, !105}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std_detect::detect::cache::Cache", baseType: !423, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !{!439, !440, !441}
!439 = !DILocalVariable(name: "self", arg: 1, scope: !422, file: !335, line: 105, type: !437)
!440 = !DILocalVariable(name: "bit", arg: 2, scope: !422, file: !335, line: 105, type: !105)
!441 = !DILocalVariable(name: "cached", scope: !442, file: !335, line: 106, type: !9, align: 8)
!442 = distinct !DILexicalBlock(scope: !422, file: !335, line: 106, column: 9)
!443 = !DILocation(line: 105, column: 24, scope: !422)
!444 = !DILocation(line: 105, column: 31, scope: !422)
!445 = !DILocation(line: 106, column: 22, scope: !422)
!446 = !DILocalVariable(name: "self", scope: !447, file: !335, line: 106, type: !452, align: 8)
!447 = !DILexicalBlockFile(scope: !448, file: !335, discriminator: 0)
!448 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17hf51d7adba5fa93f8E", scope: !426, file: !449, line: 2115, type: !450, scopeLine: 2115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !453)
!449 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "33f2452070e846308c0aa49b39c50bc5")
!450 = !DISubroutineType(types: !451)
!451 = !{!9, !452, !269}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !426, size: 64, align: 64, dwarfAddressSpace: 0)
!453 = !{!446, !454}
!454 = !DILocalVariable(name: "order", scope: !447, file: !335, line: 106, type: !269, align: 1)
!455 = !DILocation(line: 106, column: 22, scope: !447, inlinedAt: !445)
!456 = !DILocalVariable(name: "self", scope: !457, file: !335, line: 106, type: !463, align: 8)
!457 = !DILexicalBlockFile(scope: !458, file: !335, discriminator: 0)
!458 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h4c3c99782871d57dE", scope: !429, file: !459, line: 1934, type: !460, scopeLine: 1934, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !433, retainedNodes: !464)
!459 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "81027bd0ceaa41fbc0bc4e7a3fa9f759")
!460 = !DISubroutineType(types: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !429, size: 64, align: 64, dwarfAddressSpace: 0)
!464 = !{!456}
!465 = !DILocation(line: 106, column: 22, scope: !457, inlinedAt: !466)
!466 = !DILocation(line: 2117, column: 38, scope: !448, inlinedAt: !445)
!467 = !DILocation(line: 106, column: 13, scope: !442)
!468 = !DILocation(line: 107, column: 12, scope: !442)
!469 = !DILocation(line: 108, column: 13, scope: !442)
!470 = !DILocation(line: 107, column: 9, scope: !442)
!471 = !DILocation(line: 110, column: 27, scope: !442)
!472 = !DILocalVariable(name: "x", scope: !473, file: !335, line: 110, type: !406, align: 8)
!473 = distinct !DISubprogram(name: "test_bit", linkageName: "_ZN10std_detect6detect5cache8test_bit17hb78df664fbe703a1E", scope: !336, file: !335, line: 18, type: !415, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !474)
!474 = !{!472, !475}
!475 = !DILocalVariable(name: "bit", scope: !473, file: !335, line: 110, type: !105, align: 4)
!476 = !DILocation(line: 110, column: 18, scope: !473, inlinedAt: !477)
!477 = !DILocation(line: 110, column: 18, scope: !442)
!478 = !DILocation(line: 110, column: 42, scope: !442)
!479 = !DILocation(line: 110, column: 13, scope: !442)
!480 = !DILocation(line: 112, column: 6, scope: !422)
!481 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hf7d1b9f924e5b925E", scope: !483, file: !482, line: 118, type: !485, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !491, retainedNodes: !487)
!482 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!483 = !DINamespace(name: "backtrace", scope: !484)
!484 = !DINamespace(name: "sys_common", scope: !17)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !20}
!487 = !{!488, !489}
!488 = !DILocalVariable(name: "f", arg: 1, scope: !481, file: !482, line: 118, type: !20)
!489 = !DILocalVariable(name: "result", scope: !490, file: !482, line: 122, type: !7, align: 1)
!490 = distinct !DILexicalBlock(scope: !481, file: !482, line: 122, column: 5)
!491 = !{!492, !493}
!492 = !DITemplateTypeParameter(name: "F", type: !20)
!493 = !DITemplateTypeParameter(name: "T", type: !7)
!494 = !DILocation(line: 122, column: 9, scope: !490)
!495 = !DILocation(line: 118, column: 43, scope: !481)
!496 = !DILocalVariable(name: "dummy", scope: !497, file: !482, line: 125, type: !7, align: 1)
!497 = !DILexicalBlockFile(scope: !498, file: !482, discriminator: 0)
!498 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h721dfcff570ba157E", scope: !500, file: !499, line: 225, type: !501, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !504, retainedNodes: !503)
!499 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!500 = !DINamespace(name: "hint", scope: !41)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !7}
!503 = !{!496}
!504 = !{!493}
!505 = !DILocation(line: 125, column: 5, scope: !497, inlinedAt: !506)
!506 = !DILocation(line: 125, column: 5, scope: !490)
!507 = !DILocation(line: 122, column: 18, scope: !481)
!508 = !{i32 3370027}
!509 = !DILocation(line: 128, column: 2, scope: !481)
!510 = !DILocation(line: 128, column: 1, scope: !481)
!511 = !DILocation(line: 118, column: 1, scope: !481)
!512 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17hcfa360f9d80a37d4E", scope: !16, file: !513, line: 139, type: !514, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !504, retainedNodes: !519)
!513 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !20, !516, !517}
!516 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !518, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!519 = !{!520, !521, !522, !523}
!520 = !DILocalVariable(name: "main", arg: 1, scope: !512, file: !513, line: 140, type: !20)
!521 = !DILocalVariable(name: "argc", arg: 2, scope: !512, file: !513, line: 141, type: !516)
!522 = !DILocalVariable(name: "argv", arg: 3, scope: !512, file: !513, line: 142, type: !517)
!523 = !DILocalVariable(name: "v", scope: !524, file: !513, line: 144, type: !516, align: 8)
!524 = distinct !DILexicalBlock(scope: !512, file: !513, line: 144, column: 5)
!525 = !DILocation(line: 140, column: 5, scope: !512)
!526 = !DILocation(line: 141, column: 5, scope: !512)
!527 = !DILocation(line: 142, column: 5, scope: !512)
!528 = !DILocation(line: 145, column: 10, scope: !512)
!529 = !DILocation(line: 145, column: 9, scope: !512)
!530 = !DILocation(line: 144, column: 17, scope: !512)
!531 = !DILocation(line: 144, column: 12, scope: !512)
!532 = !DILocation(line: 144, column: 12, scope: !524)
!533 = !DILocation(line: 150, column: 2, scope: !512)
!534 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h0d40ca36b0899dfeE", scope: !15, file: !513, line: 145, type: !535, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !504, retainedNodes: !538)
!535 = !DISubroutineType(types: !536)
!536 = !{!132, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!538 = !{!539}
!539 = !DILocalVariable(name: "main", scope: !534, file: !513, line: 140, type: !20, align: 8)
!540 = !{i64 8}
!541 = !DILocation(line: 140, column: 5, scope: !534)
!542 = !DILocalVariable(name: "self", scope: !543, file: !513, line: 145, type: !546, align: 1)
!543 = !DILexicalBlockFile(scope: !544, file: !513, discriminator: 0)
!544 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217ha2147a7a6efddc0fE", scope: !546, file: !545, line: 1808, type: !557, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !559)
!545 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !547, file: !2, size: 8, align: 8, elements: !548, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!547 = !DINamespace(name: "process", scope: !17)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !546, file: !2, baseType: !550, size: 8, align: 8)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !551, file: !2, size: 8, align: 8, elements: !555, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!551 = !DINamespace(name: "process_common", scope: !552)
!552 = !DINamespace(name: "process", scope: !553)
!553 = !DINamespace(name: "unix", scope: !554)
!554 = !DINamespace(name: "sys", scope: !17)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !550, file: !2, baseType: !178, size: 8, align: 8)
!557 = !DISubroutineType(types: !558)
!558 = !{!132, !546}
!559 = !{!542}
!560 = !DILocation(line: 145, column: 18, scope: !543, inlinedAt: !561)
!561 = !DILocation(line: 145, column: 18, scope: !534)
!562 = !DILocation(line: 145, column: 77, scope: !534)
!563 = !DILocalVariable(name: "self", scope: !564, file: !513, line: 145, type: !569, align: 8)
!564 = !DILexicalBlockFile(scope: !565, file: !513, discriminator: 0)
!565 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h180f5641f5ee4063E", scope: !550, file: !566, line: 485, type: !567, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !570)
!566 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!567 = !DISubroutineType(types: !568)
!568 = !{!132, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!570 = !{!563}
!571 = !DILocation(line: 145, column: 18, scope: !564, inlinedAt: !572)
!572 = !DILocation(line: 1809, column: 9, scope: !544, inlinedAt: !561)
!573 = !DILocation(line: 145, column: 17, scope: !534)
!574 = distinct !DISubprogram(name: "fmt<f64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h251ef969b9d20694E", scope: !576, file: !575, line: 2361, type: !577, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !631, retainedNodes: !628)
!575 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!576 = !DINamespace(name: "{impl#59}", scope: !281)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !596, !597}
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !580, file: !2, size: 8, align: 8, elements: !581, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!580 = !DINamespace(name: "result", scope: !41)
!581 = !{!582}
!582 = !DICompositeType(tag: DW_TAG_variant_part, scope: !579, file: !2, size: 8, align: 8, elements: !583, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !595)
!583 = !{!584, !591}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !582, file: !2, baseType: !585, size: 8, align: 8, extraData: i64 0)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !579, file: !2, size: 8, align: 8, elements: !586, templateParams: !588, identifier: "cea751326735c343faf647063a65ad14")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !585, file: !2, baseType: !7, align: 8, offset: 8)
!588 = !{!493, !589}
!589 = !DITemplateTypeParameter(name: "E", type: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !281, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !582, file: !2, baseType: !592, size: 8, align: 8, extraData: i64 1)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !579, file: !2, size: 8, align: 8, elements: !593, templateParams: !588, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !592, file: !2, baseType: !590, align: 8, offset: 8)
!595 = !DIDerivedType(tag: DW_TAG_member, scope: !579, file: !2, baseType: !178, size: 8, align: 8, flags: DIFlagArtificial)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f64", baseType: !160, size: 64, align: 64, dwarfAddressSpace: 0)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !598, size: 64, align: 64, dwarfAddressSpace: 0)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !281, file: !2, size: 512, align: 64, elements: !599, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!599 = !{!600, !601, !603, !604, !616, !617}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !598, file: !2, baseType: !105, size: 32, align: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !598, file: !2, baseType: !602, size: 32, align: 32, offset: 416)
!602 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !598, file: !2, baseType: !278, size: 8, align: 8, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !598, file: !2, baseType: !605, size: 128, align: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !350, file: !2, size: 128, align: 64, elements: !606, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!606 = !{!607}
!607 = !DICompositeType(tag: DW_TAG_variant_part, scope: !605, file: !2, size: 128, align: 64, elements: !608, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !615)
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !607, file: !2, baseType: !610, size: 128, align: 64, extraData: i64 0)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !605, file: !2, size: 128, align: 64, elements: !23, templateParams: !433, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !607, file: !2, baseType: !612, size: 128, align: 64, extraData: i64 1)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !605, file: !2, size: 128, align: 64, elements: !613, templateParams: !433, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !612, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, scope: !605, file: !2, baseType: !406, size: 64, align: 64, flags: DIFlagArtificial)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !598, file: !2, baseType: !605, size: 128, align: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !598, file: !2, baseType: !618, size: 128, align: 64, offset: 256)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !619, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!619 = !{!620, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !618, file: !2, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64, dwarfAddressSpace: 0)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !618, file: !2, baseType: !624, size: 64, align: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !625, size: 64, align: 64, dwarfAddressSpace: 0)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 3, lowerBound: 0)
!628 = !{!629, !630}
!629 = !DILocalVariable(name: "self", arg: 1, scope: !574, file: !575, line: 2361, type: !596)
!630 = !DILocalVariable(name: "f", arg: 2, scope: !574, file: !575, line: 2361, type: !597)
!631 = !{!632}
!632 = !DITemplateTypeParameter(name: "T", type: !52)
!633 = !DILocation(line: 2361, column: 20, scope: !574)
!634 = !DILocation(line: 2361, column: 27, scope: !574)
!635 = !DILocation(line: 2361, column: 71, scope: !574)
!636 = !DILocation(line: 2361, column: 62, scope: !574)
!637 = !DILocation(line: 2361, column: 84, scope: !574)
!638 = distinct !DISubprogram(name: "fmt<simd_tests::x86::VectorInitLists>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h2e6dab0646ce75e0E", scope: !576, file: !575, line: 2361, type: !639, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !645, retainedNodes: !642)
!639 = !DISubroutineType(types: !640)
!640 = !{!579, !641, !597}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&simd_tests::x86::VectorInitLists", baseType: !114, size: 64, align: 64, dwarfAddressSpace: 0)
!642 = !{!643, !644}
!643 = !DILocalVariable(name: "self", arg: 1, scope: !638, file: !575, line: 2361, type: !641)
!644 = !DILocalVariable(name: "f", arg: 2, scope: !638, file: !575, line: 2361, type: !597)
!645 = !{!646}
!646 = !DITemplateTypeParameter(name: "T", type: !115)
!647 = !DILocation(line: 2361, column: 20, scope: !638)
!648 = !DILocation(line: 2361, column: 27, scope: !638)
!649 = !DILocation(line: 2361, column: 71, scope: !638)
!650 = !{i64 32}
!651 = !DILocation(line: 2361, column: 62, scope: !638)
!652 = !DILocation(line: 2361, column: 84, scope: !638)
!653 = distinct !DISubprogram(name: "fmt<f32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h575cb61ea75ae143E", scope: !576, file: !575, line: 2361, type: !654, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !660, retainedNodes: !657)
!654 = !DISubroutineType(types: !655)
!655 = !{!579, !656, !597}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f32", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!657 = !{!658, !659}
!658 = !DILocalVariable(name: "self", arg: 1, scope: !653, file: !575, line: 2361, type: !656)
!659 = !DILocalVariable(name: "f", arg: 2, scope: !653, file: !575, line: 2361, type: !597)
!660 = !{!661}
!661 = !DITemplateTypeParameter(name: "T", type: !44)
!662 = !DILocation(line: 2361, column: 20, scope: !653)
!663 = !DILocation(line: 2361, column: 27, scope: !653)
!664 = !DILocation(line: 2361, column: 71, scope: !653)
!665 = !DILocation(line: 2361, column: 62, scope: !653)
!666 = !DILocation(line: 2361, column: 84, scope: !653)
!667 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h72c2fa97d2991440E", scope: !576, file: !575, line: 2361, type: !668, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !674, retainedNodes: !671)
!668 = !DISubroutineType(types: !669)
!669 = !{!579, !670, !597}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u32", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!671 = !{!672, !673}
!672 = !DILocalVariable(name: "self", arg: 1, scope: !667, file: !575, line: 2361, type: !670)
!673 = !DILocalVariable(name: "f", arg: 2, scope: !667, file: !575, line: 2361, type: !597)
!674 = !{!675}
!675 = !DITemplateTypeParameter(name: "T", type: !105)
!676 = !DILocation(line: 2361, column: 20, scope: !667)
!677 = !DILocation(line: 2361, column: 27, scope: !667)
!678 = !DILocation(line: 2361, column: 71, scope: !667)
!679 = !DILocation(line: 2361, column: 62, scope: !667)
!680 = !DILocation(line: 2361, column: 84, scope: !667)
!681 = distinct !DISubprogram(name: "fmt<u128>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17ha1f3ca14dd5ae5a7E", scope: !576, file: !575, line: 2361, type: !682, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !688, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{!579, !684, !597}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u128", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!685 = !{!686, !687}
!686 = !DILocalVariable(name: "self", arg: 1, scope: !681, file: !575, line: 2361, type: !684)
!687 = !DILocalVariable(name: "f", arg: 2, scope: !681, file: !575, line: 2361, type: !597)
!688 = !{!689}
!689 = !DITemplateTypeParameter(name: "T", type: !151)
!690 = !DILocation(line: 2361, column: 20, scope: !681)
!691 = !DILocation(line: 2361, column: 27, scope: !681)
!692 = !DILocation(line: 2361, column: 71, scope: !681)
!693 = !DILocation(line: 2361, column: 62, scope: !681)
!694 = !DILocation(line: 2361, column: 84, scope: !681)
!695 = distinct !DISubprogram(name: "fmt<simd_tests::x86::ShuffleVectors>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hbaec50028433fafbE", scope: !576, file: !575, line: 2361, type: !696, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !702, retainedNodes: !699)
!696 = !DISubroutineType(types: !697)
!697 = !{!579, !698, !597}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&simd_tests::x86::ShuffleVectors", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!699 = !{!700, !701}
!700 = !DILocalVariable(name: "self", arg: 1, scope: !695, file: !575, line: 2361, type: !698)
!701 = !DILocalVariable(name: "f", arg: 2, scope: !695, file: !575, line: 2361, type: !597)
!702 = !{!703}
!703 = !DITemplateTypeParameter(name: "T", type: !33)
!704 = !DILocation(line: 2361, column: 20, scope: !695)
!705 = !DILocation(line: 2361, column: 27, scope: !695)
!706 = !DILocation(line: 2361, column: 71, scope: !695)
!707 = !DILocation(line: 2361, column: 62, scope: !695)
!708 = !DILocation(line: 2361, column: 84, scope: !695)
!709 = distinct !DISubprogram(name: "fmt<i64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hd2371bb6227f481eE", scope: !576, file: !575, line: 2361, type: !710, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !716, retainedNodes: !713)
!710 = !DISubroutineType(types: !711)
!711 = !{!579, !712, !597}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i64", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!713 = !{!714, !715}
!714 = !DILocalVariable(name: "self", arg: 1, scope: !709, file: !575, line: 2361, type: !712)
!715 = !DILocalVariable(name: "f", arg: 2, scope: !709, file: !575, line: 2361, type: !597)
!716 = !{!717}
!717 = !DITemplateTypeParameter(name: "T", type: !77)
!718 = !DILocation(line: 2361, column: 20, scope: !709)
!719 = !DILocation(line: 2361, column: 27, scope: !709)
!720 = !DILocation(line: 2361, column: 71, scope: !709)
!721 = !DILocation(line: 2361, column: 62, scope: !709)
!722 = !DILocation(line: 2361, column: 84, scope: !709)
!723 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17he6d40749726e6eb9E", scope: !576, file: !575, line: 2361, type: !724, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !730, retainedNodes: !727)
!724 = !DISubroutineType(types: !725)
!725 = !{!579, !726, !597}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!727 = !{!728, !729}
!728 = !DILocalVariable(name: "self", arg: 1, scope: !723, file: !575, line: 2361, type: !726)
!729 = !DILocalVariable(name: "f", arg: 2, scope: !723, file: !575, line: 2361, type: !597)
!730 = !{!731}
!731 = !DITemplateTypeParameter(name: "T", type: !132)
!732 = !DILocation(line: 2361, column: 20, scope: !723)
!733 = !DILocation(line: 2361, column: 27, scope: !723)
!734 = !DILocation(line: 2361, column: 71, scope: !723)
!735 = !DILocation(line: 2361, column: 62, scope: !723)
!736 = !DILocation(line: 2361, column: 84, scope: !723)
!737 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN44_$LT$$RF$T$u20$as$u20$core..fmt..Display$GT$3fmt17h425b5a9f415eeb65E", scope: !738, file: !575, line: 2361, type: !739, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !745, retainedNodes: !742)
!738 = !DINamespace(name: "{impl#61}", scope: !281)
!739 = !DISubroutineType(types: !740)
!740 = !{!579, !741, !597}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!742 = !{!743, !744}
!743 = !DILocalVariable(name: "self", arg: 1, scope: !737, file: !575, line: 2361, type: !741)
!744 = !DILocalVariable(name: "f", arg: 2, scope: !737, file: !575, line: 2361, type: !597)
!745 = !{!746}
!746 = !DITemplateTypeParameter(name: "T", type: !178)
!747 = !DILocation(line: 2361, column: 20, scope: !737)
!748 = !DILocation(line: 2361, column: 27, scope: !737)
!749 = !DILocation(line: 2361, column: 71, scope: !737)
!750 = !{i64 1}
!751 = !DILocation(line: 2361, column: 62, scope: !737)
!752 = !DILocation(line: 2361, column: 84, scope: !737)
!753 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$f32$GT$2ne17hb8144ed937eabccaE", scope: !755, file: !754, line: 1336, type: !758, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !760)
!754 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!755 = !DINamespace(name: "{impl#33}", scope: !756)
!756 = !DINamespace(name: "impls", scope: !757)
!757 = !DINamespace(name: "cmp", scope: !41)
!758 = !DISubroutineType(types: !759)
!759 = !{!299, !169, !169}
!760 = !{!761, !762}
!761 = !DILocalVariable(name: "self", arg: 1, scope: !753, file: !754, line: 1336, type: !169)
!762 = !DILocalVariable(name: "other", arg: 2, scope: !753, file: !754, line: 1336, type: !169)
!763 = !DILocation(line: 1336, column: 23, scope: !753)
!764 = !DILocation(line: 1336, column: 30, scope: !753)
!765 = !DILocation(line: 1336, column: 52, scope: !753)
!766 = !DILocation(line: 1336, column: 63, scope: !753)
!767 = !DILocation(line: 1336, column: 73, scope: !753)
!768 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$f64$GT$2ne17h83220a700b1818eeE", scope: !769, file: !754, line: 1336, type: !770, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !772)
!769 = !DINamespace(name: "{impl#34}", scope: !756)
!770 = !DISubroutineType(types: !771)
!771 = !{!299, !160, !160}
!772 = !{!773, !774}
!773 = !DILocalVariable(name: "self", arg: 1, scope: !768, file: !754, line: 1336, type: !160)
!774 = !DILocalVariable(name: "other", arg: 2, scope: !768, file: !754, line: 1336, type: !160)
!775 = !DILocation(line: 1336, column: 23, scope: !768)
!776 = !DILocation(line: 1336, column: 30, scope: !768)
!777 = !DILocation(line: 1336, column: 52, scope: !768)
!778 = !DILocation(line: 1336, column: 63, scope: !768)
!779 = !DILocation(line: 1336, column: 73, scope: !768)
!780 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$i64$GT$2ne17hc7de2b767815b83dE", scope: !781, file: !754, line: 1336, type: !782, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !784)
!781 = !DINamespace(name: "{impl#31}", scope: !756)
!782 = !DISubroutineType(types: !783)
!783 = !{!299, !141, !141}
!784 = !{!785, !786}
!785 = !DILocalVariable(name: "self", arg: 1, scope: !780, file: !754, line: 1336, type: !141)
!786 = !DILocalVariable(name: "other", arg: 2, scope: !780, file: !754, line: 1336, type: !141)
!787 = !DILocation(line: 1336, column: 23, scope: !780)
!788 = !DILocation(line: 1336, column: 30, scope: !780)
!789 = !DILocation(line: 1336, column: 52, scope: !780)
!790 = !DILocation(line: 1336, column: 63, scope: !780)
!791 = !DILocation(line: 1336, column: 73, scope: !780)
!792 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$u128$GT$2ne17hc9b32d5b4a6e27feE", scope: !793, file: !754, line: 1336, type: !794, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !23, retainedNodes: !796)
!793 = !DINamespace(name: "{impl#26}", scope: !756)
!794 = !DISubroutineType(types: !795)
!795 = !{!299, !150, !150}
!796 = !{!797, !798}
!797 = !DILocalVariable(name: "self", arg: 1, scope: !792, file: !754, line: 1336, type: !150)
!798 = !DILocalVariable(name: "other", arg: 2, scope: !792, file: !754, line: 1336, type: !150)
!799 = !DILocation(line: 1336, column: 23, scope: !792)
!800 = !DILocation(line: 1336, column: 30, scope: !792)
!801 = !DILocation(line: 1336, column: 52, scope: !792)
!802 = !DILocation(line: 1336, column: 63, scope: !792)
!803 = !DILocation(line: 1336, column: 73, scope: !792)
!804 = distinct !DISubprogram(name: "new_display<&str>", linkageName: "_ZN4core3fmt10ArgumentV111new_display17ha45a7654fea7bc2dE", scope: !805, file: !575, line: 318, type: !815, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !819, retainedNodes: !817)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !281, file: !2, size: 128, align: 64, elements: !806, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!806 = !{!807, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !805, file: !2, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !809, size: 64, align: 64, dwarfAddressSpace: 0)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !810, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!810 = !DINamespace(name: "{extern#0}", scope: !281)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !805, file: !2, baseType: !812, size: 64, align: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !813, size: 64, align: 64, dwarfAddressSpace: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!579, !808, !597}
!815 = !DISubroutineType(types: !816)
!816 = !{!805, !741}
!817 = !{!818}
!818 = !DILocalVariable(name: "x", arg: 1, scope: !804, file: !575, line: 318, type: !741)
!819 = !{!820}
!820 = !DITemplateTypeParameter(name: "T", type: !174)
!821 = !DILocation(line: 318, column: 30, scope: !804)
!822 = !DILocation(line: 319, column: 23, scope: !804)
!823 = !DILocalVariable(name: "x", scope: !824, file: !575, line: 319, type: !741, align: 8)
!824 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN4core3fmt10ArgumentV13new17hf0384270ca446036E", scope: !805, file: !575, line: 329, type: !825, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !819, retainedNodes: !828)
!825 = !DISubroutineType(types: !826)
!826 = !{!805, !741, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&str, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !739, size: 64, align: 64, dwarfAddressSpace: 0)
!828 = !{!823, !829}
!829 = !DILocalVariable(name: "f", scope: !824, file: !575, line: 319, type: !827, align: 8)
!830 = !DILocation(line: 319, column: 13, scope: !824, inlinedAt: !831)
!831 = !DILocation(line: 319, column: 13, scope: !804)
!832 = !DILocation(line: 319, column: 26, scope: !804)
!833 = !DILocation(line: 320, column: 10, scope: !804)
!834 = distinct !DISubprogram(name: "new_debug<u128>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h1ce2788ad385f3e0E", scope: !805, file: !575, line: 318, type: !835, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !688, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!805, !150}
!837 = !{!838}
!838 = !DILocalVariable(name: "x", arg: 1, scope: !834, file: !575, line: 318, type: !150)
!839 = !DILocation(line: 318, column: 30, scope: !834)
!840 = !DILocation(line: 319, column: 23, scope: !834)
!841 = !DILocalVariable(name: "x", scope: !842, file: !575, line: 319, type: !150, align: 8)
!842 = distinct !DISubprogram(name: "new<u128>", linkageName: "_ZN4core3fmt10ArgumentV13new17h653ed806c7adeb71E", scope: !805, file: !575, line: 329, type: !843, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !688, retainedNodes: !848)
!843 = !DISubroutineType(types: !844)
!844 = !{!805, !150, !845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&u128, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !846, size: 64, align: 64, dwarfAddressSpace: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{!579, !150, !597}
!848 = !{!841, !849}
!849 = !DILocalVariable(name: "f", scope: !842, file: !575, line: 319, type: !845, align: 8)
!850 = !DILocation(line: 319, column: 13, scope: !842, inlinedAt: !851)
!851 = !DILocation(line: 319, column: 13, scope: !834)
!852 = !DILocation(line: 319, column: 26, scope: !834)
!853 = !DILocation(line: 320, column: 10, scope: !834)
!854 = distinct !DISubprogram(name: "new_debug<(f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h43f9f76f95ea75bbE", scope: !805, file: !575, line: 318, type: !855, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !866, retainedNodes: !864)
!855 = !DISubroutineType(types: !856)
!856 = !{!805, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f32, f32, f32, f32)", baseType: !858, size: 64, align: 64, dwarfAddressSpace: 0)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f32, f32, f32, f32)", file: !2, size: 128, align: 32, elements: !859, templateParams: !23, identifier: "58af0add5acfd955243155c85c31d08")
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !858, file: !2, baseType: !44, size: 32, align: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !858, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !858, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !858, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!864 = !{!865}
!865 = !DILocalVariable(name: "x", arg: 1, scope: !854, file: !575, line: 318, type: !857)
!866 = !{!867}
!867 = !DITemplateTypeParameter(name: "T", type: !858)
!868 = !DILocation(line: 318, column: 30, scope: !854)
!869 = !DILocation(line: 319, column: 23, scope: !854)
!870 = !DILocalVariable(name: "x", scope: !871, file: !575, line: 319, type: !857, align: 8)
!871 = distinct !DISubprogram(name: "new<(f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h676272c658c09ad8E", scope: !805, file: !575, line: 329, type: !872, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !866, retainedNodes: !877)
!872 = !DISubroutineType(types: !873)
!873 = !{!805, !857, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f32, f32, f32, f32), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !875, size: 64, align: 64, dwarfAddressSpace: 0)
!875 = !DISubroutineType(types: !876)
!876 = !{!579, !857, !597}
!877 = !{!870, !878}
!878 = !DILocalVariable(name: "f", scope: !871, file: !575, line: 319, type: !874, align: 8)
!879 = !DILocation(line: 319, column: 13, scope: !871, inlinedAt: !880)
!880 = !DILocation(line: 319, column: 13, scope: !854)
!881 = !DILocation(line: 319, column: 26, scope: !854)
!882 = !DILocation(line: 320, column: 10, scope: !854)
!883 = distinct !DISubprogram(name: "new_debug<(i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h60ca90ee08418d6eE", scope: !805, file: !575, line: 318, type: !884, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !893, retainedNodes: !891)
!884 = !DISubroutineType(types: !885)
!885 = !{!805, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(i64, i64)", baseType: !887, size: 64, align: 64, dwarfAddressSpace: 0)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "(i64, i64)", file: !2, size: 128, align: 64, elements: !888, templateParams: !23, identifier: "b3bb0958dbdf65ebea4a9d1432585c8c")
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !887, file: !2, baseType: !77, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !887, file: !2, baseType: !77, size: 64, align: 64, offset: 64)
!891 = !{!892}
!892 = !DILocalVariable(name: "x", arg: 1, scope: !883, file: !575, line: 318, type: !886)
!893 = !{!894}
!894 = !DITemplateTypeParameter(name: "T", type: !887)
!895 = !DILocation(line: 318, column: 30, scope: !883)
!896 = !DILocation(line: 319, column: 23, scope: !883)
!897 = !DILocalVariable(name: "x", scope: !898, file: !575, line: 319, type: !886, align: 8)
!898 = distinct !DISubprogram(name: "new<(i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h427b171155a5f740E", scope: !805, file: !575, line: 329, type: !899, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !893, retainedNodes: !904)
!899 = !DISubroutineType(types: !900)
!900 = !{!805, !886, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(i64, i64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !902, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{!579, !886, !597}
!904 = !{!897, !905}
!905 = !DILocalVariable(name: "f", scope: !898, file: !575, line: 319, type: !901, align: 8)
!906 = !DILocation(line: 319, column: 13, scope: !898, inlinedAt: !907)
!907 = !DILocation(line: 319, column: 13, scope: !883)
!908 = !DILocation(line: 319, column: 26, scope: !883)
!909 = !DILocation(line: 320, column: 10, scope: !883)
!910 = distinct !DISubprogram(name: "new_debug<(u128, u128)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h716795f47091129dE", scope: !805, file: !575, line: 318, type: !911, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !920, retainedNodes: !918)
!911 = !DISubroutineType(types: !912)
!912 = !{!805, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(u128, u128)", baseType: !914, size: 64, align: 64, dwarfAddressSpace: 0)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u128, u128)", file: !2, size: 256, align: 64, elements: !915, templateParams: !23, identifier: "1b28922524d704e42db756a3452cbb80")
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !914, file: !2, baseType: !151, size: 128, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !914, file: !2, baseType: !151, size: 128, align: 64, offset: 128)
!918 = !{!919}
!919 = !DILocalVariable(name: "x", arg: 1, scope: !910, file: !575, line: 318, type: !913)
!920 = !{!921}
!921 = !DITemplateTypeParameter(name: "T", type: !914)
!922 = !DILocation(line: 318, column: 30, scope: !910)
!923 = !DILocation(line: 319, column: 23, scope: !910)
!924 = !DILocalVariable(name: "x", scope: !925, file: !575, line: 319, type: !913, align: 8)
!925 = distinct !DISubprogram(name: "new<(u128, u128)>", linkageName: "_ZN4core3fmt10ArgumentV13new17habe151516091dbe4E", scope: !805, file: !575, line: 329, type: !926, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !920, retainedNodes: !931)
!926 = !DISubroutineType(types: !927)
!927 = !{!805, !913, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(u128, u128), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !929, size: 64, align: 64, dwarfAddressSpace: 0)
!929 = !DISubroutineType(types: !930)
!930 = !{!579, !913, !597}
!931 = !{!924, !932}
!932 = !DILocalVariable(name: "f", scope: !925, file: !575, line: 319, type: !928, align: 8)
!933 = !DILocation(line: 319, column: 13, scope: !925, inlinedAt: !934)
!934 = !DILocation(line: 319, column: 13, scope: !910)
!935 = !DILocation(line: 319, column: 26, scope: !910)
!936 = !DILocation(line: 320, column: 10, scope: !910)
!937 = distinct !DISubprogram(name: "new_debug<(f32, f32, f32, f32, f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h78c7b143b8da556cE", scope: !805, file: !575, line: 318, type: !938, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !953, retainedNodes: !951)
!938 = !DISubroutineType(types: !939)
!939 = !{!805, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f32, f32, f32, f32, f32, f32, f32, f32)", baseType: !941, size: 64, align: 64, dwarfAddressSpace: 0)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f32, f32, f32, f32, f32, f32, f32, f32)", file: !2, size: 256, align: 32, elements: !942, templateParams: !23, identifier: "fc364d873fca01b6dcaff645f521398f")
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !941, file: !2, baseType: !44, size: 32, align: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__4", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__5", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__6", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__7", scope: !941, file: !2, baseType: !44, size: 32, align: 32, offset: 224)
!951 = !{!952}
!952 = !DILocalVariable(name: "x", arg: 1, scope: !937, file: !575, line: 318, type: !940)
!953 = !{!954}
!954 = !DITemplateTypeParameter(name: "T", type: !941)
!955 = !DILocation(line: 318, column: 30, scope: !937)
!956 = !DILocation(line: 319, column: 23, scope: !937)
!957 = !DILocalVariable(name: "x", scope: !958, file: !575, line: 319, type: !940, align: 8)
!958 = distinct !DISubprogram(name: "new<(f32, f32, f32, f32, f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h63664119088e27bbE", scope: !805, file: !575, line: 329, type: !959, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !953, retainedNodes: !964)
!959 = !DISubroutineType(types: !960)
!960 = !{!805, !940, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f32, f32, f32, f32, f32, f32, f32, f32), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !962, size: 64, align: 64, dwarfAddressSpace: 0)
!962 = !DISubroutineType(types: !963)
!963 = !{!579, !940, !597}
!964 = !{!957, !965}
!965 = !DILocalVariable(name: "f", scope: !958, file: !575, line: 319, type: !961, align: 8)
!966 = !DILocation(line: 319, column: 13, scope: !958, inlinedAt: !967)
!967 = !DILocation(line: 319, column: 13, scope: !937)
!968 = !DILocation(line: 319, column: 26, scope: !937)
!969 = !DILocation(line: 320, column: 10, scope: !937)
!970 = distinct !DISubprogram(name: "new_debug<(i64, i64, i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h86daa514f707743eE", scope: !805, file: !575, line: 318, type: !971, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !982, retainedNodes: !980)
!971 = !DISubroutineType(types: !972)
!972 = !{!805, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(i64, i64, i64, i64)", baseType: !974, size: 64, align: 64, dwarfAddressSpace: 0)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "(i64, i64, i64, i64)", file: !2, size: 256, align: 64, elements: !975, templateParams: !23, identifier: "686f3566065c607aecb52397a9a00120")
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !974, file: !2, baseType: !77, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !974, file: !2, baseType: !77, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !974, file: !2, baseType: !77, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !974, file: !2, baseType: !77, size: 64, align: 64, offset: 192)
!980 = !{!981}
!981 = !DILocalVariable(name: "x", arg: 1, scope: !970, file: !575, line: 318, type: !973)
!982 = !{!983}
!983 = !DITemplateTypeParameter(name: "T", type: !974)
!984 = !DILocation(line: 318, column: 30, scope: !970)
!985 = !DILocation(line: 319, column: 23, scope: !970)
!986 = !DILocalVariable(name: "x", scope: !987, file: !575, line: 319, type: !973, align: 8)
!987 = distinct !DISubprogram(name: "new<(i64, i64, i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h040ce075dd85ef8aE", scope: !805, file: !575, line: 329, type: !988, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !982, retainedNodes: !993)
!988 = !DISubroutineType(types: !989)
!989 = !{!805, !973, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(i64, i64, i64, i64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !991, size: 64, align: 64, dwarfAddressSpace: 0)
!991 = !DISubroutineType(types: !992)
!992 = !{!579, !973, !597}
!993 = !{!986, !994}
!994 = !DILocalVariable(name: "f", scope: !987, file: !575, line: 319, type: !990, align: 8)
!995 = !DILocation(line: 319, column: 13, scope: !987, inlinedAt: !996)
!996 = !DILocation(line: 319, column: 13, scope: !970)
!997 = !DILocation(line: 319, column: 26, scope: !970)
!998 = !DILocation(line: 320, column: 10, scope: !970)
!999 = distinct !DISubprogram(name: "new_debug<(f64, f64, f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17ha4c637eb5823e7b1E", scope: !805, file: !575, line: 318, type: !1000, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !1011, retainedNodes: !1009)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!805, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f64, f64, f64, f64)", baseType: !1003, size: 64, align: 64, dwarfAddressSpace: 0)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f64, f64, f64, f64)", file: !2, size: 256, align: 64, elements: !1004, templateParams: !23, identifier: "920d264c29fd38ca7f4156eb96923c3b")
!1004 = !{!1005, !1006, !1007, !1008}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1003, file: !2, baseType: !52, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1003, file: !2, baseType: !52, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !1003, file: !2, baseType: !52, size: 64, align: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !1003, file: !2, baseType: !52, size: 64, align: 64, offset: 192)
!1009 = !{!1010}
!1010 = !DILocalVariable(name: "x", arg: 1, scope: !999, file: !575, line: 318, type: !1002)
!1011 = !{!1012}
!1012 = !DITemplateTypeParameter(name: "T", type: !1003)
!1013 = !DILocation(line: 318, column: 30, scope: !999)
!1014 = !DILocation(line: 319, column: 23, scope: !999)
!1015 = !DILocalVariable(name: "x", scope: !1016, file: !575, line: 319, type: !1002, align: 8)
!1016 = distinct !DISubprogram(name: "new<(f64, f64, f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h783b3001291e7cb3E", scope: !805, file: !575, line: 329, type: !1017, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !1011, retainedNodes: !1022)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!805, !1002, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f64, f64, f64, f64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !1020, size: 64, align: 64, dwarfAddressSpace: 0)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!579, !1002, !597}
!1022 = !{!1015, !1023}
!1023 = !DILocalVariable(name: "f", scope: !1016, file: !575, line: 319, type: !1019, align: 8)
!1024 = !DILocation(line: 319, column: 13, scope: !1016, inlinedAt: !1025)
!1025 = !DILocation(line: 319, column: 13, scope: !999)
!1026 = !DILocation(line: 319, column: 26, scope: !999)
!1027 = !DILocation(line: 320, column: 10, scope: !999)
!1028 = distinct !DISubprogram(name: "new_debug<(f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17ha5b0cb4c01b7a658E", scope: !805, file: !575, line: 318, type: !1029, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !1038, retainedNodes: !1036)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!805, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f64, f64)", baseType: !1032, size: 64, align: 64, dwarfAddressSpace: 0)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f64, f64)", file: !2, size: 128, align: 64, elements: !1033, templateParams: !23, identifier: "d312788ec1eb8312ff38c59304530953")
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1032, file: !2, baseType: !52, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1032, file: !2, baseType: !52, size: 64, align: 64, offset: 64)
!1036 = !{!1037}
!1037 = !DILocalVariable(name: "x", arg: 1, scope: !1028, file: !575, line: 318, type: !1031)
!1038 = !{!1039}
!1039 = !DITemplateTypeParameter(name: "T", type: !1032)
!1040 = !DILocation(line: 318, column: 30, scope: !1028)
!1041 = !DILocation(line: 319, column: 23, scope: !1028)
!1042 = !DILocalVariable(name: "x", scope: !1043, file: !575, line: 319, type: !1031, align: 8)
!1043 = distinct !DISubprogram(name: "new<(f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h2e630a176f13f753E", scope: !805, file: !575, line: 329, type: !1044, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !210, templateParams: !1038, retainedNodes: !1049)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!805, !1031, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f64, f64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !1047, size: 64, align: 64, dwarfAddressSpace: 0)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!579, !1031, !597}
!1049 = !{!1042, !1050}
!1050 = !DILocalVariable(name: "f", scope: !1043, file: !575, line: 319, type: !1046, align: 8)
