; ModuleID = '265e8e3tgsp6q2e5'
source_filename = "265e8e3tgsp6q2e5"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::fmt::builders::DebugTuple" = type { %"core::fmt::Formatter"*, i64, i8, i8, [6 x i8] }
%"x86::ShuffleVectors" = type { <4 x float>, <2 x double>, <8 x float>, <4 x double>, <4 x double>, <2 x i64>, <2 x i64>, <2 x i64>, <2 x i64>, <4 x i64>, <4 x i64>, <4 x i64>, <2 x i64>, [2 x i64], <4 x i64>, <4 x i64>, <4 x i64>, <2 x i64>, [2 x i64] }
%"x86::VectorInitLists" = type { <4 x float>, [2 x i64], <8 x float>, <2 x double>, [2 x i64], <4 x double>, <2 x i64>, [2 x i64], <4 x i64> }

@alloc395 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1
@alloc396 = private unnamed_addr constant <{ i8*, [8 x i8] }> <{ i8* getelementptr inbounds (<{ [12 x i8] }>, <{ [12 x i8] }>* @alloc395, i32 0, i32 0, i32 0), [8 x i8] c"\0C\00\00\00\00\00\00\00" }>, align 8
@alloc467 = private unnamed_addr constant <{}> zeroinitializer, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&f64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !14, identifier: "6b62788b1bf0b7aff81411b24fc1f74")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f64", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!14 = !{}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "<&i64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !18, vtableHolder: !23, templateParams: !14, identifier: "e169c1c375cda469280253610f57bfe1")
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !17, file: !2, baseType: !6, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !17, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i64", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "<&u128 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !27, isLocal: true, isDefinition: true)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u128 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !28, vtableHolder: !33, templateParams: !14, identifier: "879c0c34658d2d688b698333d8a710a9")
!28 = !{!29, !30, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !27, file: !2, baseType: !6, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !27, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !27, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !27, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u128", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "<&f32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !38, vtableHolder: !43, templateParams: !14, identifier: "167dd032769a3561d40fd3e6fbb4e28f")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !37, file: !2, baseType: !6, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !37, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "UNSAFETY_ERROR", linkageName: "_ZN10simd_tests8test_x8614UNSAFETY_ERROR17h00745e0557a49564E", scope: !47, file: !49, line: 48, type: !50, isLocal: true, isDefinition: true, align: 64)
!47 = !DINamespace(name: "test_x86", scope: !48)
!48 = !DINamespace(name: "simd_tests", scope: null)
!49 = !DIFile(filename: "src/test_x86.rs", directory: "/home/calvin/git/c2rust/tests/simd.x86_64", checksumkind: CSK_MD5, checksum: "bec54ddeaa1892c032b95e166aa87f8e")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !51, templateParams: !14, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!51 = !{!52, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !50, file: !2, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !50, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "rust_static_m128", scope: !58, file: !59, line: 421, type: !60, isLocal: false, isDefinition: true, align: 128)
!58 = !DINamespace(name: "x86", scope: !48)
!59 = !DIFile(filename: "src/x86.rs", directory: "/home/calvin/git/c2rust/tests/simd.x86_64", checksumkind: CSK_MD5, checksum: "c7cdc21ec3f54d7f1d7329f97225b4f5")
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m128", scope: !61, file: !2, size: 128, align: 128, elements: !64, templateParams: !14, identifier: "e514506f95fb400ecb8e2395edadda3")
!61 = !DINamespace(name: "x86", scope: !62)
!62 = !DINamespace(name: "core_arch", scope: !63)
!63 = !DINamespace(name: "core", scope: null)
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !2, baseType: !44, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !60, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !60, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !60, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "rust_static_m256", scope: !58, file: !59, line: 425, type: !71, isLocal: false, isDefinition: true, align: 256)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m256", scope: !61, file: !2, size: 256, align: 256, elements: !72, templateParams: !14, identifier: "c4346e58c6559959a36ec29775e8049b")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !71, file: !2, baseType: !44, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__4", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__5", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__6", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__7", scope: !71, file: !2, baseType: !44, size: 32, align: 32, offset: 224)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "rust_static_m128d", scope: !58, file: !59, line: 438, type: !83, isLocal: false, isDefinition: true, align: 128)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m128d", scope: !61, file: !2, size: 128, align: 128, elements: !84, templateParams: !14, identifier: "9dafd537a537f092c38d1d60e65bb548")
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !83, file: !2, baseType: !13, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !83, file: !2, baseType: !13, size: 64, align: 64, offset: 64)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "rust_static_m256d", scope: !58, file: !59, line: 442, type: !89, isLocal: false, isDefinition: true, align: 256)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m256d", scope: !61, file: !2, size: 256, align: 256, elements: !90, templateParams: !14, identifier: "c78563ccb47b9afce96960d15fa07b77")
!90 = !{!91, !92, !93, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !89, file: !2, baseType: !13, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !89, file: !2, baseType: !13, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !89, file: !2, baseType: !13, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !89, file: !2, baseType: !13, size: 64, align: 64, offset: 192)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "rust_static_m128i", scope: !58, file: !59, line: 446, type: !97, isLocal: false, isDefinition: true, align: 128)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m128i", scope: !61, file: !2, size: 128, align: 128, elements: !98, templateParams: !14, identifier: "2d02d6ddeba41fb67870585adaf8c4a9")
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !97, file: !2, baseType: !24, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !97, file: !2, baseType: !24, size: 64, align: 64, offset: 64)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "rust_static_m256i", scope: !58, file: !59, line: 450, type: !103, isLocal: false, isDefinition: true, align: 256)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "__m256i", scope: !61, file: !2, size: 256, align: 256, elements: !104, templateParams: !14, identifier: "8576ddf74d4b37259070b6243af50027")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !103, file: !2, baseType: !24, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !103, file: !2, baseType: !24, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !103, file: !2, baseType: !24, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !103, file: !2, baseType: !24, size: 64, align: 64, offset: 192)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "rust_static_uninit_m128", scope: !58, file: !59, line: 459, type: !60, isLocal: false, isDefinition: true, align: 128)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "rust_static_uninit_m256", scope: !58, file: !59, line: 463, type: !71, isLocal: false, isDefinition: true, align: 256)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "rust_static_uninit_m128d", scope: !58, file: !59, line: 467, type: !83, isLocal: false, isDefinition: true, align: 128)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "rust_static_uninit_m256d", scope: !58, file: !59, line: 471, type: !89, isLocal: false, isDefinition: true, align: 256)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "rust_static_uninit_m128i", scope: !58, file: !59, line: 475, type: !97, isLocal: false, isDefinition: true, align: 128)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "rust_static_uninit_m256i", scope: !58, file: !59, line: 479, type: !103, isLocal: false, isDefinition: true, align: 256)
!121 = !{i32 7, !"PIC Level", i32 2}
!122 = !{i32 2, !"RtLibUseGOT", i32 1}
!123 = !{i32 2, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !126, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !127, globals: !137)
!126 = !DIFile(filename: "src/lib.rs/@/265e8e3tgsp6q2e5", directory: "/home/calvin/git/c2rust/tests/simd.x86_64")
!127 = !{!128}
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !129, file: !2, baseType: !54, size: 8, align: 8, flags: DIFlagEnumClass, elements: !132)
!129 = !DINamespace(name: "v1", scope: !130)
!130 = !DINamespace(name: "rt", scope: !131)
!131 = !DINamespace(name: "fmt", scope: !63)
!132 = !{!133, !134, !135, !136}
!133 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!137 = !{!0, !15, !25, !35, !45, !56, !69, !81, !87, !95, !101, !109, !111, !113, !115, !117, !119}
!138 = distinct !DISubprogram(name: "fmt<u128>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h06b157fad8db2c76E", scope: !140, file: !139, line: 2361, type: !141, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !201, retainedNodes: !198)
!139 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!140 = !DINamespace(name: "{impl#59}", scope: !131)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !161, !162}
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !144, file: !2, size: 8, align: 8, elements: !145, templateParams: !14, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!144 = !DINamespace(name: "result", scope: !63)
!145 = !{!146}
!146 = !DICompositeType(tag: DW_TAG_variant_part, scope: !143, file: !2, size: 8, align: 8, elements: !147, templateParams: !14, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !160)
!147 = !{!148, !156}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !146, file: !2, baseType: !149, size: 8, align: 8, extraData: i64 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !143, file: !2, size: 8, align: 8, elements: !150, templateParams: !152, identifier: "cea751326735c343faf647063a65ad14")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !149, file: !2, baseType: !7, align: 8, offset: 8)
!152 = !{!153, !154}
!153 = !DITemplateTypeParameter(name: "T", type: !7)
!154 = !DITemplateTypeParameter(name: "E", type: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !131, file: !2, align: 8, elements: !14, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !146, file: !2, baseType: !157, size: 8, align: 8, extraData: i64 1)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !143, file: !2, size: 8, align: 8, elements: !158, templateParams: !152, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !155, align: 8, offset: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !143, file: !2, baseType: !54, size: 8, align: 8, flags: DIFlagArtificial)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u128", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !131, file: !2, size: 512, align: 64, elements: !164, templateParams: !14, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!164 = !{!165, !167, !169, !170, !186, !187}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !163, file: !2, baseType: !166, size: 32, align: 32, offset: 384)
!166 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !163, file: !2, baseType: !168, size: 32, align: 32, offset: 416)
!168 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !163, file: !2, baseType: !128, size: 8, align: 8, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !163, file: !2, baseType: !171, size: 128, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !172, file: !2, size: 128, align: 64, elements: !173, templateParams: !14, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!172 = !DINamespace(name: "option", scope: !63)
!173 = !{!174}
!174 = !DICompositeType(tag: DW_TAG_variant_part, scope: !171, file: !2, size: 128, align: 64, elements: !175, templateParams: !14, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !184)
!175 = !{!176, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !174, file: !2, baseType: !177, size: 128, align: 64, extraData: i64 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !171, file: !2, size: 128, align: 64, elements: !14, templateParams: !178, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "T", type: !9)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !174, file: !2, baseType: !181, size: 128, align: 64, extraData: i64 1)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !171, file: !2, size: 128, align: 64, elements: !182, templateParams: !178, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !181, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagArtificial)
!185 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !163, file: !2, baseType: !171, size: 128, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !163, file: !2, baseType: !188, size: 128, align: 64, offset: 256)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !189, templateParams: !14, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!189 = !{!190, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !188, file: !2, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !14, identifier: "abb712b259efc5e79bb67900edf24920")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !188, file: !2, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !195, size: 64, align: 64, dwarfAddressSpace: 0)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 3, lowerBound: 0)
!198 = !{!199, !200}
!199 = !DILocalVariable(name: "self", arg: 1, scope: !138, file: !139, line: 2361, type: !161)
!200 = !DILocalVariable(name: "f", arg: 2, scope: !138, file: !139, line: 2361, type: !162)
!201 = !{!202}
!202 = !DITemplateTypeParameter(name: "T", type: !34)
!203 = !DILocation(line: 2361, column: 20, scope: !138)
!204 = !DILocation(line: 2361, column: 27, scope: !138)
!205 = !DILocation(line: 2361, column: 71, scope: !138)
!206 = !{i64 8}
!207 = !DILocation(line: 2361, column: 62, scope: !138)
!208 = !DILocation(line: 2361, column: 84, scope: !138)
!209 = distinct !DISubprogram(name: "fmt<i64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h46b8b7755cf246d4E", scope: !140, file: !139, line: 2361, type: !210, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !216, retainedNodes: !213)
!210 = !DISubroutineType(types: !211)
!211 = !{!143, !212, !162}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i64", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!213 = !{!214, !215}
!214 = !DILocalVariable(name: "self", arg: 1, scope: !209, file: !139, line: 2361, type: !212)
!215 = !DILocalVariable(name: "f", arg: 2, scope: !209, file: !139, line: 2361, type: !162)
!216 = !{!217}
!217 = !DITemplateTypeParameter(name: "T", type: !24)
!218 = !DILocation(line: 2361, column: 20, scope: !209)
!219 = !DILocation(line: 2361, column: 27, scope: !209)
!220 = !DILocation(line: 2361, column: 71, scope: !209)
!221 = !DILocation(line: 2361, column: 62, scope: !209)
!222 = !DILocation(line: 2361, column: 84, scope: !209)
!223 = distinct !DISubprogram(name: "fmt<f32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h58c923d00a268bebE", scope: !140, file: !139, line: 2361, type: !224, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !230, retainedNodes: !227)
!224 = !DISubroutineType(types: !225)
!225 = !{!143, !226, !162}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f32", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !{!228, !229}
!228 = !DILocalVariable(name: "self", arg: 1, scope: !223, file: !139, line: 2361, type: !226)
!229 = !DILocalVariable(name: "f", arg: 2, scope: !223, file: !139, line: 2361, type: !162)
!230 = !{!231}
!231 = !DITemplateTypeParameter(name: "T", type: !44)
!232 = !DILocation(line: 2361, column: 20, scope: !223)
!233 = !DILocation(line: 2361, column: 27, scope: !223)
!234 = !DILocation(line: 2361, column: 71, scope: !223)
!235 = !{i64 4}
!236 = !DILocation(line: 2361, column: 62, scope: !223)
!237 = !DILocation(line: 2361, column: 84, scope: !223)
!238 = distinct !DISubprogram(name: "fmt<f64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h6ebfe055a148e83fE", scope: !140, file: !139, line: 2361, type: !239, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !245, retainedNodes: !242)
!239 = !DISubroutineType(types: !240)
!240 = !{!143, !241, !162}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f64", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!242 = !{!243, !244}
!243 = !DILocalVariable(name: "self", arg: 1, scope: !238, file: !139, line: 2361, type: !241)
!244 = !DILocalVariable(name: "f", arg: 2, scope: !238, file: !139, line: 2361, type: !162)
!245 = !{!246}
!246 = !DITemplateTypeParameter(name: "T", type: !13)
!247 = !DILocation(line: 2361, column: 20, scope: !238)
!248 = !DILocation(line: 2361, column: 27, scope: !238)
!249 = !DILocation(line: 2361, column: 71, scope: !238)
!250 = !DILocation(line: 2361, column: 62, scope: !238)
!251 = !DILocation(line: 2361, column: 84, scope: !238)
!252 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN44_$LT$$RF$T$u20$as$u20$core..fmt..Display$GT$3fmt17h79000859ac9be2d0E", scope: !253, file: !139, line: 2361, type: !254, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !260, retainedNodes: !257)
!253 = !DINamespace(name: "{impl#61}", scope: !131)
!254 = !DISubroutineType(types: !255)
!255 = !{!143, !256, !162}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !{!258, !259}
!258 = !DILocalVariable(name: "self", arg: 1, scope: !252, file: !139, line: 2361, type: !256)
!259 = !DILocalVariable(name: "f", arg: 2, scope: !252, file: !139, line: 2361, type: !162)
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "T", type: !54)
!262 = !DILocation(line: 2361, column: 20, scope: !252)
!263 = !DILocation(line: 2361, column: 27, scope: !252)
!264 = !DILocation(line: 2361, column: 71, scope: !252)
!265 = !{i64 1}
!266 = !DILocation(line: 2361, column: 62, scope: !252)
!267 = !DILocation(line: 2361, column: 84, scope: !252)
!268 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$f32$GT$2ne17hea15636ecbfb2d41E", scope: !270, file: !269, line: 1336, type: !273, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !276)
!269 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!270 = !DINamespace(name: "{impl#33}", scope: !271)
!271 = !DINamespace(name: "impls", scope: !272)
!272 = !DINamespace(name: "cmp", scope: !63)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !43, !43}
!275 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!276 = !{!277, !278}
!277 = !DILocalVariable(name: "self", arg: 1, scope: !268, file: !269, line: 1336, type: !43)
!278 = !DILocalVariable(name: "other", arg: 2, scope: !268, file: !269, line: 1336, type: !43)
!279 = !DILocation(line: 1336, column: 23, scope: !268)
!280 = !DILocation(line: 1336, column: 30, scope: !268)
!281 = !DILocation(line: 1336, column: 52, scope: !268)
!282 = !DILocation(line: 1336, column: 63, scope: !268)
!283 = !DILocation(line: 1336, column: 73, scope: !268)
!284 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$f64$GT$2ne17h9f2c8e84b758be43E", scope: !285, file: !269, line: 1336, type: !286, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !288)
!285 = !DINamespace(name: "{impl#34}", scope: !271)
!286 = !DISubroutineType(types: !287)
!287 = !{!275, !12, !12}
!288 = !{!289, !290}
!289 = !DILocalVariable(name: "self", arg: 1, scope: !284, file: !269, line: 1336, type: !12)
!290 = !DILocalVariable(name: "other", arg: 2, scope: !284, file: !269, line: 1336, type: !12)
!291 = !DILocation(line: 1336, column: 23, scope: !284)
!292 = !DILocation(line: 1336, column: 30, scope: !284)
!293 = !DILocation(line: 1336, column: 52, scope: !284)
!294 = !DILocation(line: 1336, column: 63, scope: !284)
!295 = !DILocation(line: 1336, column: 73, scope: !284)
!296 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls54_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$i64$GT$2ne17h20ae9c25332afb02E", scope: !297, file: !269, line: 1336, type: !298, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !300)
!297 = !DINamespace(name: "{impl#31}", scope: !271)
!298 = !DISubroutineType(types: !299)
!299 = !{!275, !23, !23}
!300 = !{!301, !302}
!301 = !DILocalVariable(name: "self", arg: 1, scope: !296, file: !269, line: 1336, type: !23)
!302 = !DILocalVariable(name: "other", arg: 2, scope: !296, file: !269, line: 1336, type: !23)
!303 = !DILocation(line: 1336, column: 23, scope: !296)
!304 = !DILocation(line: 1336, column: 30, scope: !296)
!305 = !DILocation(line: 1336, column: 52, scope: !296)
!306 = !DILocation(line: 1336, column: 63, scope: !296)
!307 = !DILocation(line: 1336, column: 73, scope: !296)
!308 = distinct !DISubprogram(name: "ne", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$u128$GT$2ne17hea11bfc600ff2ff7E", scope: !309, file: !269, line: 1336, type: !310, scopeLine: 1336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !312)
!309 = !DINamespace(name: "{impl#26}", scope: !271)
!310 = !DISubroutineType(types: !311)
!311 = !{!275, !33, !33}
!312 = !{!313, !314}
!313 = !DILocalVariable(name: "self", arg: 1, scope: !308, file: !269, line: 1336, type: !33)
!314 = !DILocalVariable(name: "other", arg: 2, scope: !308, file: !269, line: 1336, type: !33)
!315 = !DILocation(line: 1336, column: 23, scope: !308)
!316 = !DILocation(line: 1336, column: 30, scope: !308)
!317 = !DILocation(line: 1336, column: 52, scope: !308)
!318 = !DILocation(line: 1336, column: 63, scope: !308)
!319 = !DILocation(line: 1336, column: 73, scope: !308)
!320 = distinct !DISubprogram(name: "new_display<&str>", linkageName: "_ZN4core3fmt10ArgumentV111new_display17h7bc58b1c67ca01dbE", scope: !321, file: !139, line: 318, type: !331, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !335, retainedNodes: !333)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !131, file: !2, size: 128, align: 64, elements: !322, templateParams: !14, identifier: "753c369e46bf484710f4d769a3fba395")
!322 = !{!323, !327}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !321, file: !2, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !326, file: !2, align: 8, elements: !14, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!326 = !DINamespace(name: "{extern#0}", scope: !131)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !321, file: !2, baseType: !328, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !329, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DISubroutineType(types: !330)
!330 = !{!143, !324, !162}
!331 = !DISubroutineType(types: !332)
!332 = !{!321, !256}
!333 = !{!334}
!334 = !DILocalVariable(name: "x", arg: 1, scope: !320, file: !139, line: 318, type: !256)
!335 = !{!336}
!336 = !DITemplateTypeParameter(name: "T", type: !50)
!337 = !DILocation(line: 318, column: 30, scope: !320)
!338 = !DILocation(line: 319, column: 23, scope: !320)
!339 = !DILocalVariable(name: "x", scope: !340, file: !139, line: 319, type: !256, align: 8)
!340 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN4core3fmt10ArgumentV13new17hf71a9569182399e1E", scope: !321, file: !139, line: 329, type: !341, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !335, retainedNodes: !344)
!341 = !DISubroutineType(types: !342)
!342 = !{!321, !256, !343}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&str, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !254, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !{!339, !345}
!345 = !DILocalVariable(name: "f", scope: !340, file: !139, line: 319, type: !343, align: 8)
!346 = !DILocation(line: 319, column: 13, scope: !340, inlinedAt: !347)
!347 = !DILocation(line: 319, column: 13, scope: !320)
!348 = !DILocation(line: 319, column: 26, scope: !320)
!349 = !DILocation(line: 320, column: 10, scope: !320)
!350 = distinct !DISubprogram(name: "new_debug<(i64, i64, i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h05172bf50805cfe3E", scope: !321, file: !139, line: 318, type: !351, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !362, retainedNodes: !360)
!351 = !DISubroutineType(types: !352)
!352 = !{!321, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(i64, i64, i64, i64)", baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "(i64, i64, i64, i64)", file: !2, size: 256, align: 64, elements: !355, templateParams: !14, identifier: "686f3566065c607aecb52397a9a00120")
!355 = !{!356, !357, !358, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !354, file: !2, baseType: !24, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !354, file: !2, baseType: !24, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !354, file: !2, baseType: !24, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !354, file: !2, baseType: !24, size: 64, align: 64, offset: 192)
!360 = !{!361}
!361 = !DILocalVariable(name: "x", arg: 1, scope: !350, file: !139, line: 318, type: !353)
!362 = !{!363}
!363 = !DITemplateTypeParameter(name: "T", type: !354)
!364 = !DILocation(line: 318, column: 30, scope: !350)
!365 = !DILocation(line: 319, column: 23, scope: !350)
!366 = !DILocalVariable(name: "x", scope: !367, file: !139, line: 319, type: !353, align: 8)
!367 = distinct !DISubprogram(name: "new<(i64, i64, i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h110122f0a72b5021E", scope: !321, file: !139, line: 329, type: !368, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !362, retainedNodes: !373)
!368 = !DISubroutineType(types: !369)
!369 = !{!321, !353, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(i64, i64, i64, i64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !371, size: 64, align: 64, dwarfAddressSpace: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!143, !353, !162}
!373 = !{!366, !374}
!374 = !DILocalVariable(name: "f", scope: !367, file: !139, line: 319, type: !370, align: 8)
!375 = !DILocation(line: 319, column: 13, scope: !367, inlinedAt: !376)
!376 = !DILocation(line: 319, column: 13, scope: !350)
!377 = !DILocation(line: 319, column: 26, scope: !350)
!378 = !DILocation(line: 320, column: 10, scope: !350)
!379 = distinct !DISubprogram(name: "new_debug<(f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h0e3129153508b829E", scope: !321, file: !139, line: 318, type: !380, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !389, retainedNodes: !387)
!380 = !DISubroutineType(types: !381)
!381 = !{!321, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f64, f64)", baseType: !383, size: 64, align: 64, dwarfAddressSpace: 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f64, f64)", file: !2, size: 128, align: 64, elements: !384, templateParams: !14, identifier: "d312788ec1eb8312ff38c59304530953")
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !2, baseType: !13, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !383, file: !2, baseType: !13, size: 64, align: 64, offset: 64)
!387 = !{!388}
!388 = !DILocalVariable(name: "x", arg: 1, scope: !379, file: !139, line: 318, type: !382)
!389 = !{!390}
!390 = !DITemplateTypeParameter(name: "T", type: !383)
!391 = !DILocation(line: 318, column: 30, scope: !379)
!392 = !DILocation(line: 319, column: 23, scope: !379)
!393 = !DILocalVariable(name: "x", scope: !394, file: !139, line: 319, type: !382, align: 8)
!394 = distinct !DISubprogram(name: "new<(f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h94f0a9c6141a15afE", scope: !321, file: !139, line: 329, type: !395, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !389, retainedNodes: !400)
!395 = !DISubroutineType(types: !396)
!396 = !{!321, !382, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f64, f64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!143, !382, !162}
!400 = !{!393, !401}
!401 = !DILocalVariable(name: "f", scope: !394, file: !139, line: 319, type: !397, align: 8)
!402 = !DILocation(line: 319, column: 13, scope: !394, inlinedAt: !403)
!403 = !DILocation(line: 319, column: 13, scope: !379)
!404 = !DILocation(line: 319, column: 26, scope: !379)
!405 = !DILocation(line: 320, column: 10, scope: !379)
!406 = distinct !DISubprogram(name: "new_debug<(i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h1687d6d16f1bf525E", scope: !321, file: !139, line: 318, type: !407, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !416, retainedNodes: !414)
!407 = !DISubroutineType(types: !408)
!408 = !{!321, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(i64, i64)", baseType: !410, size: 64, align: 64, dwarfAddressSpace: 0)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "(i64, i64)", file: !2, size: 128, align: 64, elements: !411, templateParams: !14, identifier: "b3bb0958dbdf65ebea4a9d1432585c8c")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !2, baseType: !24, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !410, file: !2, baseType: !24, size: 64, align: 64, offset: 64)
!414 = !{!415}
!415 = !DILocalVariable(name: "x", arg: 1, scope: !406, file: !139, line: 318, type: !409)
!416 = !{!417}
!417 = !DITemplateTypeParameter(name: "T", type: !410)
!418 = !DILocation(line: 318, column: 30, scope: !406)
!419 = !DILocation(line: 319, column: 23, scope: !406)
!420 = !DILocalVariable(name: "x", scope: !421, file: !139, line: 319, type: !409, align: 8)
!421 = distinct !DISubprogram(name: "new<(i64, i64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h04d4a19de8c924a4E", scope: !321, file: !139, line: 329, type: !422, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !416, retainedNodes: !427)
!422 = !DISubroutineType(types: !423)
!423 = !{!321, !409, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(i64, i64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !425, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !DISubroutineType(types: !426)
!426 = !{!143, !409, !162}
!427 = !{!420, !428}
!428 = !DILocalVariable(name: "f", scope: !421, file: !139, line: 319, type: !424, align: 8)
!429 = !DILocation(line: 319, column: 13, scope: !421, inlinedAt: !430)
!430 = !DILocation(line: 319, column: 13, scope: !406)
!431 = !DILocation(line: 319, column: 26, scope: !406)
!432 = !DILocation(line: 320, column: 10, scope: !406)
!433 = distinct !DISubprogram(name: "new_debug<(f64, f64, f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h5529c044314b5e4dE", scope: !321, file: !139, line: 318, type: !434, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !445, retainedNodes: !443)
!434 = !DISubroutineType(types: !435)
!435 = !{!321, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f64, f64, f64, f64)", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f64, f64, f64, f64)", file: !2, size: 256, align: 64, elements: !438, templateParams: !14, identifier: "920d264c29fd38ca7f4156eb96923c3b")
!438 = !{!439, !440, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !437, file: !2, baseType: !13, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !437, file: !2, baseType: !13, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !437, file: !2, baseType: !13, size: 64, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !437, file: !2, baseType: !13, size: 64, align: 64, offset: 192)
!443 = !{!444}
!444 = !DILocalVariable(name: "x", arg: 1, scope: !433, file: !139, line: 318, type: !436)
!445 = !{!446}
!446 = !DITemplateTypeParameter(name: "T", type: !437)
!447 = !DILocation(line: 318, column: 30, scope: !433)
!448 = !DILocation(line: 319, column: 23, scope: !433)
!449 = !DILocalVariable(name: "x", scope: !450, file: !139, line: 319, type: !436, align: 8)
!450 = distinct !DISubprogram(name: "new<(f64, f64, f64, f64)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h049c840cedba3097E", scope: !321, file: !139, line: 329, type: !451, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !445, retainedNodes: !456)
!451 = !DISubroutineType(types: !452)
!452 = !{!321, !436, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f64, f64, f64, f64), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !454, size: 64, align: 64, dwarfAddressSpace: 0)
!454 = !DISubroutineType(types: !455)
!455 = !{!143, !436, !162}
!456 = !{!449, !457}
!457 = !DILocalVariable(name: "f", scope: !450, file: !139, line: 319, type: !453, align: 8)
!458 = !DILocation(line: 319, column: 13, scope: !450, inlinedAt: !459)
!459 = !DILocation(line: 319, column: 13, scope: !433)
!460 = !DILocation(line: 319, column: 26, scope: !433)
!461 = !DILocation(line: 320, column: 10, scope: !433)
!462 = distinct !DISubprogram(name: "new_debug<(f32, f32, f32, f32, f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h751e0cafa0113f42E", scope: !321, file: !139, line: 318, type: !463, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !478, retainedNodes: !476)
!463 = !DISubroutineType(types: !464)
!464 = !{!321, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f32, f32, f32, f32, f32, f32, f32, f32)", baseType: !466, size: 64, align: 64, dwarfAddressSpace: 0)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f32, f32, f32, f32, f32, f32, f32, f32)", file: !2, size: 256, align: 32, elements: !467, templateParams: !14, identifier: "fc364d873fca01b6dcaff645f521398f")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !466, file: !2, baseType: !44, size: 32, align: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__4", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__5", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__6", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__7", scope: !466, file: !2, baseType: !44, size: 32, align: 32, offset: 224)
!476 = !{!477}
!477 = !DILocalVariable(name: "x", arg: 1, scope: !462, file: !139, line: 318, type: !465)
!478 = !{!479}
!479 = !DITemplateTypeParameter(name: "T", type: !466)
!480 = !DILocation(line: 318, column: 30, scope: !462)
!481 = !DILocation(line: 319, column: 23, scope: !462)
!482 = !DILocalVariable(name: "x", scope: !483, file: !139, line: 319, type: !465, align: 8)
!483 = distinct !DISubprogram(name: "new<(f32, f32, f32, f32, f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV13new17hd6cceb04cfe0e8efE", scope: !321, file: !139, line: 329, type: !484, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !478, retainedNodes: !489)
!484 = !DISubroutineType(types: !485)
!485 = !{!321, !465, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f32, f32, f32, f32, f32, f32, f32, f32), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{!143, !465, !162}
!489 = !{!482, !490}
!490 = !DILocalVariable(name: "f", scope: !483, file: !139, line: 319, type: !486, align: 8)
!491 = !DILocation(line: 319, column: 13, scope: !483, inlinedAt: !492)
!492 = !DILocation(line: 319, column: 13, scope: !462)
!493 = !DILocation(line: 319, column: 26, scope: !462)
!494 = !DILocation(line: 320, column: 10, scope: !462)
!495 = distinct !DISubprogram(name: "new_debug<(u128, u128)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h7e2350f88654cc5cE", scope: !321, file: !139, line: 318, type: !496, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !505, retainedNodes: !503)
!496 = !DISubroutineType(types: !497)
!497 = !{!321, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(u128, u128)", baseType: !499, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u128, u128)", file: !2, size: 256, align: 64, elements: !500, templateParams: !14, identifier: "1b28922524d704e42db756a3452cbb80")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !499, file: !2, baseType: !34, size: 128, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !499, file: !2, baseType: !34, size: 128, align: 64, offset: 128)
!503 = !{!504}
!504 = !DILocalVariable(name: "x", arg: 1, scope: !495, file: !139, line: 318, type: !498)
!505 = !{!506}
!506 = !DITemplateTypeParameter(name: "T", type: !499)
!507 = !DILocation(line: 318, column: 30, scope: !495)
!508 = !DILocation(line: 319, column: 23, scope: !495)
!509 = !DILocalVariable(name: "x", scope: !510, file: !139, line: 319, type: !498, align: 8)
!510 = distinct !DISubprogram(name: "new<(u128, u128)>", linkageName: "_ZN4core3fmt10ArgumentV13new17h492e0089bdd34a32E", scope: !321, file: !139, line: 329, type: !511, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !505, retainedNodes: !516)
!511 = !DISubroutineType(types: !512)
!512 = !{!321, !498, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(u128, u128), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !514, size: 64, align: 64, dwarfAddressSpace: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{!143, !498, !162}
!516 = !{!509, !517}
!517 = !DILocalVariable(name: "f", scope: !510, file: !139, line: 319, type: !513, align: 8)
!518 = !DILocation(line: 319, column: 13, scope: !510, inlinedAt: !519)
!519 = !DILocation(line: 319, column: 13, scope: !495)
!520 = !DILocation(line: 319, column: 26, scope: !495)
!521 = !DILocation(line: 320, column: 10, scope: !495)
!522 = distinct !DISubprogram(name: "new_debug<(f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17h7e9d6f4ce9875ff4E", scope: !321, file: !139, line: 318, type: !523, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !534, retainedNodes: !532)
!523 = !DISubroutineType(types: !524)
!524 = !{!321, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(f32, f32, f32, f32)", baseType: !526, size: 64, align: 64, dwarfAddressSpace: 0)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f32, f32, f32, f32)", file: !2, size: 128, align: 32, elements: !527, templateParams: !14, identifier: "58af0add5acfd955243155c85c31d08")
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !526, file: !2, baseType: !44, size: 32, align: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !526, file: !2, baseType: !44, size: 32, align: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !526, file: !2, baseType: !44, size: 32, align: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !526, file: !2, baseType: !44, size: 32, align: 32, offset: 96)
!532 = !{!533}
!533 = !DILocalVariable(name: "x", arg: 1, scope: !522, file: !139, line: 318, type: !525)
!534 = !{!535}
!535 = !DITemplateTypeParameter(name: "T", type: !526)
!536 = !DILocation(line: 318, column: 30, scope: !522)
!537 = !DILocation(line: 319, column: 23, scope: !522)
!538 = !DILocalVariable(name: "x", scope: !539, file: !139, line: 319, type: !525, align: 8)
!539 = distinct !DISubprogram(name: "new<(f32, f32, f32, f32)>", linkageName: "_ZN4core3fmt10ArgumentV13new17had329fc8099e1fdaE", scope: !321, file: !139, line: 329, type: !540, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !534, retainedNodes: !545)
!540 = !DISubroutineType(types: !541)
!541 = !{!321, !525, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&(f32, f32, f32, f32), &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !543, size: 64, align: 64, dwarfAddressSpace: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!143, !525, !162}
!545 = !{!538, !546}
!546 = !DILocalVariable(name: "f", scope: !539, file: !139, line: 319, type: !542, align: 8)
!547 = !DILocation(line: 319, column: 13, scope: !539, inlinedAt: !548)
!548 = !DILocation(line: 319, column: 13, scope: !522)
!549 = !DILocation(line: 319, column: 26, scope: !522)
!550 = !DILocation(line: 320, column: 10, scope: !522)
!551 = distinct !DISubprogram(name: "new_debug<u128>", linkageName: "_ZN4core3fmt10ArgumentV19new_debug17hbeed54c99c1218dfE", scope: !321, file: !139, line: 318, type: !552, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !201, retainedNodes: !554)
!552 = !DISubroutineType(types: !553)
!553 = !{!321, !33}
!554 = !{!555}
!555 = !DILocalVariable(name: "x", arg: 1, scope: !551, file: !139, line: 318, type: !33)
!556 = !DILocation(line: 318, column: 30, scope: !551)
!557 = !DILocation(line: 319, column: 23, scope: !551)
!558 = !DILocalVariable(name: "x", scope: !559, file: !139, line: 319, type: !33, align: 8)
!559 = distinct !DISubprogram(name: "new<u128>", linkageName: "_ZN4core3fmt10ArgumentV13new17h219bc26cf7464912E", scope: !321, file: !139, line: 329, type: !560, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !201, retainedNodes: !565)
!560 = !DISubroutineType(types: !561)
!561 = !{!321, !33, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&u128, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !563, size: 64, align: 64, dwarfAddressSpace: 0)
!563 = !DISubroutineType(types: !564)
!564 = !{!143, !33, !162}
!565 = !{!558, !566}
!566 = !DILocalVariable(name: "f", scope: !559, file: !139, line: 319, type: !562, align: 8)
!567 = !DILocation(line: 319, column: 13, scope: !559, inlinedAt: !568)
!568 = !DILocation(line: 319, column: 13, scope: !551)
!569 = !DILocation(line: 319, column: 26, scope: !551)
!570 = !DILocation(line: 320, column: 10, scope: !551)
!571 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i64$GT$3fmt17h8156d69d464ddc09E", scope: !573, file: !572, line: 185, type: !575, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !577)
!572 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!573 = !DINamespace(name: "{impl#81}", scope: !574)
!574 = !DINamespace(name: "num", scope: !131)
!575 = !DISubroutineType(types: !576)
!576 = !{!143, !23, !162}
!577 = !{!578, !579}
!578 = !DILocalVariable(name: "self", arg: 1, scope: !571, file: !572, line: 185, type: !23)
!579 = !DILocalVariable(name: "f", arg: 2, scope: !571, file: !572, line: 185, type: !162)
!580 = !DILocation(line: 185, column: 20, scope: !571)
!581 = !DILocation(line: 185, column: 27, scope: !571)
!582 = !DILocation(line: 186, column: 20, scope: !571)
!583 = !DILocation(line: 188, column: 27, scope: !571)
!584 = !DILocation(line: 187, column: 21, scope: !571)
!585 = !DILocation(line: 186, column: 17, scope: !571)
!586 = !DILocation(line: 193, column: 14, scope: !571)
!587 = !{i8 0, i8 2}
!588 = !DILocation(line: 191, column: 21, scope: !571)
!589 = !DILocation(line: 189, column: 21, scope: !571)
!590 = !DILocation(line: 188, column: 24, scope: !571)
!591 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num51_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u128$GT$3fmt17h6880ec86e4807939E", scope: !592, file: !572, line: 185, type: !563, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !593)
!592 = !DINamespace(name: "{impl#88}", scope: !574)
!593 = !{!594, !595}
!594 = !DILocalVariable(name: "self", arg: 1, scope: !591, file: !572, line: 185, type: !33)
!595 = !DILocalVariable(name: "f", arg: 2, scope: !591, file: !572, line: 185, type: !162)
!596 = !DILocation(line: 185, column: 20, scope: !591)
!597 = !DILocation(line: 185, column: 27, scope: !591)
!598 = !DILocation(line: 186, column: 20, scope: !591)
!599 = !DILocation(line: 188, column: 27, scope: !591)
!600 = !DILocation(line: 187, column: 21, scope: !591)
!601 = !DILocation(line: 186, column: 17, scope: !591)
!602 = !DILocation(line: 193, column: 14, scope: !591)
!603 = !DILocation(line: 191, column: 21, scope: !591)
!604 = !DILocation(line: 189, column: 21, scope: !591)
!605 = !DILocation(line: 188, column: 24, scope: !591)
!606 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h3da1799ff79867bbE", scope: !607, file: !139, line: 390, type: !666, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !668)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !131, file: !2, size: 384, align: 64, elements: !608, templateParams: !14, identifier: "7e7034295abae01651800c8eb0e9b712")
!608 = !{!609, !615, !660}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !607, file: !2, baseType: !610, size: 128, align: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !611, templateParams: !14, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!611 = !{!612, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !610, file: !2, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !610, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !607, file: !2, baseType: !616, size: 128, align: 64, offset: 128)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !172, file: !2, size: 128, align: 64, elements: !617, templateParams: !14, identifier: "bb69cbb99024f47dbb54317ba8130317")
!617 = !{!618}
!618 = !DICompositeType(tag: DW_TAG_variant_part, scope: !616, file: !2, size: 128, align: 64, elements: !619, templateParams: !14, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !659)
!619 = !{!620, !655}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !618, file: !2, baseType: !621, size: 128, align: 64, extraData: i64 0)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !616, file: !2, size: 128, align: 64, elements: !14, templateParams: !622, identifier: "742dbe7e160661d8ca36fcfff2574850")
!622 = !{!623}
!623 = !DITemplateTypeParameter(name: "T", type: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !625, templateParams: !14, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!625 = !{!626, !654}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !624, file: !2, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !129, file: !2, size: 448, align: 64, elements: !629, templateParams: !14, identifier: "fbba22b504f631aebebe5f9a731b4661")
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !628, file: !2, baseType: !9, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !628, file: !2, baseType: !632, size: 384, align: 64, offset: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !129, file: !2, size: 384, align: 64, elements: !633, templateParams: !14, identifier: "a89ae7a13a1def66296bab98052f520a")
!633 = !{!634, !635, !636, !637, !653}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !632, file: !2, baseType: !168, size: 32, align: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !632, file: !2, baseType: !128, size: 8, align: 8, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !2, baseType: !166, size: 32, align: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !632, file: !2, baseType: !638, size: 128, align: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !129, file: !2, size: 128, align: 64, elements: !639, templateParams: !14, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!639 = !{!640}
!640 = !DICompositeType(tag: DW_TAG_variant_part, scope: !638, file: !2, size: 128, align: 64, elements: !641, templateParams: !14, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !652)
!641 = !{!642, !646, !650}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !640, file: !2, baseType: !643, size: 128, align: 64, extraData: i64 0)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !638, file: !2, size: 128, align: 64, elements: !644, templateParams: !14, identifier: "927d86c22d9994b767e51a58b20493")
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !643, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !640, file: !2, baseType: !647, size: 128, align: 64, extraData: i64 1)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !638, file: !2, size: 128, align: 64, elements: !648, templateParams: !14, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !647, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !640, file: !2, baseType: !651, size: 128, align: 64, extraData: i64 2)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !638, file: !2, size: 128, align: 64, elements: !14, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!652 = !DIDerivedType(tag: DW_TAG_member, scope: !638, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagArtificial)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !632, file: !2, baseType: !638, size: 128, align: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !624, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !618, file: !2, baseType: !656, size: 128, align: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !616, file: !2, size: 128, align: 64, elements: !657, templateParams: !622, identifier: "17f2fc106094349c7673abca4839c97a")
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !656, file: !2, baseType: !624, size: 128, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, scope: !616, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagArtificial)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !607, file: !2, baseType: !661, size: 128, align: 64, offset: 256)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !662, templateParams: !14, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!662 = !{!663, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !661, file: !2, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64, dwarfAddressSpace: 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !661, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!607, !610, !661}
!668 = !{!669, !670}
!669 = !DILocalVariable(name: "pieces", arg: 1, scope: !606, file: !139, line: 390, type: !610)
!670 = !DILocalVariable(name: "args", arg: 2, scope: !606, file: !139, line: 390, type: !661)
!671 = !DILocation(line: 390, column: 25, scope: !606)
!672 = !DILocation(line: 390, column: 53, scope: !606)
!673 = !DILocation(line: 391, column: 12, scope: !606)
!674 = !DILocation(line: 391, column: 56, scope: !606)
!675 = !DILocation(line: 391, column: 41, scope: !606)
!676 = !DILocation(line: 394, column: 34, scope: !606)
!677 = !DILocation(line: 394, column: 9, scope: !606)
!678 = !DILocation(line: 395, column: 6, scope: !606)
!679 = !DILocation(line: 392, column: 13, scope: !606)
!680 = distinct !DISubprogram(name: "drop_in_place<&f32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f32$GT$17h1e40ec344be553afE", scope: !682, file: !681, line: 487, type: !683, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !688, retainedNodes: !686)
!681 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!682 = !DINamespace(name: "ptr", scope: !63)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f32", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !{!687}
!687 = !DILocalVariable(arg: 1, scope: !680, file: !681, line: 487, type: !685)
!688 = !{!689}
!689 = !DITemplateTypeParameter(name: "T", type: !43)
!690 = !DILocation(line: 487, column: 1, scope: !680)
!691 = distinct !DISubprogram(name: "drop_in_place<&f64>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f64$GT$17h4435ee5e2d199fbaE", scope: !682, file: !681, line: 487, type: !692, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !697, retainedNodes: !695)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f64", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = !{!696}
!696 = !DILocalVariable(arg: 1, scope: !691, file: !681, line: 487, type: !694)
!697 = !{!698}
!698 = !DITemplateTypeParameter(name: "T", type: !12)
!699 = !DILocation(line: 487, column: 1, scope: !691)
!700 = distinct !DISubprogram(name: "drop_in_place<&i64>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i64$GT$17h9534fe69a8cf4317E", scope: !682, file: !681, line: 487, type: !701, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !706, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i64", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!704 = !{!705}
!705 = !DILocalVariable(arg: 1, scope: !700, file: !681, line: 487, type: !703)
!706 = !{!707}
!707 = !DITemplateTypeParameter(name: "T", type: !23)
!708 = !DILocation(line: 487, column: 1, scope: !700)
!709 = distinct !DISubprogram(name: "drop_in_place<&u128>", linkageName: "_ZN4core3ptr29drop_in_place$LT$$RF$u128$GT$17h2b2352fd69062125E", scope: !682, file: !681, line: 487, type: !710, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !715, retainedNodes: !713)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &u128", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!713 = !{!714}
!714 = !DILocalVariable(arg: 1, scope: !709, file: !681, line: 487, type: !712)
!715 = !{!716}
!716 = !DITemplateTypeParameter(name: "T", type: !33)
!717 = !DILocation(line: 487, column: 1, scope: !709)
!718 = distinct !DISubprogram(name: "ne<u128, u128>", linkageName: "_ZN4core5tuple64_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$U$C$T$RP$$GT$2ne17h6c0076d97134f3ddE", scope: !720, file: !719, line: 34, type: !722, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !727, retainedNodes: !724)
!719 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/tuple.rs", directory: "", checksumkind: CSK_MD5, checksum: "824efe1540ae06eae793051e69ce018b")
!720 = !DINamespace(name: "{impl#5}", scope: !721)
!721 = !DINamespace(name: "tuple", scope: !63)
!722 = !DISubroutineType(types: !723)
!723 = !{!275, !498, !498}
!724 = !{!725, !726}
!725 = !DILocalVariable(name: "self", arg: 1, scope: !718, file: !719, line: 34, type: !498)
!726 = !DILocalVariable(name: "other", arg: 2, scope: !718, file: !719, line: 34, type: !498)
!727 = !{!728, !202}
!728 = !DITemplateTypeParameter(name: "U", type: !34)
!729 = !DILocation(line: 34, column: 23, scope: !718)
!730 = !DILocation(line: 34, column: 30, scope: !718)
!731 = !DILocation(line: 35, column: 37, scope: !718)
!732 = !DILocation(line: 35, column: 56, scope: !718)
!733 = !DILocation(line: 36, column: 18, scope: !718)
!734 = distinct !DISubprogram(name: "ne<f64, f64>", linkageName: "_ZN4core5tuple64_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$U$C$T$RP$$GT$2ne17haf91862955e549c7E", scope: !720, file: !719, line: 34, type: !735, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !740, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!275, !382, !382}
!737 = !{!738, !739}
!738 = !DILocalVariable(name: "self", arg: 1, scope: !734, file: !719, line: 34, type: !382)
!739 = !DILocalVariable(name: "other", arg: 2, scope: !734, file: !719, line: 34, type: !382)
!740 = !{!741, !246}
!741 = !DITemplateTypeParameter(name: "U", type: !13)
!742 = !DILocation(line: 34, column: 23, scope: !734)
!743 = !DILocation(line: 34, column: 30, scope: !734)
!744 = !DILocation(line: 35, column: 37, scope: !734)
!745 = !DILocation(line: 35, column: 56, scope: !734)
!746 = !DILocation(line: 36, column: 18, scope: !734)
!747 = distinct !DISubprogram(name: "ne<i64, i64>", linkageName: "_ZN4core5tuple64_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$U$C$T$RP$$GT$2ne17hc53553fd430d1780E", scope: !720, file: !719, line: 34, type: !748, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !753, retainedNodes: !750)
!748 = !DISubroutineType(types: !749)
!749 = !{!275, !409, !409}
!750 = !{!751, !752}
!751 = !DILocalVariable(name: "self", arg: 1, scope: !747, file: !719, line: 34, type: !409)
!752 = !DILocalVariable(name: "other", arg: 2, scope: !747, file: !719, line: 34, type: !409)
!753 = !{!754, !217}
!754 = !DITemplateTypeParameter(name: "U", type: !24)
!755 = !DILocation(line: 34, column: 23, scope: !747)
!756 = !DILocation(line: 34, column: 30, scope: !747)
!757 = !DILocation(line: 35, column: 37, scope: !747)
!758 = !DILocation(line: 35, column: 56, scope: !747)
!759 = !DILocation(line: 36, column: 18, scope: !747)
!760 = distinct !DISubprogram(name: "ne<f64, f64, f64, f64>", linkageName: "_ZN4core5tuple72_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$W$C$V$C$U$C$T$RP$$GT$2ne17h302b833d8e86f458E", scope: !761, file: !719, line: 34, type: !762, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !767, retainedNodes: !764)
!761 = !DINamespace(name: "{impl#15}", scope: !721)
!762 = !DISubroutineType(types: !763)
!763 = !{!275, !436, !436}
!764 = !{!765, !766}
!765 = !DILocalVariable(name: "self", arg: 1, scope: !760, file: !719, line: 34, type: !436)
!766 = !DILocalVariable(name: "other", arg: 2, scope: !760, file: !719, line: 34, type: !436)
!767 = !{!768, !769, !741, !246}
!768 = !DITemplateTypeParameter(name: "W", type: !13)
!769 = !DITemplateTypeParameter(name: "V", type: !13)
!770 = !DILocation(line: 34, column: 23, scope: !760)
!771 = !DILocation(line: 34, column: 30, scope: !760)
!772 = !DILocation(line: 35, column: 37, scope: !760)
!773 = !DILocation(line: 35, column: 56, scope: !760)
!774 = !DILocation(line: 36, column: 18, scope: !760)
!775 = distinct !DISubprogram(name: "ne<f32, f32, f32, f32>", linkageName: "_ZN4core5tuple72_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$W$C$V$C$U$C$T$RP$$GT$2ne17h531ecb6b13f2d89bE", scope: !761, file: !719, line: 34, type: !776, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !781, retainedNodes: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{!275, !525, !525}
!778 = !{!779, !780}
!779 = !DILocalVariable(name: "self", arg: 1, scope: !775, file: !719, line: 34, type: !525)
!780 = !DILocalVariable(name: "other", arg: 2, scope: !775, file: !719, line: 34, type: !525)
!781 = !{!782, !783, !784, !231}
!782 = !DITemplateTypeParameter(name: "W", type: !44)
!783 = !DITemplateTypeParameter(name: "V", type: !44)
!784 = !DITemplateTypeParameter(name: "U", type: !44)
!785 = !DILocation(line: 34, column: 23, scope: !775)
!786 = !DILocation(line: 34, column: 30, scope: !775)
!787 = !DILocation(line: 35, column: 37, scope: !775)
!788 = !DILocation(line: 35, column: 56, scope: !775)
!789 = !DILocation(line: 36, column: 18, scope: !775)
!790 = distinct !DISubprogram(name: "ne<i64, i64, i64, i64>", linkageName: "_ZN4core5tuple72_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$W$C$V$C$U$C$T$RP$$GT$2ne17h5e6b4d9fa4f3c0c4E", scope: !761, file: !719, line: 34, type: !791, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !796, retainedNodes: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!275, !353, !353}
!793 = !{!794, !795}
!794 = !DILocalVariable(name: "self", arg: 1, scope: !790, file: !719, line: 34, type: !353)
!795 = !DILocalVariable(name: "other", arg: 2, scope: !790, file: !719, line: 34, type: !353)
!796 = !{!797, !798, !754, !217}
!797 = !DITemplateTypeParameter(name: "W", type: !24)
!798 = !DITemplateTypeParameter(name: "V", type: !24)
!799 = !DILocation(line: 34, column: 23, scope: !790)
!800 = !DILocation(line: 34, column: 30, scope: !790)
!801 = !DILocation(line: 35, column: 37, scope: !790)
!802 = !DILocation(line: 35, column: 56, scope: !790)
!803 = !DILocation(line: 36, column: 18, scope: !790)
!804 = distinct !DISubprogram(name: "ne<f32, f32, f32, f32, f32, f32, f32, f32>", linkageName: "_ZN4core5tuple88_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$A$C$Z$C$Y$C$X$C$W$C$V$C$U$C$T$RP$$GT$2ne17h2c88287f64132576E", scope: !805, file: !719, line: 34, type: !806, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !811, retainedNodes: !808)
!805 = !DINamespace(name: "{impl#35}", scope: !721)
!806 = !DISubroutineType(types: !807)
!807 = !{!275, !465, !465}
!808 = !{!809, !810}
!809 = !DILocalVariable(name: "self", arg: 1, scope: !804, file: !719, line: 34, type: !465)
!810 = !DILocalVariable(name: "other", arg: 2, scope: !804, file: !719, line: 34, type: !465)
!811 = !{!812, !813, !814, !815, !782, !783, !784, !231}
!812 = !DITemplateTypeParameter(name: "A", type: !44)
!813 = !DITemplateTypeParameter(name: "Z", type: !44)
!814 = !DITemplateTypeParameter(name: "Y", type: !44)
!815 = !DITemplateTypeParameter(name: "X", type: !44)
!816 = !DILocation(line: 34, column: 23, scope: !804)
!817 = !DILocation(line: 34, column: 30, scope: !804)
!818 = !DILocation(line: 35, column: 37, scope: !804)
!819 = !DILocation(line: 35, column: 56, scope: !804)
!820 = !DILocation(line: 36, column: 18, scope: !804)
!821 = distinct !DISubprogram(name: "_mm_aesdec_si128", linkageName: "_ZN4core9core_arch3x863aes16_mm_aesdec_si12817h07191aebc4503e22E", scope: !823, file: !822, line: 38, type: !824, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !826)
!822 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/../../stdarch/crates/core_arch/src/x86/aes.rs", directory: "", checksumkind: CSK_MD5, checksum: "dd9dfdbc9116ee2a953842571afb0bea")
!823 = !DINamespace(name: "aes", scope: !61)
!824 = !DISubroutineType(types: !825)
!825 = !{!97, !97, !97}
!826 = !{!827, !828}
!827 = !DILocalVariable(name: "a", arg: 1, scope: !821, file: !822, line: 38, type: !97)
!828 = !DILocalVariable(name: "round_key", arg: 2, scope: !821, file: !822, line: 38, type: !97)
!829 = !DILocation(line: 38, column: 32, scope: !821)
!830 = !DILocation(line: 38, column: 44, scope: !821)
!831 = !DILocation(line: 39, column: 12, scope: !821)
!832 = !DILocation(line: 39, column: 15, scope: !821)
!833 = !DILocation(line: 39, column: 5, scope: !821)
!834 = !DILocation(line: 40, column: 2, scope: !821)
!835 = distinct !DISubprogram(name: "_mm_aesenc_si128", linkageName: "_ZN4core9core_arch3x863aes16_mm_aesenc_si12817hace07bd2987bc135E", scope: !823, file: !822, line: 60, type: !824, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !836)
!836 = !{!837, !838}
!837 = !DILocalVariable(name: "a", arg: 1, scope: !835, file: !822, line: 60, type: !97)
!838 = !DILocalVariable(name: "round_key", arg: 2, scope: !835, file: !822, line: 60, type: !97)
!839 = !DILocation(line: 60, column: 32, scope: !835)
!840 = !DILocation(line: 60, column: 44, scope: !835)
!841 = !DILocation(line: 61, column: 12, scope: !835)
!842 = !DILocation(line: 61, column: 15, scope: !835)
!843 = !DILocation(line: 61, column: 5, scope: !835)
!844 = !DILocation(line: 62, column: 2, scope: !835)
!845 = distinct !DISubprogram(name: "_mm_aesimc_si128", linkageName: "_ZN4core9core_arch3x863aes16_mm_aesimc_si12817h0d02d753caba3ff9E", scope: !823, file: !822, line: 82, type: !846, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!97, !97}
!848 = !{!849}
!849 = !DILocalVariable(name: "a", arg: 1, scope: !845, file: !822, line: 82, type: !97)
!850 = !DILocation(line: 82, column: 32, scope: !845)
!851 = !DILocation(line: 83, column: 12, scope: !845)
!852 = !DILocation(line: 83, column: 5, scope: !845)
!853 = !DILocation(line: 84, column: 2, scope: !845)
!854 = distinct !DISubprogram(name: "_mm_aesdeclast_si128", linkageName: "_ZN4core9core_arch3x863aes20_mm_aesdeclast_si12817hcc53bb5ee4223ab2E", scope: !823, file: !822, line: 49, type: !824, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !855)
!855 = !{!856, !857}
!856 = !DILocalVariable(name: "a", arg: 1, scope: !854, file: !822, line: 49, type: !97)
!857 = !DILocalVariable(name: "round_key", arg: 2, scope: !854, file: !822, line: 49, type: !97)
!858 = !DILocation(line: 49, column: 36, scope: !854)
!859 = !DILocation(line: 49, column: 48, scope: !854)
!860 = !DILocation(line: 50, column: 16, scope: !854)
!861 = !DILocation(line: 50, column: 19, scope: !854)
!862 = !DILocation(line: 50, column: 5, scope: !854)
!863 = !DILocation(line: 51, column: 2, scope: !854)
!864 = distinct !DISubprogram(name: "_mm_aesenclast_si128", linkageName: "_ZN4core9core_arch3x863aes20_mm_aesenclast_si12817h32bb38915e87440cE", scope: !823, file: !822, line: 71, type: !824, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !865)
!865 = !{!866, !867}
!866 = !DILocalVariable(name: "a", arg: 1, scope: !864, file: !822, line: 71, type: !97)
!867 = !DILocalVariable(name: "round_key", arg: 2, scope: !864, file: !822, line: 71, type: !97)
!868 = !DILocation(line: 71, column: 36, scope: !864)
!869 = !DILocation(line: 71, column: 48, scope: !864)
!870 = !DILocation(line: 72, column: 16, scope: !864)
!871 = !DILocation(line: 72, column: 19, scope: !864)
!872 = !DILocation(line: 72, column: 5, scope: !864)
!873 = !DILocation(line: 73, column: 2, scope: !864)
!874 = distinct !DISubprogram(name: "_mm_aeskeygenassist_si128<2>", linkageName: "_ZN4core9core_arch3x863aes25_mm_aeskeygenassist_si12817h455a59a6cad806c7E", scope: !823, file: !822, line: 98, type: !846, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !875)
!875 = !{!876}
!876 = !DILocalVariable(name: "a", arg: 1, scope: !874, file: !822, line: 98, type: !97)
!877 = !DILocation(line: 98, column: 58, scope: !874)
!878 = !DILocation(line: 100, column: 21, scope: !874)
!879 = !DILocation(line: 100, column: 5, scope: !874)
!880 = !DILocation(line: 101, column: 2, scope: !874)
!881 = distinct !DISubprogram(name: "_mm256_set_pd", linkageName: "_ZN4core9core_arch3x863avx13_mm256_set_pd17h679b06ed4b8e4f79E", scope: !883, file: !882, line: 2117, type: !884, scopeLine: 2117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !886)
!882 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/../../stdarch/crates/core_arch/src/x86/avx.rs", directory: "", checksumkind: CSK_MD5, checksum: "2e345eb843cec77fb43515e1a861749d")
!883 = !DINamespace(name: "avx", scope: !61)
!884 = !DISubroutineType(types: !885)
!885 = !{!89, !13, !13, !13, !13}
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "a", arg: 1, scope: !881, file: !882, line: 2117, type: !13)
!888 = !DILocalVariable(name: "b", arg: 2, scope: !881, file: !882, line: 2117, type: !13)
!889 = !DILocalVariable(name: "c", arg: 3, scope: !881, file: !882, line: 2117, type: !13)
!890 = !DILocalVariable(name: "d", arg: 4, scope: !881, file: !882, line: 2117, type: !13)
!891 = !DILocation(line: 2117, column: 29, scope: !881)
!892 = !DILocation(line: 2117, column: 37, scope: !881)
!893 = !DILocation(line: 2117, column: 45, scope: !881)
!894 = !DILocation(line: 2117, column: 53, scope: !881)
!895 = !DILocation(line: 2118, column: 20, scope: !881)
!896 = !DILocalVariable(name: "a", scope: !897, file: !882, line: 2118, type: !13, align: 8)
!897 = distinct !DISubprogram(name: "_mm256_setr_pd", linkageName: "_ZN4core9core_arch3x863avx14_mm256_setr_pd17h5528cfb7683f61c7E", scope: !883, file: !882, line: 2265, type: !884, scopeLine: 2265, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !898)
!898 = !{!896, !899, !900, !901}
!899 = !DILocalVariable(name: "b", scope: !897, file: !882, line: 2118, type: !13, align: 8)
!900 = !DILocalVariable(name: "c", scope: !897, file: !882, line: 2118, type: !13, align: 8)
!901 = !DILocalVariable(name: "d", scope: !897, file: !882, line: 2118, type: !13, align: 8)
!902 = !DILocation(line: 2118, column: 5, scope: !897, inlinedAt: !903)
!903 = !DILocation(line: 2118, column: 5, scope: !881)
!904 = !DILocation(line: 2118, column: 23, scope: !881)
!905 = !DILocation(line: 2118, column: 26, scope: !881)
!906 = !DILocation(line: 2118, column: 29, scope: !881)
!907 = !DILocation(line: 2119, column: 2, scope: !881)
!908 = distinct !DISubprogram(name: "_mm256_set1_ps", linkageName: "_ZN4core9core_arch3x863avx14_mm256_set1_ps17hc256d779309cfed1E", scope: !883, file: !882, line: 2429, type: !909, scopeLine: 2429, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!71, !44}
!911 = !{!912}
!912 = !DILocalVariable(name: "a", arg: 1, scope: !908, file: !882, line: 2429, type: !44)
!913 = !DILocation(line: 2429, column: 30, scope: !908)
!914 = !DILocation(line: 2430, column: 20, scope: !908)
!915 = !DILocalVariable(name: "a", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!916 = distinct !DISubprogram(name: "_mm256_setr_ps", linkageName: "_ZN4core9core_arch3x863avx14_mm256_setr_ps17h58dba69b9bc5e04cE", scope: !883, file: !882, line: 2277, type: !917, scopeLine: 2277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{!71, !44, !44, !44, !44, !44, !44, !44, !44}
!919 = !{!915, !920, !921, !922, !923, !924, !925, !926}
!920 = !DILocalVariable(name: "b", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!921 = !DILocalVariable(name: "c", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!922 = !DILocalVariable(name: "d", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!923 = !DILocalVariable(name: "e", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!924 = !DILocalVariable(name: "f", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!925 = !DILocalVariable(name: "g", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!926 = !DILocalVariable(name: "h", scope: !916, file: !882, line: 2430, type: !44, align: 4)
!927 = !DILocation(line: 2430, column: 5, scope: !916, inlinedAt: !928)
!928 = !DILocation(line: 2430, column: 5, scope: !908)
!929 = !DILocation(line: 2430, column: 23, scope: !908)
!930 = !DILocation(line: 2430, column: 26, scope: !908)
!931 = !DILocation(line: 2430, column: 29, scope: !908)
!932 = !DILocation(line: 2430, column: 32, scope: !908)
!933 = !DILocation(line: 2430, column: 35, scope: !908)
!934 = !DILocation(line: 2430, column: 38, scope: !908)
!935 = !DILocation(line: 2430, column: 41, scope: !908)
!936 = !DILocation(line: 2431, column: 2, scope: !908)
!937 = distinct !DISubprogram(name: "_mm256_setr_pd", linkageName: "_ZN4core9core_arch3x863avx14_mm256_setr_pd17h5528cfb7683f61c7E", scope: !883, file: !882, line: 2265, type: !884, scopeLine: 2265, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DILocalVariable(name: "a", arg: 1, scope: !937, file: !882, line: 2265, type: !13)
!940 = !DILocalVariable(name: "b", arg: 2, scope: !937, file: !882, line: 2265, type: !13)
!941 = !DILocalVariable(name: "c", arg: 3, scope: !937, file: !882, line: 2265, type: !13)
!942 = !DILocalVariable(name: "d", arg: 4, scope: !937, file: !882, line: 2265, type: !13)
!943 = !DILocation(line: 2265, column: 30, scope: !937)
!944 = !DILocation(line: 2265, column: 38, scope: !937)
!945 = !DILocation(line: 2265, column: 46, scope: !937)
!946 = !DILocation(line: 2265, column: 54, scope: !937)
!947 = !DILocation(line: 2266, column: 5, scope: !937)
!948 = !DILocation(line: 2267, column: 2, scope: !937)
!949 = distinct !DISubprogram(name: "_mm256_setr_ps", linkageName: "_ZN4core9core_arch3x863avx14_mm256_setr_ps17h58dba69b9bc5e04cE", scope: !883, file: !882, line: 2277, type: !917, scopeLine: 2277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958}
!951 = !DILocalVariable(name: "a", arg: 1, scope: !949, file: !882, line: 2278, type: !44)
!952 = !DILocalVariable(name: "b", arg: 2, scope: !949, file: !882, line: 2279, type: !44)
!953 = !DILocalVariable(name: "c", arg: 3, scope: !949, file: !882, line: 2280, type: !44)
!954 = !DILocalVariable(name: "d", arg: 4, scope: !949, file: !882, line: 2281, type: !44)
!955 = !DILocalVariable(name: "e", arg: 5, scope: !949, file: !882, line: 2282, type: !44)
!956 = !DILocalVariable(name: "f", arg: 6, scope: !949, file: !882, line: 2283, type: !44)
!957 = !DILocalVariable(name: "g", arg: 7, scope: !949, file: !882, line: 2284, type: !44)
!958 = !DILocalVariable(name: "h", arg: 8, scope: !949, file: !882, line: 2285, type: !44)
!959 = !DILocation(line: 2278, column: 5, scope: !949)
!960 = !DILocation(line: 2279, column: 5, scope: !949)
!961 = !DILocation(line: 2280, column: 5, scope: !949)
!962 = !DILocation(line: 2281, column: 5, scope: !949)
!963 = !DILocation(line: 2282, column: 5, scope: !949)
!964 = !DILocation(line: 2283, column: 5, scope: !949)
!965 = !DILocation(line: 2284, column: 5, scope: !949)
!966 = !DILocation(line: 2285, column: 5, scope: !949)
!967 = !DILocation(line: 2287, column: 5, scope: !949)
!968 = !DILocation(line: 2288, column: 2, scope: !949)
!969 = distinct !DISubprogram(name: "_mm256_set1_epi8", linkageName: "_ZN4core9core_arch3x863avx16_mm256_set1_epi817hb44977f57f87386dE", scope: !883, file: !882, line: 2443, type: !970, scopeLine: 2443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !973)
!970 = !DISubroutineType(types: !971)
!971 = !{!103, !972}
!972 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!973 = !{!974}
!974 = !DILocalVariable(name: "a", arg: 1, scope: !969, file: !882, line: 2443, type: !972)
!975 = !DILocation(line: 2443, column: 32, scope: !969)
!976 = !DILocation(line: 2445, column: 5, scope: !969)
!977 = !DILocation(line: 2451, column: 2, scope: !969)
!978 = distinct !DISubprogram(name: "_mm256_set_epi32", linkageName: "_ZN4core9core_arch3x863avx16_mm256_set_epi3217hdea7835f5c6d2b35E", scope: !883, file: !882, line: 2233, type: !979, scopeLine: 2233, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !982)
!979 = !DISubroutineType(types: !980)
!980 = !{!103, !981, !981, !981, !981, !981, !981, !981, !981}
!981 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990}
!983 = !DILocalVariable(name: "e0", arg: 1, scope: !978, file: !882, line: 2234, type: !981)
!984 = !DILocalVariable(name: "e1", arg: 2, scope: !978, file: !882, line: 2235, type: !981)
!985 = !DILocalVariable(name: "e2", arg: 3, scope: !978, file: !882, line: 2236, type: !981)
!986 = !DILocalVariable(name: "e3", arg: 4, scope: !978, file: !882, line: 2237, type: !981)
!987 = !DILocalVariable(name: "e4", arg: 5, scope: !978, file: !882, line: 2238, type: !981)
!988 = !DILocalVariable(name: "e5", arg: 6, scope: !978, file: !882, line: 2239, type: !981)
!989 = !DILocalVariable(name: "e6", arg: 7, scope: !978, file: !882, line: 2240, type: !981)
!990 = !DILocalVariable(name: "e7", arg: 8, scope: !978, file: !882, line: 2241, type: !981)
!991 = !DILocation(line: 2234, column: 5, scope: !978)
!992 = !DILocation(line: 2235, column: 5, scope: !978)
!993 = !DILocation(line: 2236, column: 5, scope: !978)
!994 = !DILocation(line: 2237, column: 5, scope: !978)
!995 = !DILocation(line: 2238, column: 5, scope: !978)
!996 = !DILocation(line: 2239, column: 5, scope: !978)
!997 = !DILocation(line: 2240, column: 5, scope: !978)
!998 = !DILocation(line: 2241, column: 5, scope: !978)
!999 = !DILocation(line: 2243, column: 5, scope: !978)
!1000 = !DILocation(line: 2244, column: 2, scope: !978)
!1001 = distinct !DISubprogram(name: "_mm256_setr_epi8", linkageName: "_ZN4core9core_arch3x863avx16_mm256_setr_epi817h0c2720d211c2ddc0E", scope: !883, file: !882, line: 2298, type: !1002, scopeLine: 2298, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !1004)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!103, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972, !972}
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1005 = !DILocalVariable(name: "e00", arg: 1, scope: !1001, file: !882, line: 2299, type: !972)
!1006 = !DILocalVariable(name: "e01", arg: 2, scope: !1001, file: !882, line: 2300, type: !972)
!1007 = !DILocalVariable(name: "e02", arg: 3, scope: !1001, file: !882, line: 2301, type: !972)
!1008 = !DILocalVariable(name: "e03", arg: 4, scope: !1001, file: !882, line: 2302, type: !972)
!1009 = !DILocalVariable(name: "e04", arg: 5, scope: !1001, file: !882, line: 2303, type: !972)
!1010 = !DILocalVariable(name: "e05", arg: 6, scope: !1001, file: !882, line: 2304, type: !972)
!1011 = !DILocalVariable(name: "e06", arg: 7, scope: !1001, file: !882, line: 2305, type: !972)
!1012 = !DILocalVariable(name: "e07", arg: 8, scope: !1001, file: !882, line: 2306, type: !972)
!1013 = !DILocalVariable(name: "e08", arg: 9, scope: !1001, file: !882, line: 2307, type: !972)
!1014 = !DILocalVariable(name: "e09", arg: 10, scope: !1001, file: !882, line: 2308, type: !972)
!1015 = !DILocalVariable(name: "e10", arg: 11, scope: !1001, file: !882, line: 2309, type: !972)
!1016 = !DILocalVariable(name: "e11", arg: 12, scope: !1001, file: !882, line: 2310, type: !972)
!1017 = !DILocalVariable(name: "e12", arg: 13, scope: !1001, file: !882, line: 2311, type: !972)
!1018 = !DILocalVariable(name: "e13", arg: 14, scope: !1001, file: !882, line: 2312, type: !972)
!1019 = !DILocalVariable(name: "e14", arg: 15, scope: !1001, file: !882, line: 2313, type: !972)
!1020 = !DILocalVariable(name: "e15", arg: 16, scope: !1001, file: !882, line: 2314, type: !972)
!1021 = !DILocalVariable(name: "e16", arg: 17, scope: !1001, file: !882, line: 2315, type: !972)
!1022 = !DILocalVariable(name: "e17", arg: 18, scope: !1001, file: !882, line: 2316, type: !972)
!1023 = !DILocalVariable(name: "e18", arg: 19, scope: !1001, file: !882, line: 2317, type: !972)
!1024 = !DILocalVariable(name: "e19", arg: 20, scope: !1001, file: !882, line: 2318, type: !972)
!1025 = !DILocalVariable(name: "e20", arg: 21, scope: !1001, file: !882, line: 2319, type: !972)
!1026 = !DILocalVariable(name: "e21", arg: 22, scope: !1001, file: !882, line: 2320, type: !972)
!1027 = !DILocalVariable(name: "e22", arg: 23, scope: !1001, file: !882, line: 2321, type: !972)
!1028 = !DILocalVariable(name: "e23", arg: 24, scope: !1001, file: !882, line: 2322, type: !972)
!1029 = !DILocalVariable(name: "e24", arg: 25, scope: !1001, file: !882, line: 2323, type: !972)
!1030 = !DILocalVariable(name: "e25", arg: 26, scope: !1001, file: !882, line: 2324, type: !972)
!1031 = !DILocalVariable(name: "e26", arg: 27, scope: !1001, file: !882, line: 2325, type: !972)
!1032 = !DILocalVariable(name: "e27", arg: 28, scope: !1001, file: !882, line: 2326, type: !972)
!1033 = !DILocalVariable(name: "e28", arg: 29, scope: !1001, file: !882, line: 2327, type: !972)
!1034 = !DILocalVariable(name: "e29", arg: 30, scope: !1001, file: !882, line: 2328, type: !972)
!1035 = !DILocalVariable(name: "e30", arg: 31, scope: !1001, file: !882, line: 2329, type: !972)
!1036 = !DILocalVariable(name: "e31", arg: 32, scope: !1001, file: !882, line: 2330, type: !972)
!1037 = !DILocation(line: 2299, column: 5, scope: !1001)
!1038 = !DILocation(line: 2300, column: 5, scope: !1001)
!1039 = !DILocation(line: 2301, column: 5, scope: !1001)
!1040 = !DILocation(line: 2302, column: 5, scope: !1001)
!1041 = !DILocation(line: 2303, column: 5, scope: !1001)
!1042 = !DILocation(line: 2304, column: 5, scope: !1001)
!1043 = !DILocation(line: 2305, column: 5, scope: !1001)
!1044 = !DILocation(line: 2306, column: 5, scope: !1001)
!1045 = !DILocation(line: 2307, column: 5, scope: !1001)
!1046 = !DILocation(line: 2308, column: 5, scope: !1001)
!1047 = !DILocation(line: 2309, column: 5, scope: !1001)
!1048 = !DILocation(line: 2310, column: 5, scope: !1001)
!1049 = !DILocation(line: 2311, column: 5, scope: !1001)
!1050 = !DILocation(line: 2312, column: 5, scope: !1001)
!1051 = !DILocation(line: 2313, column: 5, scope: !1001)
!1052 = !DILocation(line: 2314, column: 5, scope: !1001)
!1053 = !DILocation(line: 2315, column: 5, scope: !1001)
!1054 = !DILocation(line: 2316, column: 5, scope: !1001)
!1055 = !DILocation(line: 2317, column: 5, scope: !1001)
!1056 = !DILocation(line: 2318, column: 5, scope: !1001)
!1057 = !DILocation(line: 2319, column: 5, scope: !1001)
!1058 = !DILocation(line: 2320, column: 5, scope: !1001)
!1059 = !DILocation(line: 2321, column: 5, scope: !1001)
!1060 = !DILocation(line: 2322, column: 5, scope: !1001)
!1061 = !DILocation(line: 2323, column: 5, scope: !1001)
!1062 = !DILocation(line: 2324, column: 5, scope: !1001)
!1063 = !DILocation(line: 2325, column: 5, scope: !1001)
!1064 = !DILocation(line: 2326, column: 5, scope: !1001)
!1065 = !DILocation(line: 2327, column: 5, scope: !1001)
!1066 = !DILocation(line: 2328, column: 5, scope: !1001)
!1067 = !DILocation(line: 2329, column: 5, scope: !1001)
!1068 = !DILocation(line: 2330, column: 5, scope: !1001)
!1069 = !DILocation(line: 2334, column: 9, scope: !1001)
!1070 = !DILocalVariable(name: "x0", scope: !1071, file: !882, line: 2333, type: !972, align: 1)
!1071 = !DILexicalBlockFile(scope: !1072, file: !882, discriminator: 0)
!1072 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core9core_arch4simd5i8x323new17hfa419a49fa173a66E", scope: !1074, file: !1073, line: 14, type: !1109, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !125, templateParams: !14, retainedNodes: !1111)
!1073 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/../../stdarch/crates/core_arch/src/simd.rs", directory: "", checksumkind: CSK_MD5, checksum: "63d9ebb30586129c23e8d66246aac0f5")
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "i8x32", scope: !1075, file: !2, size: 256, align: 256, elements: !1076, templateParams: !14, identifier: "973331dc1a8199666666356500920d1c")
!1075 = !DINamespace(name: "simd", scope: !62)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1074, file: !2, baseType: !972, size: 8, align: 8)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 8)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 16)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "__3", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 24)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__4", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "__5", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 40)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "__6", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 48)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "__7", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 56)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__8", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "__9", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 72)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "__10", scope: !1074, file: !2, baseType: !972, size: 8, align: 8, offset: 80)
