; ModuleID = 'quote.5667ff69-cgu.0'
source_filename = "quote.5667ff69-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"core::iter::adapters::map::Map<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, [closure@/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/quote-1.0.40/src/runtime.rs:285:22: 285:29]>, fn(proc_macro2::TokenTree) -> proc_macro::TokenTree {proc_macro2::imp::into_compiler_token}>" = type { {}, %"core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, [closure@/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/quote-1.0.40/src/runtime.rs:285:22: 285:29]>" }
%"core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, [closure@/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/quote-1.0.40/src/runtime.rs:285:22: 285:29]>" = type { %"proc_macro2::token_stream::IntoIter", i32* }
%"proc_macro2::token_stream::IntoIter" = type { %"proc_macro2::marker::ProcMacroAutoTraits", %"proc_macro2::imp::TokenTreeIter" }
%"proc_macro2::marker::ProcMacroAutoTraits" = type { %"core::marker::PhantomData<alloc::rc::Rc<()>>" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<proc_macro2::LexError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<proc_macro2::LexError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !27, identifier: "b3b9ee73e429d41bcd0f6a115df2693")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !13, file: !2, size: 8, align: 8, elements: !14, templateParams: !27, identifier: "ed3b58e81dc8a7a01e4ee4624fb3123f")
!13 = !DINamespace(name: "proc_macro2", scope: null)
!14 = !{!15, !41}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !12, file: !2, baseType: !16, size: 8, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !17, file: !2, size: 8, align: 8, elements: !18, templateParams: !27, identifier: "4851c1548664b1676aa6d1f96b96d67e")
!17 = !DINamespace(name: "imp", scope: !13)
!18 = !{!19}
!19 = !DICompositeType(tag: DW_TAG_variant_part, scope: !16, file: !2, size: 8, align: 8, elements: !20, templateParams: !27, identifier: "57716e5bc2a35a9663e174541ab666d4", discriminator: !39)
!20 = !{!21, !28, !37}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !19, file: !2, baseType: !22, size: 8, align: 8, extraData: i64 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !16, file: !2, size: 8, align: 8, elements: !23, templateParams: !27, identifier: "2e7e42310f14f38d5a40df30c25447bb")
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !25, align: 8, offset: 8)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !26, file: !2, align: 8, elements: !27, identifier: "561439df579bba39d27b41bb6e6d90bd")
!26 = !DINamespace(name: "proc_macro", scope: null)
!27 = !{}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !19, file: !2, baseType: !29, size: 8, align: 8, extraData: i64 1)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !16, file: !2, size: 8, align: 8, elements: !30, templateParams: !27, identifier: "3ea5eca2f849c8a4fc091a09ff78f1")
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !29, file: !2, baseType: !32, align: 8, offset: 8)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !33, file: !2, align: 8, elements: !34, templateParams: !27, identifier: "9373b022cc6b37c24493868c03ebc5be")
!33 = !DINamespace(name: "fallback", scope: !13)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !32, file: !2, baseType: !36, align: 8)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !33, file: !2, align: 8, elements: !27, identifier: "82b09d0191e8017993e8e21e51bffedd")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CompilerPanic", scope: !19, file: !2, baseType: !38, size: 8, align: 8, extraData: i64 2)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "CompilerPanic", scope: !16, file: !2, size: 8, align: 8, elements: !27, identifier: "244ccbf377d981dea8a5194a5e82d987")
!39 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagArtificial)
!40 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !12, file: !2, baseType: !42, align: 8)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMacroAutoTraits", scope: !43, file: !2, align: 8, elements: !44, templateParams: !27, identifier: "d9e5ce70df1b6e2616c194bfa34f5906")
!43 = !DINamespace(name: "marker", scope: !13)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !42, file: !2, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::Rc<()>>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !49, identifier: "826db18d657d8af4690ad5c62fdcca1f")
!47 = !DINamespace(name: "marker", scope: !48)
!48 = !DINamespace(name: "core", scope: null)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "T", type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<()>", scope: !52, file: !2, size: 64, align: 64, elements: !54, templateParams: !76, identifier: "dd9e6686920c7d3155783e0f89c0f231")
!52 = !DINamespace(name: "rc", scope: !53)
!53 = !DINamespace(name: "alloc", scope: null)
!54 = !{!55, !80}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, file: !2, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<()>>", scope: !57, file: !2, size: 64, align: 64, elements: !59, templateParams: !78, identifier: "ec10fede899e7895aaeaffe9d543db64")
!57 = !DINamespace(name: "non_null", scope: !58)
!58 = !DINamespace(name: "ptr", scope: !48)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !56, file: !2, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::rc::RcBox<()>", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<()>", scope: !52, file: !2, size: 128, align: 64, elements: !63, templateParams: !76, identifier: "62929d8b5e30bbcab9ac547d07c8e8c4")
!63 = !{!64, !74, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !62, file: !2, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !66, file: !2, size: 64, align: 64, elements: !67, templateParams: !72, identifier: "ae5a11694c1e5ba44f5295e76262233e")
!66 = !DINamespace(name: "cell", scope: !48)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !65, file: !2, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !66, file: !2, size: 64, align: 64, elements: !70, templateParams: !72, identifier: "1096bf4d22c004093180ac32ada74dc8")
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !69, file: !2, baseType: !9, size: 64, align: 64)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !9)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !62, file: !2, baseType: !65, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !62, file: !2, baseType: !7, align: 8, offset: 128)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !7)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "T", type: !62)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !51, file: !2, baseType: !81, align: 8)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<()>>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !78, identifier: "de2652c326c70ba1d8efaf286ebc826c")
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !85, vtableHolder: !90, templateParams: !27, identifier: "821c7e7c34fa68c5cb3c211553f8d1c9")
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !84, file: !2, baseType: !6, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !84, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !91, file: !2, align: 8, elements: !27, identifier: "6e89e1d1b17d37435f7b87cb1d5cb26d")
!91 = !DINamespace(name: "layout", scope: !92)
!92 = !DINamespace(name: "alloc", scope: !48)
!93 = !{i32 7, !"PIC Level", i32 2}
!94 = !{i32 2, !"RtLibUseGOT", i32 1}
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !98, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, globals: !202)
!98 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/quote-1.0.40/src/lib.rs/@/quote.5667ff69-cgu.0", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/quote-1.0.40")
!99 = !{!100, !106, !107, !111, !180, !189, !195}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Delimiter", scope: !26, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIEnumerator(name: "Parenthesis", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "Brace", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "Bracket", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "None", value: 3, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Delimiter", scope: !13, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !101)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Spacing", scope: !13, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !108)
!108 = !{!109, !110}
!109 = !DIEnumerator(name: "Alone", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "Joint", value: 1, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !112, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagEnumClass, elements: !115)
!112 = !DINamespace(name: "valid_align", scope: !113)
!113 = !DINamespace(name: "mem", scope: !48)
!114 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!116 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !181, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !184)
!181 = !DINamespace(name: "v1", scope: !182)
!182 = !DINamespace(name: "rt", scope: !183)
!183 = !DINamespace(name: "fmt", scope: !48)
!184 = !{!185, !186, !187, !188}
!185 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!186 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!187 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!188 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !190, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagEnumClass, elements: !191)
!190 = !DINamespace(name: "panicking", scope: !48)
!191 = !{!192, !193, !194}
!192 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!193 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!194 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !196, file: !2, baseType: !197, size: 8, align: 8, flags: DIFlagEnumClass, elements: !198)
!196 = !DINamespace(name: "cmp", scope: !48)
!197 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!198 = !{!199, !200, !201}
!199 = !DIEnumerator(name: "Less", value: 255)
!200 = !DIEnumerator(name: "Equal", value: 0)
!201 = !DIEnumerator(name: "Greater", value: 1)
!202 = !{!0, !82}
!203 = distinct !DISubprogram(name: "index", linkageName: "_ZN100_$LT$alloc..string..String$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17hfbae29147f256e34E", scope: !205, file: !204, line: 2341, type: !207, scopeLine: 2341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !27, retainedNodes: !257)
!204 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "e1c2cdf24b94f38a53da13b30e8aa8ef")
!205 = !DINamespace(name: "{impl#28}", scope: !206)
!206 = !DINamespace(name: "string", scope: !53)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !214, !245, !248}
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !210, templateParams: !27, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !209, file: !2, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !209, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !215, size: 64, align: 64, dwarfAddressSpace: 0)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !206, file: !2, size: 192, align: 64, elements: !216, templateParams: !27, identifier: "f9be69e76fc784402e5b8eb88fb718b5")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !215, file: !2, baseType: !218, size: 192, align: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !219, file: !2, size: 192, align: 64, elements: !220, templateParams: !242, identifier: "f48a096c1ed19eb7ba15a7173429013")
!219 = !DINamespace(name: "vec", scope: !53)
!220 = !{!221, !244}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !218, file: !2, baseType: !222, size: 128, align: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !223, file: !2, size: 128, align: 64, elements: !224, templateParams: !242, identifier: "d09dab1a097018b9dd4dad6f3ce84c27")
!223 = !DINamespace(name: "raw_vec", scope: !53)
!224 = !{!225, !238, !239}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !222, file: !2, baseType: !226, size: 64, align: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !227, file: !2, size: 64, align: 64, elements: !228, templateParams: !234, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!227 = !DINamespace(name: "unique", scope: !58)
!228 = !{!229, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !226, file: !2, baseType: !230, size: 64, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !57, file: !2, size: 64, align: 64, elements: !231, templateParams: !234, identifier: "3160283ea80cecf6149fff38a2e996de")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !230, file: !2, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = !{!235}
!235 = !DITemplateTypeParameter(name: "T", type: !40)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !226, file: !2, baseType: !237, align: 8)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !234, identifier: "e338a8151f1037c76eadd10ab3c53972")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !222, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !222, file: !2, baseType: !240, align: 8)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !241, file: !2, align: 8, elements: !27, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!241 = !DINamespace(name: "alloc", scope: !53)
!242 = !{!235, !243}
!243 = !DITemplateTypeParameter(name: "A", type: !240)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !246, file: !2, align: 8, elements: !27, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!246 = !DINamespace(name: "range", scope: !247)
!247 = !DINamespace(name: "ops", scope: !48)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !249, size: 64, align: 64, dwarfAddressSpace: 0)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !250, file: !2, size: 192, align: 64, elements: !252, templateParams: !27, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!250 = !DINamespace(name: "location", scope: !251)
!251 = !DINamespace(name: "panic", scope: !48)
!252 = !{!253, !254, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !249, file: !2, baseType: !209, size: 128, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !249, file: !2, baseType: !255, size: 32, align: 32, offset: 128)
!255 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !249, file: !2, baseType: !255, size: 32, align: 32, offset: 160)
!257 = !{!258, !259}
!258 = !DILocalVariable(name: "self", arg: 1, scope: !203, file: !204, line: 2341, type: !214)
!259 = !DILocalVariable(name: "_index", arg: 2, scope: !203, file: !204, line: 2341, type: !245)
!260 = !DILocation(line: 2341, column: 14, scope: !203)
!261 = !DILocation(line: 2341, column: 21, scope: !203)
!262 = !DILocation(line: 2342, column: 43, scope: !203)
!263 = !DILocalVariable(name: "self", scope: !264, file: !204, line: 2342, type: !274, align: 8)
!264 = !DILexicalBlockFile(scope: !265, file: !204, discriminator: 0)
!265 = distinct !DISubprogram(name: "deref<u8, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$core..ops..deref..Deref$GT$5deref17h29e94f82c05f7c94E", scope: !267, file: !266, line: 2531, type: !268, scopeLine: 2531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !242, retainedNodes: !275)
!266 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/alloc/src/vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ccced07f4d2284e276bdff9c5cb81e82")
!267 = !DINamespace(name: "{impl#10}", scope: !219)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !274}
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !271, templateParams: !27, identifier: "7d49e60d2ca720f66806f7375f860e2")
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !270, file: !2, baseType: !212, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !270, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !218, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !{!263}
!276 = !DILocation(line: 2342, column: 43, scope: !264, inlinedAt: !262)
!277 = !DILocalVariable(name: "data", scope: !278, file: !204, line: 2342, type: !233, align: 8)
!278 = !DILexicalBlockFile(scope: !279, file: !204, discriminator: 0)
!279 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17haa1667b1fd2a053fE", scope: !281, file: !280, line: 90, type: !283, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !234, retainedNodes: !285)
!280 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "bc05ab33aeb77226885613c6dc511a0a")
!281 = !DINamespace(name: "raw", scope: !282)
!282 = !DINamespace(name: "slice", scope: !48)
!283 = !DISubroutineType(types: !284)
!284 = !{!270, !233, !9}
!285 = !{!277, !286, !287}
!286 = !DILocalVariable(name: "len", scope: !278, file: !204, line: 2342, type: !9, align: 8)
!287 = !DILocalVariable(name: "runtime", scope: !288, file: !204, line: 2342, type: !291, align: 8)
!288 = !DILexicalBlockFile(scope: !289, file: !204, discriminator: 0)
!289 = distinct !DILexicalBlock(scope: !279, file: !290, line: 2336, column: 13)
!290 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "f96ba730d7cf23ae45fdc72e7caf5f1b")
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !292, file: !2, size: 128, align: 64, elements: !293, templateParams: !27, identifier: "ca6adac9bf5585e57d20f143c4c8a4b5")
!292 = !DINamespace(name: "from_raw_parts", scope: !281)
!293 = !{!294, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__data", scope: !291, file: !2, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const u8", baseType: !233, size: 64, align: 64, dwarfAddressSpace: 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__len", scope: !291, file: !2, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !DILocation(line: 2342, column: 43, scope: !278, inlinedAt: !299)
!299 = !DILocation(line: 2532, column: 18, scope: !265, inlinedAt: !262)
!300 = !DILocalVariable(name: "data", scope: !301, file: !204, line: 2342, type: !233, align: 8)
!301 = !DILexicalBlockFile(scope: !302, file: !204, discriminator: 0)
!302 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h205c964f88a481afE", scope: !58, file: !303, line: 695, type: !304, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !234, retainedNodes: !310)
!303 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !233, !9}
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !307, templateParams: !27, identifier: "7b54d414f2f329e57c9aa3e4ca07f4")
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !306, file: !2, baseType: !212, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !306, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!310 = !{!300, !311}
!311 = !DILocalVariable(name: "len", scope: !301, file: !204, line: 2342, type: !9, align: 8)
!312 = !DILocation(line: 2342, column: 43, scope: !301, inlinedAt: !313)
!313 = !DILocation(line: 97, column: 11, scope: !279, inlinedAt: !299)
!314 = !DILocalVariable(name: "self", scope: !315, file: !204, line: 2342, type: !233, align: 8)
!315 = !DILexicalBlockFile(scope: !316, file: !204, discriminator: 0)
!316 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hda44ab5ecfd3f5a9E", scope: !318, file: !317, line: 46, type: !320, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !323, retainedNodes: !322)
!317 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!318 = !DINamespace(name: "{impl#0}", scope: !319)
!319 = !DINamespace(name: "const_ptr", scope: !58)
!320 = !DISubroutineType(types: !321)
!321 = !{!6, !233}
!322 = !{!314}
!323 = !{!235, !324}
!324 = !DITemplateTypeParameter(name: "U", type: !7)
!325 = !DILocation(line: 2342, column: 43, scope: !315, inlinedAt: !326)
!326 = !DILocation(line: 696, column: 20, scope: !302, inlinedAt: !313)
!327 = !DILocalVariable(name: "data_address", scope: !328, file: !204, line: 2342, type: !6, align: 8)
!328 = !DILexicalBlockFile(scope: !329, file: !204, discriminator: 0)
!329 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17ha252ca62852f700aE", scope: !331, file: !330, line: 110, type: !332, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !234, retainedNodes: !334)
!330 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!331 = !DINamespace(name: "metadata", scope: !58)
!332 = !DISubroutineType(types: !333)
!333 = !{!306, !6, !9}
!334 = !{!327, !335}
!335 = !DILocalVariable(name: "metadata", scope: !328, file: !204, line: 2342, type: !9, align: 8)
!336 = !DILocation(line: 2342, column: 43, scope: !328, inlinedAt: !337)
!337 = !DILocation(line: 696, column: 5, scope: !302, inlinedAt: !313)
!338 = !DILocalVariable(name: "v", scope: !339, file: !204, line: 2342, type: !270, align: 8)
!339 = !DILexicalBlockFile(scope: !340, file: !204, discriminator: 0)
!340 = distinct !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN4core3str8converts19from_utf8_unchecked17hcb1298c25d21f974E", scope: !342, file: !341, line: 170, type: !344, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !27, retainedNodes: !346)
!341 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "459d256946ab11c35b95264d728167a0")
!342 = !DINamespace(name: "converts", scope: !343)
!343 = !DINamespace(name: "str", scope: !48)
!344 = !DISubroutineType(types: !345)
!345 = !{!209, !270}
!346 = !{!338}
!347 = !DILocation(line: 2342, column: 18, scope: !339, inlinedAt: !348)
!348 = !DILocation(line: 2342, column: 18, scope: !203)
!349 = !{i64 1}
!350 = !DILocation(line: 2343, column: 6, scope: !203)
!351 = distinct !DISubprogram(name: "fold<proc_macro::TokenTree, core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>, fn(proc_macro2::TokenTree) -> proc_macro::TokenTree, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro::TokenTree, proc_macro::{impl#19}::from_iter::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>, fn(proc_macro2::TokenTree) -> proc_macro::TokenTree>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h2225c979ac24fd3cE", scope: !353, file: !352, line: 120, type: !357, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !799, retainedNodes: !795)
!352 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "26d2695af1ed5a432620c89623758817")
!353 = !DINamespace(name: "{impl#2}", scope: !354)
!354 = !DINamespace(name: "map", scope: !355)
!355 = !DINamespace(name: "adapters", scope: !356)
!356 = !DINamespace(name: "iter", scope: !48)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !359, !7, !765}
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>, fn(proc_macro2::TokenTree) -> proc_macro::TokenTree>", scope: !354, file: !2, size: 384, align: 64, elements: !360, templateParams: !762, identifier: "7b473048a61833d64cd9eea675e22a93")
!360 = !{!361, !734}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !359, file: !2, baseType: !362, size: 384, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>", scope: !354, file: !2, size: 384, align: 64, elements: !363, templateParams: !731, identifier: "65c15dd9c7427146f4205b75b36563d1")
!363 = !{!364, !723}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !362, file: !2, baseType: !365, size: 320, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter", scope: !366, file: !2, size: 320, align: 64, elements: !367, templateParams: !27, identifier: "cc1066517bbc56a61c75a2c09893cd93")
!366 = !DINamespace(name: "token_stream", scope: !13)
!367 = !{!368, !722}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !365, file: !2, baseType: !369, size: 320, align: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTreeIter", scope: !17, file: !2, size: 320, align: 64, elements: !370, templateParams: !27, identifier: "f8aaa1c4c9f8a56827a98dc7a2cf3ad")
!370 = !{!371}
!371 = !DICompositeType(tag: DW_TAG_variant_part, scope: !369, file: !2, size: 320, align: 64, elements: !372, templateParams: !27, identifier: "584b6cdd4c66fc067ffb14aedc88f3cf", discriminator: !721)
!372 = !{!373, !536}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !371, file: !2, baseType: !374, size: 320, align: 64, extraData: i64 0)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !369, file: !2, size: 320, align: 64, elements: !375, templateParams: !27, identifier: "e1c02f1d2ac5409df298f60c1ab62166")
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !374, file: !2, baseType: !377, size: 256, align: 64, offset: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter", scope: !378, file: !2, size: 256, align: 64, elements: !379, templateParams: !27, identifier: "a97583024ec81490c10d186f4f766255")
!378 = !DINamespace(name: "token_stream", scope: !26)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !377, file: !2, baseType: !381, size: 256, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>, alloc::alloc::Global>", scope: !382, file: !2, size: 256, align: 64, elements: !383, templateParams: !535, identifier: "937f03cc9a4e9b33fe2eaa6d05ca081")
!382 = !DINamespace(name: "into_iter", scope: !219)
!383 = !{!384, !523, !525, !526, !533, !534}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !381, file: !2, baseType: !385, size: 64, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>>", scope: !57, file: !2, size: 64, align: 64, elements: !386, templateParams: !521, identifier: "87c46f2cc1ff67c1bd52476489ffbd2e")
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !385, file: !2, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", baseType: !389, size: 64, align: 64, dwarfAddressSpace: 0)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", scope: !390, file: !2, size: 192, align: 32, elements: !391, templateParams: !27, identifier: "a058b0a8a54ba7bec551d323f86f29d3")
!390 = !DINamespace(name: "bridge", scope: !26)
!391 = !{!392}
!392 = !DICompositeType(tag: DW_TAG_variant_part, scope: !389, file: !2, size: 192, align: 32, elements: !393, templateParams: !27, identifier: "74d921bea2a5610a160c59a655b2245", discriminator: !520)
!393 = !{!394, !450, !460, !470}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Group", scope: !392, file: !2, baseType: !395, size: 192, align: 32, extraData: i64 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !389, file: !2, size: 192, align: 32, elements: !396, templateParams: !444, identifier: "2d3abaec479dbf1e6a34d40cc3985a")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !395, file: !2, baseType: !398, size: 160, align: 32, offset: 32)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span>", scope: !390, file: !2, size: 160, align: 32, elements: !399, templateParams: !442, identifier: "1780d5c44f6789d22c9d47c1b8221ab6")
!399 = !{!400, !401, !430}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter", scope: !398, file: !2, baseType: !100, size: 8, align: 8, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !398, file: !2, baseType: !402, size: 32, align: 32)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro::bridge::client::TokenStream>", scope: !403, file: !2, size: 32, align: 32, elements: !404, templateParams: !27, identifier: "8ad0b25bb8d31228302e94cee0a24034")
!403 = !DINamespace(name: "option", scope: !48)
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !402, file: !2, size: 32, align: 32, elements: !406, templateParams: !27, identifier: "74e7cf86130dadfdfb4eb9fb5d8c5ce4", discriminator: !429)
!406 = !{!407, !425}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !405, file: !2, baseType: !408, size: 32, align: 32, extraData: i64 0)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !402, file: !2, size: 32, align: 32, elements: !27, templateParams: !409, identifier: "51a5de093dc0919c17bbc4e5158ef522")
!409 = !{!410}
!410 = !DITemplateTypeParameter(name: "T", type: !411)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !412, file: !2, size: 32, align: 32, elements: !413, templateParams: !27, identifier: "d9e64564679f5fcbdec22187d04d0987")
!412 = !DINamespace(name: "client", scope: !390)
!413 = !{!414, !420}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !411, file: !2, baseType: !415, size: 32, align: 32)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU32", scope: !416, file: !2, size: 32, align: 32, elements: !418, templateParams: !27, identifier: "e46ff5734dc27d2ff94aac449842093")
!416 = !DINamespace(name: "nonzero", scope: !417)
!417 = !DINamespace(name: "num", scope: !48)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !415, file: !2, baseType: !255, size: 32, align: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !411, file: !2, baseType: !421, align: 8)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*mut ()>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !422, identifier: "18fb208f61778056185d1ea9e77c84e5")
!422 = !{!423}
!423 = !DITemplateTypeParameter(name: "T", type: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !405, file: !2, baseType: !426, size: 32, align: 32)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !402, file: !2, size: 32, align: 32, elements: !427, templateParams: !409, identifier: "543621716dfd29ee353ce82dd9490845")
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !426, file: !2, baseType: !411, size: 32, align: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !398, file: !2, baseType: !431, size: 96, align: 32, offset: 32)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "DelimSpan<proc_macro::bridge::client::Span>", scope: !390, file: !2, size: 96, align: 32, elements: !432, templateParams: !440, identifier: "d9b625c729e7cd27a8e0a054be6a50e1")
!432 = !{!433, !438, !439}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !431, file: !2, baseType: !434, size: 32, align: 32)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !412, file: !2, size: 32, align: 32, elements: !435, templateParams: !27, identifier: "8960f0fb59aa19baf9f69b5743da8a6")
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !434, file: !2, baseType: !415, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !434, file: !2, baseType: !421, align: 8)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !431, file: !2, baseType: !434, size: 32, align: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "entire", scope: !431, file: !2, baseType: !434, size: 32, align: 32, offset: 64)
!440 = !{!441}
!441 = !DITemplateTypeParameter(name: "Span", type: !434)
!442 = !{!443, !441}
!443 = !DITemplateTypeParameter(name: "TokenStream", type: !411)
!444 = !{!443, !441, !445}
!445 = !DITemplateTypeParameter(name: "Symbol", type: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symbol", scope: !447, file: !2, size: 32, align: 32, elements: !448, templateParams: !27, identifier: "df6394bef4813d4e92687d8dcabc7350")
!447 = !DINamespace(name: "symbol", scope: !390)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !446, file: !2, baseType: !415, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Punct", scope: !392, file: !2, baseType: !451, size: 192, align: 32, extraData: i64 1)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !389, file: !2, size: 192, align: 32, elements: !452, templateParams: !444, identifier: "87264ae22827025ab23bc612a782f269")
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !451, file: !2, baseType: !454, size: 64, align: 32, offset: 32)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct<proc_macro::bridge::client::Span>", scope: !390, file: !2, size: 64, align: 32, elements: !455, templateParams: !440, identifier: "71ecc4b817fec321b34356897b4fb70b")
!455 = !{!456, !457, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !454, file: !2, baseType: !40, size: 8, align: 8, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "joint", scope: !454, file: !2, baseType: !458, size: 8, align: 8, offset: 40)
!458 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !454, file: !2, baseType: !434, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !392, file: !2, baseType: !461, size: 192, align: 32, extraData: i64 2)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !389, file: !2, size: 192, align: 32, elements: !462, templateParams: !444, identifier: "8d9342ffbd9ecbcc47bdef27863a6c51")
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !461, file: !2, baseType: !464, size: 96, align: 32, offset: 32)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident<proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", scope: !390, file: !2, size: 96, align: 32, elements: !465, templateParams: !469, identifier: "6469d15d9c10d31a9b1ea8856a172794")
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !464, file: !2, baseType: !446, size: 32, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "is_raw", scope: !464, file: !2, baseType: !458, size: 8, align: 8, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !464, file: !2, baseType: !434, size: 32, align: 32, offset: 32)
!469 = !{!441, !445}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Literal", scope: !392, file: !2, baseType: !471, size: 192, align: 32, extraData: i64 3)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !389, file: !2, size: 192, align: 32, elements: !472, templateParams: !444, identifier: "a2bbb636f1286eabbc61a42abddf67aa")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !471, file: !2, baseType: !474, size: 128, align: 32, offset: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal<proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>", scope: !390, file: !2, size: 128, align: 32, elements: !475, templateParams: !469, identifier: "a55906b10294ef684dabd1fc6cbd768")
!475 = !{!476, !504, !505, !519}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !474, file: !2, baseType: !477, size: 16, align: 8, offset: 96)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "LitKind", scope: !390, file: !2, size: 16, align: 8, elements: !478, templateParams: !27, identifier: "d4ebbd6296eefcffa28843a71f5a72f9")
!478 = !{!479}
!479 = !DICompositeType(tag: DW_TAG_variant_part, scope: !477, file: !2, size: 16, align: 8, elements: !480, templateParams: !27, identifier: "ae8854feca074542c7a494fb4f2c3762", discriminator: !503)
!480 = !{!481, !483, !485, !487, !489, !491, !495, !497, !501}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Byte", scope: !479, file: !2, baseType: !482, size: 16, align: 8, extraData: i64 0)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Byte", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "a51487f9e5b63b2b7754ab965890222")
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Char", scope: !479, file: !2, baseType: !484, size: 16, align: 8, extraData: i64 1)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Char", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "590269a1a0f0f6be7d47ea43bfd17fe")
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Integer", scope: !479, file: !2, baseType: !486, size: 16, align: 8, extraData: i64 2)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "Integer", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "efa66e0589a7227b2a10cd41e14a7f6e")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Float", scope: !479, file: !2, baseType: !488, size: 16, align: 8, extraData: i64 3)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Float", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "78cd17e748a9eb2c52d770973d0faada")
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !479, file: !2, baseType: !490, size: 16, align: 8, extraData: i64 4)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "Str", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "741d3602ab25373214ae52255d80075a")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "StrRaw", scope: !479, file: !2, baseType: !492, size: 16, align: 8, extraData: i64 5)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrRaw", scope: !477, file: !2, size: 16, align: 8, elements: !493, templateParams: !27, identifier: "f6ec344f52bafe6b30404d337e00efde")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !492, file: !2, baseType: !40, size: 8, align: 8, offset: 8)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ByteStr", scope: !479, file: !2, baseType: !496, size: 16, align: 8, extraData: i64 6)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteStr", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "66928175a47f8c405e850e50d7d23836")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ByteStrRaw", scope: !479, file: !2, baseType: !498, size: 16, align: 8, extraData: i64 7)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteStrRaw", scope: !477, file: !2, size: 16, align: 8, elements: !499, templateParams: !27, identifier: "9ed6700a1c414c614ecdf74a78b00f71")
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !498, file: !2, baseType: !40, size: 8, align: 8, offset: 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !479, file: !2, baseType: !502, size: 16, align: 8, extraData: i64 8)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !477, file: !2, size: 16, align: 8, elements: !27, identifier: "24c8955d32a615fbe8f4a3107763d187")
!503 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !2, baseType: !40, size: 8, align: 8, flags: DIFlagArtificial)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !474, file: !2, baseType: !446, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !474, file: !2, baseType: !506, size: 32, align: 32, offset: 32)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro::bridge::symbol::Symbol>", scope: !403, file: !2, size: 32, align: 32, elements: !507, templateParams: !27, identifier: "43d8bd2e828cc9bb3857f0ddafb9d568")
!507 = !{!508}
!508 = !DICompositeType(tag: DW_TAG_variant_part, scope: !506, file: !2, size: 32, align: 32, elements: !509, templateParams: !27, identifier: "cd574a1b682af09f3a9d8604838ced68", discriminator: !518)
!509 = !{!510, !514}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !508, file: !2, baseType: !511, size: 32, align: 32, extraData: i64 0)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !506, file: !2, size: 32, align: 32, elements: !27, templateParams: !512, identifier: "42cd1a26887aa30b6265f50c85bf104")
!512 = !{!513}
!513 = !DITemplateTypeParameter(name: "T", type: !446)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !508, file: !2, baseType: !515, size: 32, align: 32)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !506, file: !2, size: 32, align: 32, elements: !516, templateParams: !512, identifier: "a94524df294a14e431f2008137ec63d8")
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !515, file: !2, baseType: !446, size: 32, align: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !474, file: !2, baseType: !434, size: 32, align: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!521 = !{!522}
!522 = !DITemplateTypeParameter(name: "T", type: !389)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !381, file: !2, baseType: !524, align: 8)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !521, identifier: "95305cb2f9e115ce7b6a3bfec87356b5")
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !381, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !381, file: !2, baseType: !527, align: 8)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::alloc::Global>", scope: !528, file: !2, align: 8, elements: !529, templateParams: !531, identifier: "899e548b6e114c8b20c5123edbf2f0a4")
!528 = !DINamespace(name: "manually_drop", scope: !113)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !527, file: !2, baseType: !240, align: 8)
!531 = !{!532}
!532 = !DITemplateTypeParameter(name: "T", type: !240)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !381, file: !2, baseType: !388, size: 64, align: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !381, file: !2, baseType: !388, size: 64, align: 64, offset: 192)
!535 = !{!522, !243}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !371, file: !2, baseType: !537, size: 320, align: 64, extraData: i64 1)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !369, file: !2, size: 320, align: 64, elements: !538, templateParams: !27, identifier: "85521fba72ee845c7a6528e02eb67c21")
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !537, file: !2, baseType: !540, size: 256, align: 64, offset: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcVecIntoIter<proc_macro2::TokenTree>", scope: !541, file: !2, size: 256, align: 64, elements: !542, templateParams: !610, identifier: "3d706e7cf194629f961fc53a3abe9bf1")
!541 = !DINamespace(name: "rcvec", scope: !13)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !540, file: !2, baseType: !544, size: 256, align: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<proc_macro2::TokenTree, alloc::alloc::Global>", scope: !382, file: !2, size: 256, align: 64, elements: !545, templateParams: !614, identifier: "c1d370dbc82398612d71711c299a679f")
!545 = !{!546, !716, !717, !718, !719, !720}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !544, file: !2, baseType: !547, size: 64, align: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro2::TokenTree>", scope: !57, file: !2, size: 64, align: 64, elements: !548, templateParams: !610, identifier: "c956b308a1fd194deaef1039a74a0474")
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !547, file: !2, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro2::TokenTree", baseType: !551, size: 64, align: 64, dwarfAddressSpace: 0)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTree", scope: !13, file: !2, size: 320, align: 64, elements: !552, templateParams: !27, identifier: "1f3f9a4f123d229d6d32bece15416322")
!552 = !{!553}
!553 = !DICompositeType(tag: DW_TAG_variant_part, scope: !551, file: !2, size: 320, align: 64, elements: !554, templateParams: !27, identifier: "b820de01d4da663d39b53b0afa426c9", discriminator: !715)
!554 = !{!555, !624, !657, !687}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Group", scope: !553, file: !2, baseType: !556, size: 320, align: 64, extraData: i64 0)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !551, file: !2, size: 320, align: 64, elements: !557, templateParams: !27, identifier: "5be722160698bf10971c4319bd76876b")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !556, file: !2, baseType: !559, size: 192, align: 64, offset: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !13, file: !2, size: 192, align: 64, elements: !560, templateParams: !27, identifier: "57a339c6327bbf4de9004acef1269f")
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !559, file: !2, baseType: !562, size: 192, align: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !17, file: !2, size: 192, align: 64, elements: !563, templateParams: !27, identifier: "e16a1227d789e13ee66199a8461df463")
!563 = !{!564}
!564 = !DICompositeType(tag: DW_TAG_variant_part, scope: !562, file: !2, size: 192, align: 64, elements: !565, templateParams: !27, identifier: "514a83a185aa08b7f6b4fbe2d2924747", discriminator: !623)
!565 = !{!566, !573}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !564, file: !2, baseType: !567, size: 192, align: 64, extraData: i64 0)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !562, file: !2, size: 192, align: 64, elements: !568, templateParams: !27, identifier: "4cdfd1297da2ae49bb47672e3b4fbefd")
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !567, file: !2, baseType: !570, size: 160, align: 32, offset: 32)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !26, file: !2, size: 160, align: 32, elements: !571, templateParams: !27, identifier: "8996456f1a99e27a573aa43eff3a9e5")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !570, file: !2, baseType: !398, size: 160, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !564, file: !2, baseType: !574, size: 192, align: 64, extraData: i64 1)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !562, file: !2, size: 192, align: 64, elements: !575, templateParams: !27, identifier: "1db8016496e603dbdf343f4ee94c24a8")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !574, file: !2, baseType: !577, size: 128, align: 64, offset: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !33, file: !2, size: 128, align: 64, elements: !578, templateParams: !27, identifier: "d505cb0e9299281464d8abc890e0f5a4")
!578 = !{!579, !580, !622}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter", scope: !577, file: !2, baseType: !106, size: 8, align: 8, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !577, file: !2, baseType: !581, size: 64, align: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !33, file: !2, size: 64, align: 64, elements: !582, templateParams: !27, identifier: "c67d2f69c0da37e47bfb820988f07c1b")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !581, file: !2, baseType: !584, size: 64, align: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcVec<proc_macro2::TokenTree>", scope: !541, file: !2, size: 64, align: 64, elements: !585, templateParams: !610, identifier: "c74fb6d535b59f68d5d858e3ad0efbd7")
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !584, file: !2, baseType: !587, size: 64, align: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>", scope: !52, file: !2, size: 64, align: 64, elements: !588, templateParams: !616, identifier: "636d4defe4958c232aee3100baff239c")
!588 = !{!589, !620}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !587, file: !2, baseType: !590, size: 64, align: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>>", scope: !57, file: !2, size: 64, align: 64, elements: !591, templateParams: !618, identifier: "75f2477828aaf381cd35b639f757869b")
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !590, file: !2, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::rc::RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>", baseType: !594, size: 64, align: 64, dwarfAddressSpace: 0)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>", scope: !52, file: !2, size: 320, align: 64, elements: !595, templateParams: !616, identifier: "9d5e6e657104c85fba0c7034e715617f")
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !594, file: !2, baseType: !65, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !594, file: !2, baseType: !65, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !594, file: !2, baseType: !599, size: 192, align: 64, offset: 128)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<proc_macro2::TokenTree, alloc::alloc::Global>", scope: !219, file: !2, size: 192, align: 64, elements: !600, templateParams: !614, identifier: "d0a72235d691e48538f435dbe8c1a4a8")
!600 = !{!601, !615}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !599, file: !2, baseType: !602, size: 128, align: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<proc_macro2::TokenTree, alloc::alloc::Global>", scope: !223, file: !2, size: 128, align: 64, elements: !603, templateParams: !614, identifier: "1ef4554fcc06862b88ed5d4987e8a16")
!603 = !{!604, !612, !613}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !602, file: !2, baseType: !605, size: 64, align: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<proc_macro2::TokenTree>", scope: !227, file: !2, size: 64, align: 64, elements: !606, templateParams: !610, identifier: "eace75154bc9edd4ebaf2e69a12427f8")
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !605, file: !2, baseType: !547, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !605, file: !2, baseType: !609, align: 8)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro2::TokenTree>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !610, identifier: "c25481b89ac31f21e3bfe669bfd00c78")
!610 = !{!611}
!611 = !DITemplateTypeParameter(name: "T", type: !551)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !602, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !602, file: !2, baseType: !240, align: 8)
!614 = !{!611, !243}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!616 = !{!617}
!617 = !DITemplateTypeParameter(name: "T", type: !599)
!618 = !{!619}
!619 = !DITemplateTypeParameter(name: "T", type: !594)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !587, file: !2, baseType: !621, align: 8)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcBox<alloc::vec::Vec<proc_macro2::TokenTree, alloc::alloc::Global>>>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !618, identifier: "3ced32981df0564fd35ba3a964cbccd4")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !577, file: !2, baseType: !36, align: 8)
!623 = !DIDerivedType(tag: DW_TAG_member, scope: !562, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !553, file: !2, baseType: !625, size: 320, align: 64, extraData: i64 1)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !551, file: !2, size: 320, align: 64, elements: !626, templateParams: !27, identifier: "1504394f29b8b5265892b35fa8291460")
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !625, file: !2, baseType: !628, size: 256, align: 64, offset: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !13, file: !2, size: 256, align: 64, elements: !629, templateParams: !27, identifier: "7c9b18c333739cf0f9d5e9b2a2d3f096")
!629 = !{!630, !656}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !628, file: !2, baseType: !631, size: 256, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !17, file: !2, size: 256, align: 64, elements: !632, templateParams: !27, identifier: "ce6e2e0b65882185d6af3792f72a7992")
!632 = !{!633}
!633 = !DICompositeType(tag: DW_TAG_variant_part, scope: !631, file: !2, size: 256, align: 64, elements: !634, templateParams: !27, identifier: "a2fe46b81391ff72c0a61da688916af2", discriminator: !655)
!634 = !{!635, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !633, file: !2, baseType: !636, size: 256, align: 64, extraData: i64 0)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !631, file: !2, size: 256, align: 64, elements: !637, templateParams: !27, identifier: "54391a1e21feee3d79a1fa0f8d456d1")
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !636, file: !2, baseType: !639, size: 96, align: 32, offset: 32)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !26, file: !2, size: 96, align: 32, elements: !640, templateParams: !27, identifier: "9cd6071c98ee71056246978a35bc963c")
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !639, file: !2, baseType: !464, size: 96, align: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !633, file: !2, baseType: !643, size: 256, align: 64, extraData: i64 1)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !631, file: !2, size: 256, align: 64, elements: !644, templateParams: !27, identifier: "b9e2eca6eddc5f857dc267508ff1ab3f")
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !643, file: !2, baseType: !646, size: 192, align: 64, offset: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !33, file: !2, size: 192, align: 64, elements: !647, templateParams: !27, identifier: "7383ecc00c2768a095df3fdbe6379432")
!647 = !{!648, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !646, file: !2, baseType: !649, size: 128, align: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !650, templateParams: !27, identifier: "754135b9d49885d7c71336017ccc8da9")
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !649, file: !2, baseType: !212, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !649, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !646, file: !2, baseType: !36, align: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !646, file: !2, baseType: !458, size: 8, align: 8, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, scope: !631, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !628, file: !2, baseType: !42, align: 8)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Punct", scope: !553, file: !2, baseType: !658, size: 320, align: 64, extraData: i64 2)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !551, file: !2, size: 320, align: 64, elements: !659, templateParams: !27, identifier: "dda9e483f02940f2105ef6b75659ac28")
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !658, file: !2, baseType: !661, size: 96, align: 32, offset: 32)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !13, file: !2, size: 96, align: 32, elements: !662, templateParams: !27, identifier: "afdacb5ea31ae8f3b4fb508dc3afae39")
!662 = !{!663, !665, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !661, file: !2, baseType: !664, size: 32, align: 32)
!664 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "spacing", scope: !661, file: !2, baseType: !107, size: 8, align: 8, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !661, file: !2, baseType: !667, size: 32, align: 32, offset: 32)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !13, file: !2, size: 32, align: 32, elements: !668, templateParams: !27, identifier: "544ee3a81a0f32468e7be217c24a8639")
!668 = !{!669, !686}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !667, file: !2, baseType: !670, size: 32, align: 32)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !17, file: !2, size: 32, align: 32, elements: !671, templateParams: !27, identifier: "6ae001ab426a5c3293067d59fca64131")
!671 = !{!672}
!672 = !DICompositeType(tag: DW_TAG_variant_part, scope: !670, file: !2, size: 32, align: 32, elements: !673, templateParams: !27, identifier: "2ebbcd3f03bc9347e0597cf9010dcbef", discriminator: !685)
!673 = !{!674, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !672, file: !2, baseType: !675, size: 32, align: 32)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !670, file: !2, size: 32, align: 32, elements: !676, templateParams: !27, identifier: "9b0c19bc35b8b2ebfc447e6c338a4514")
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !675, file: !2, baseType: !678, size: 32, align: 32)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !26, file: !2, size: 32, align: 32, elements: !679, templateParams: !27, identifier: "a04b5f8be153d4eb0b678f49121c058")
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !678, file: !2, baseType: !434, size: 32, align: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !672, file: !2, baseType: !682, size: 32, align: 32, extraData: i64 0)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !670, file: !2, size: 32, align: 32, elements: !683, templateParams: !27, identifier: "ee69d5af895e88c067258699cf09bc16")
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !682, file: !2, baseType: !36, align: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !667, file: !2, baseType: !42, align: 8)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Literal", scope: !553, file: !2, baseType: !688, size: 320, align: 64, extraData: i64 3)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !551, file: !2, size: 320, align: 64, elements: !689, templateParams: !27, identifier: "d47feab897d6b1913a6e511589193d0")
!689 = !{!690}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !688, file: !2, baseType: !691, size: 256, align: 64, offset: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !13, file: !2, size: 256, align: 64, elements: !692, templateParams: !27, identifier: "5e4b21d76ce696d191877557f46b58d4")
!692 = !{!693, !714}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !691, file: !2, baseType: !694, size: 256, align: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !17, file: !2, size: 256, align: 64, elements: !695, templateParams: !27, identifier: "5ec5c8aebb58c668a297b9d1f0e239bc")
!695 = !{!696}
!696 = !DICompositeType(tag: DW_TAG_variant_part, scope: !694, file: !2, size: 256, align: 64, elements: !697, templateParams: !27, identifier: "ec0a33737f8ed11d88884e8733602fe2", discriminator: !713)
!697 = !{!698, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !696, file: !2, baseType: !699, size: 256, align: 64, extraData: i64 0)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !694, file: !2, size: 256, align: 64, elements: !700, templateParams: !27, identifier: "abfc6f1d8dbc270e587e7b22abb85176")
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !699, file: !2, baseType: !702, size: 128, align: 32, offset: 32)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !26, file: !2, size: 128, align: 32, elements: !703, templateParams: !27, identifier: "c255eec9bbd0f137ea66a73b65442e34")
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !702, file: !2, baseType: !474, size: 128, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !696, file: !2, baseType: !706, size: 256, align: 64, extraData: i64 1)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !694, file: !2, size: 256, align: 64, elements: !707, templateParams: !27, identifier: "a38f7b61e0e9886bf4a04bc78b38d02d")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !706, file: !2, baseType: !709, size: 192, align: 64, offset: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !33, file: !2, size: 192, align: 64, elements: !710, templateParams: !27, identifier: "8c8a40047f9c93fd15a065a4951a71bf")
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !709, file: !2, baseType: !215, size: 192, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !709, file: !2, baseType: !36, align: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !694, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !691, file: !2, baseType: !42, align: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, scope: !551, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !544, file: !2, baseType: !609, align: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !544, file: !2, baseType: !527, align: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !544, file: !2, baseType: !550, size: 64, align: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !544, file: !2, baseType: !550, size: 64, align: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !365, file: !2, baseType: !42, align: 8)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !362, file: !2, baseType: !724, size: 64, align: 64, offset: 320)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !725, file: !2, size: 64, align: 64, elements: !728, templateParams: !27, identifier: "f04c7d4a85a0e5a7f3a17767044c501b")
!725 = !DINamespace(name: "respan_token_tree", scope: !726)
!726 = !DINamespace(name: "__private", scope: !727)
!727 = !DINamespace(name: "quote", scope: null)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__span", scope: !724, file: !2, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&proc_macro2::Span", baseType: !667, size: 64, align: 64, dwarfAddressSpace: 0)
!731 = !{!732, !733}
!732 = !DITemplateTypeParameter(name: "I", type: !365)
!733 = !DITemplateTypeParameter(name: "F", type: !724)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !359, file: !2, baseType: !735, align: 8)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(proc_macro2::TokenTree) -> proc_macro::TokenTree", baseType: !736, size: 64, align: 64, dwarfAddressSpace: 0)
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !551}
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenTree", scope: !26, file: !2, size: 192, align: 32, elements: !739, templateParams: !27, identifier: "cb88e61886dd8369b24ea6a00f69dbe7")
!739 = !{!740}
!740 = !DICompositeType(tag: DW_TAG_variant_part, scope: !738, file: !2, size: 192, align: 32, elements: !741, templateParams: !27, identifier: "2a062ae2b423979d8d443687a009b11", discriminator: !761)
!741 = !{!742, !746, !750, !757}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Group", scope: !740, file: !2, baseType: !743, size: 192, align: 32, extraData: i64 0)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", scope: !738, file: !2, size: 192, align: 32, elements: !744, templateParams: !27, identifier: "cfb3529b5bf32deeeaf5555fa8a7f262")
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !743, file: !2, baseType: !570, size: 160, align: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Ident", scope: !740, file: !2, baseType: !747, size: 192, align: 32, extraData: i64 1)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ident", scope: !738, file: !2, size: 192, align: 32, elements: !748, templateParams: !27, identifier: "bf3cb19f2fe08c0594ac64914a1309a3")
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !747, file: !2, baseType: !639, size: 96, align: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Punct", scope: !740, file: !2, baseType: !751, size: 192, align: 32, extraData: i64 2)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !738, file: !2, size: 192, align: 32, elements: !752, templateParams: !27, identifier: "c82d06df4ed1afd7845e862022ec2897")
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !751, file: !2, baseType: !754, size: 64, align: 32, offset: 32)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "Punct", scope: !26, file: !2, size: 64, align: 32, elements: !755, templateParams: !27, identifier: "e620d018d6a8a4f3538762a061c12826")
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !754, file: !2, baseType: !454, size: 64, align: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Literal", scope: !740, file: !2, baseType: !758, size: 192, align: 32, extraData: i64 3)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Literal", scope: !738, file: !2, size: 192, align: 32, elements: !759, templateParams: !27, identifier: "9948bffc507c12f61024b278cbc49494")
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !758, file: !2, baseType: !702, size: 128, align: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, scope: !738, file: !2, baseType: !255, size: 32, align: 32, flags: DIFlagArtificial)
!762 = !{!763, !764}
!763 = !DITemplateTypeParameter(name: "I", type: !362)
!764 = !DITemplateTypeParameter(name: "F", type: !735)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro::TokenTree, proc_macro::{impl#19}::from_iter::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>, fn(proc_macro2::TokenTree) -> proc_macro::TokenTree>>>", scope: !766, file: !2, size: 64, align: 64, elements: !771, templateParams: !27, identifier: "4a083218b7198e02e6f42836c17742eb")
!766 = !DINamespace(name: "call", scope: !767)
!767 = !DINamespace(name: "for_each", scope: !768)
!768 = !DINamespace(name: "Iterator", scope: !769)
!769 = !DINamespace(name: "iterator", scope: !770)
!770 = !DINamespace(name: "traits", scope: !356)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !765, file: !2, baseType: !773, size: 64, align: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<proc_macro2::token_stream::IntoIter, quote::__private::respan_token_tree::{closure_env#0}>, fn(proc_macro2::TokenTree) -> proc_macro::TokenTree>>", scope: !774, file: !2, size: 64, align: 64, elements: !776, templateParams: !27, identifier: "f465db8710c2b65c78da4360c5d5d79f")
!774 = !DINamespace(name: "from_iter", scope: !775)
!775 = !DINamespace(name: "{impl#19}", scope: !26)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__builder", scope: !773, file: !2, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut proc_macro::ConcatTreesHelper", baseType: !779, size: 64, align: 64, dwarfAddressSpace: 0)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConcatTreesHelper", scope: !26, file: !2, size: 192, align: 64, elements: !780, templateParams: !27, identifier: "131a4d8cce9a8e1fc639ee1b6e03e3a2")
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "trees", scope: !779, file: !2, baseType: !782, size: 192, align: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>, alloc::alloc::Global>", scope: !219, file: !2, size: 192, align: 64, elements: !783, templateParams: !535, identifier: "da98e4beb3ae33a593f84fec1df5e59f")
!783 = !{!784, !794}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !782, file: !2, baseType: !785, size: 128, align: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>, alloc::alloc::Global>", scope: !223, file: !2, size: 128, align: 64, elements: !786, templateParams: !535, identifier: "9a3d49ccd32d3ad915f6f4dedb23f721")
!786 = !{!787, !792, !793}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !785, file: !2, baseType: !788, size: 64, align: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<proc_macro::bridge::TokenTree<proc_macro::bridge::client::TokenStream, proc_macro::bridge::client::Span, proc_macro::bridge::symbol::Symbol>>", scope: !227, file: !2, size: 64, align: 64, elements: !789, templateParams: !521, identifier: "547f36cf2e6cc03010db850f8a9ff")
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !788, file: !2, baseType: !385, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !788, file: !2, baseType: !524, align: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !785, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !785, file: !2, baseType: !240, align: 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !782, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!795 = !{!796, !797, !798}
!796 = !DILocalVariable(name: "self", arg: 1, scope: !351, file: !352, line: 120, type: !359)
!797 = !DILocalVariable(name: "init", arg: 2, scope: !351, file: !352, line: 120, type: !7)
!798 = !DILocalVariable(name: "g", arg: 3, scope: !351, file: !352, line: 120, type: !765)
!799 = !{!800, !763, !764, !801, !802}
!800 = !DITemplateTypeParameter(name: "B", type: !738)
!801 = !DITemplateTypeParameter(name: "Acc", type: !7)
!802 = !DITemplateTypeParameter(name: "G", type: !765)
!803 = !DILocation(line: 120, column: 21, scope: !351)
!804 = !DILocation(line: 120, column: 27, scope: !351)
!805 = !DILocation(line: 120, column: 38, scope: !351)
!806 = !DILocation(line: 124, column: 9, scope: !351)
!807 = !DILocation(line: 124, column: 24, scope: !351)
!808 = !DILocation(line: 124, column: 30, scope: !351)
!809 = !DILocation(line: 124, column: 49, scope: !351)
!810 = !{i8 0, i8 2}
!811 = !DILocation(line: 125, column: 6, scope: !351)
!812 = !DILocation(line: 120, column: 5, scope: !351)
!813 = distinct !DISubprogram(name: "fold<proc_macro::TokenStream, core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h2ad5d325291826cbE", scope: !353, file: !352, line: 120, type: !814, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, templateParams: !942, retainedNodes: !938)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !816, !7, !907}
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>", scope: !354, file: !2, size: 320, align: 64, elements: !817, templateParams: !904, identifier: "35efd97c2a5b5a44f9bd24f3d2c96cbb")
!817 = !{!818, !900}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !816, file: !2, baseType: !819, size: 320, align: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>", scope: !354, file: !2, size: 320, align: 64, elements: !820, templateParams: !897, identifier: "7f506e4b1178137a4cb5b4fb3c240414")
!820 = !{!821, !893}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !819, file: !2, baseType: !822, size: 320, align: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<proc_macro2::TokenStream>", scope: !823, file: !2, size: 320, align: 64, elements: !825, templateParams: !839, identifier: "9f6de482595665cc4b4e64e186a5eb8e")
!823 = !DINamespace(name: "once", scope: !824)
!824 = !DINamespace(name: "sources", scope: !356)
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !822, file: !2, baseType: !827, size: 320, align: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<proc_macro2::TokenStream>", scope: !403, file: !2, size: 320, align: 64, elements: !828, templateParams: !891, identifier: "a2065a98a17daee359128923cf4dba2d")
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !827, file: !2, baseType: !830, size: 320, align: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "Item<proc_macro2::TokenStream>", scope: !403, file: !2, size: 320, align: 64, elements: !831, templateParams: !891, identifier: "3c9ca911176a505e177da3364288b6b6")
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !830, file: !2, baseType: !833, size: 320, align: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro2::TokenStream>", scope: !403, file: !2, size: 320, align: 64, elements: !834, templateParams: !27, identifier: "257497ffb788062a924f602d2378f02c")
!834 = !{!835}
!835 = !DICompositeType(tag: DW_TAG_variant_part, scope: !833, file: !2, size: 320, align: 64, elements: !836, templateParams: !27, identifier: "a95c79d6fb3d1327357facbb979f4d17", discriminator: !890)
!836 = !{!837, !886}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !835, file: !2, baseType: !838, size: 320, align: 64, extraData: i64 2)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !833, file: !2, size: 320, align: 64, elements: !27, templateParams: !839, identifier: "ef5f47583bfa27bd341aceed9df6bdd7")
!839 = !{!840}
!840 = !DITemplateTypeParameter(name: "T", type: !841)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !13, file: !2, size: 320, align: 64, elements: !842, templateParams: !27, identifier: "d2e2cf5a9f896f5cfbc5f4e63ef8c916")
!842 = !{!843, !885}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !841, file: !2, baseType: !844, size: 320, align: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !17, file: !2, size: 320, align: 64, elements: !845, templateParams: !27, identifier: "a4e81327f6a329c45a7b4ce7073270ce")
!845 = !{!846}
!846 = !DICompositeType(tag: DW_TAG_variant_part, scope: !844, file: !2, size: 320, align: 64, elements: !847, templateParams: !27, identifier: "750c5a7235db7580d8246c0368a7321e", discriminator: !884)
!847 = !{!848, !880}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Compiler", scope: !846, file: !2, baseType: !849, size: 320, align: 64, extraData: i64 0)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "Compiler", scope: !844, file: !2, size: 320, align: 64, elements: !850, templateParams: !27, identifier: "6f79fb94ee420c5283aa0f17dcb71708")
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !849, file: !2, baseType: !852, size: 256, align: 64, offset: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "DeferredTokenStream", scope: !17, file: !2, size: 256, align: 64, elements: !853, templateParams: !27, identifier: "70f7b361663b5df91b79773e1f8d7318")
!853 = !{!854, !858}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !852, file: !2, baseType: !855, size: 32, align: 32, offset: 192)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !26, file: !2, size: 32, align: 32, elements: !856, templateParams: !27, identifier: "92ca8ef9bc6e2b4863b0959f9c97216e")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !2, baseType: !402, size: 32, align: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !852, file: !2, baseType: !859, size: 192, align: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<proc_macro::TokenTree, alloc::alloc::Global>", scope: !219, file: !2, size: 192, align: 64, elements: !860, templateParams: !878, identifier: "ed5b02acffb9845ed47fa393b48409d9")
!860 = !{!861, !879}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !859, file: !2, baseType: !862, size: 128, align: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<proc_macro::TokenTree, alloc::alloc::Global>", scope: !223, file: !2, size: 128, align: 64, elements: !863, templateParams: !878, identifier: "fe56b9cb06e14590a472b403096fc825")
!863 = !{!864, !876, !877}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !862, file: !2, baseType: !865, size: 64, align: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<proc_macro::TokenTree>", scope: !227, file: !2, size: 64, align: 64, elements: !866, templateParams: !872, identifier: "562eabb855510da8e452beec02879d51")
!866 = !{!867, !874}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !865, file: !2, baseType: !868, size: 64, align: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<proc_macro::TokenTree>", scope: !57, file: !2, size: 64, align: 64, elements: !869, templateParams: !872, identifier: "f65c61e9d1dd993edde93f93d799785f")
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !868, file: !2, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const proc_macro::TokenTree", baseType: !738, size: 64, align: 64, dwarfAddressSpace: 0)
!872 = !{!873}
!873 = !DITemplateTypeParameter(name: "T", type: !738)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !865, file: !2, baseType: !875, align: 8)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<proc_macro::TokenTree>", scope: !47, file: !2, align: 8, elements: !27, templateParams: !872, identifier: "636a74d9f1113b7a8fc51fc522dc93c1")
!876 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !862, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !862, file: !2, baseType: !240, align: 8)
!878 = !{!873, !243}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !859, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Fallback", scope: !846, file: !2, baseType: !881, size: 320, align: 64, extraData: i64 1)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fallback", scope: !844, file: !2, size: 320, align: 64, elements: !882, templateParams: !27, identifier: "745bf78bf2e1138fc7b0687dcc76e2cc")
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !881, file: !2, baseType: !581, size: 64, align: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, scope: !844, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !841, file: !2, baseType: !42, align: 8)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !835, file: !2, baseType: !887, size: 320, align: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !833, file: !2, size: 320, align: 64, elements: !888, templateParams: !839, identifier: "be54dcea4992b194ec503209b93f76ac")
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !887, file: !2, baseType: !841, size: 320, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, scope: !833, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!891 = !{!892}
!892 = !DITemplateTypeParameter(name: "A", type: !841)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !819, file: !2, baseType: !894, align: 8)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>", scope: !895, file: !2, align: 8, elements: !27, identifier: "8f48f210d68a8a1793413e046b322fc5")
!895 = !DINamespace(name: "extend", scope: !896)
!896 = !DINamespace(name: "{impl#7}", scope: !13)
!897 = !{!898, !899}
!898 = !DITemplateTypeParameter(name: "I", type: !822)
!899 = !DITemplateTypeParameter(name: "F", type: !894)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !816, file: !2, baseType: !901, align: 8)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream", baseType: !902, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{!855, !844}
!904 = !{!905, !906}
!905 = !DITemplateTypeParameter(name: "I", type: !819)
!906 = !DITemplateTypeParameter(name: "F", type: !901)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<proc_macro::TokenStream, proc_macro::{impl#22}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>>", scope: !766, file: !2, size: 64, align: 64, elements: !908, templateParams: !27, identifier: "b3c6f80439a384ad725c9307fa1544b")
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !907, file: !2, baseType: !910, size: 64, align: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::iter::adapters::map::Map<core::iter::sources::once::Once<proc_macro2::TokenStream>, proc_macro2::{impl#7}::extend::{closure_env#0}<core::iter::sources::once::Once<proc_macro2::TokenStream>>>, fn(proc_macro2::imp::TokenStream) -> proc_macro::TokenStream>>", scope: !911, file: !2, size: 64, align: 64, elements: !913, templateParams: !27, identifier: "3796ef10679057c4dfc9e6235ea5e045")
!911 = !DINamespace(name: "extend", scope: !912)
!912 = !DINamespace(name: "{impl#22}", scope: !26)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__builder", scope: !910, file: !2, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut proc_macro::ConcatStreamsHelper", baseType: !916, size: 64, align: 64, dwarfAddressSpace: 0)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConcatStreamsHelper", scope: !26, file: !2, size: 192, align: 64, elements: !917, templateParams: !27, identifier: "d809a02351041adab7116ca0f48eb23")
!917 = !{!918}
