; ModuleID = 'libc.e4ee2756-cgu.0'
source_filename = "libc.e4ee2756-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"unix::linux_like::linux::gnu::siginfo_f" = type { [3 x i32], [1 x i32], %"unix::linux_like::linux::gnu::sifields" }
%"unix::linux_like::linux::gnu::sifields" = type { [4 x i64] }
%"unix::linux_like::linux::gnu::b64::x86_64::siginfo_t" = type { i32, i32, i32, [29 x i32], [0 x i64] }
%"unix::linux_like::linux::gnu::<impl unix::linux_like::linux::gnu::b64::x86_64::siginfo_t>::si_addr::siginfo_sigfault" = type { i32, i32, i32, [1 x i32], i8* }
%"unix::linux_like::linux::gnu::<impl unix::linux_like::linux::gnu::b64::x86_64::siginfo_t>::si_value::siginfo_timer" = type { i32, i32, i32, i32, i32, [1 x i32], %"unix::sigval" }
%"unix::sigval" = type { i8* }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"unix::linux_like::linux::gnu::sifields_sigchld" = type { i32, i32, i32, [1 x i32], i64, i64 }

@alloc6439 = private unnamed_addr constant <{ [106 x i8] }> <{ [106 x i8] c"/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.175/src/unix/linux_like/linux/mod.rs" }>, align 1
@alloc6440 = private unnamed_addr constant <{ i8*, [16 x i8] }> <{ i8* getelementptr inbounds (<{ [106 x i8] }>, <{ [106 x i8] }>* @alloc6439, i32 0, i32 0, i32 0), [16 x i8] c"j\00\00\00\00\00\00\00\C9\12\00\00\05\00\00\00" }>, align 8

!0 = !{i32 7, !"PIC Level", i32 2}
!1 = !{i32 2, !"RtLibUseGOT", i32 1}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !5, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !6)
!5 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.175/src/lib.rs/@/libc.e4ee2756-cgu.0", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.175")
!6 = !{!7}
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !9, file: !8, baseType: !11, size: 8, align: 8, flags: DIFlagEnumClass, elements: !12)
!8 = !DIFile(filename: "<unknown>", directory: "")
!9 = !DINamespace(name: "ffi", scope: !10)
!10 = !DINamespace(name: "core", scope: null)
!11 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!15 = distinct !DISubprogram(name: "cast<libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t, libc::unix::linux_like::linux::gnu::siginfo_f>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h54670a9d4881b863E", scope: !17, file: !16, line: 46, type: !20, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !70, retainedNodes: !68)
!16 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!17 = !DINamespace(name: "{impl#0}", scope: !18)
!18 = !DINamespace(name: "const_ptr", scope: !19)
!19 = !DINamespace(name: "ptr", scope: !10)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !51}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const libc::unix::linux_like::linux::gnu::siginfo_f", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo_f", scope: !24, file: !8, size: 384, align: 64, elements: !29, templateParams: !50, identifier: "123b0b3904a0dd03fcad005cc4c01c5a")
!24 = !DINamespace(name: "gnu", scope: !25)
!25 = !DINamespace(name: "linux", scope: !26)
!26 = !DINamespace(name: "linux_like", scope: !27)
!27 = !DINamespace(name: "unix", scope: !28)
!28 = !DINamespace(name: "libc", scope: null)
!29 = !{!30, !35}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_siginfo_base", scope: !23, file: !8, baseType: !31, size: 96, align: 32)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, align: 32, elements: !33)
!32 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!33 = !{!34}
!34 = !DISubrange(count: 3, lowerBound: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sifields", scope: !23, file: !8, baseType: !36, size: 256, align: 64, offset: 128)
!36 = !DICompositeType(tag: DW_TAG_union_type, name: "sifields", scope: !24, file: !8, size: 256, align: 64, elements: !37, templateParams: !50, identifier: "d6810f40299c205b7e6e2b9e8c559653")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_align_pointer", scope: !36, file: !8, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sigchld", scope: !36, file: !8, baseType: !41, size: 256, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "sifields_sigchld", scope: !24, file: !8, size: 256, align: 64, elements: !42, templateParams: !50, identifier: "3f6b675babf8425677448fdd24f9000b")
!42 = !{!43, !44, !46, !47, !49}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !41, file: !8, baseType: !32, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !41, file: !8, baseType: !45, size: 32, align: 32, offset: 32)
!45 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !41, file: !8, baseType: !32, size: 32, align: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !41, file: !8, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !41, file: !8, baseType: !48, size: 64, align: 64, offset: 192)
!50 = !{}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo_t", scope: !53, file: !8, size: 1024, align: 64, elements: !55, templateParams: !50, identifier: "e79f5bee479516c66a3525aa2bde663")
!53 = !DINamespace(name: "x86_64", scope: !54)
!54 = !DINamespace(name: "b64", scope: !24)
!55 = !{!56, !57, !58, !59, !63}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !52, file: !8, baseType: !32, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !52, file: !8, baseType: !32, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !52, file: !8, baseType: !32, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !52, file: !8, baseType: !60, size: 928, align: 32, offset: 96)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 928, align: 32, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 29, lowerBound: 0)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_align", scope: !52, file: !8, baseType: !64, align: 64, offset: 1024)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, align: 64, elements: !66)
!65 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!66 = !{!67}
!67 = !DISubrange(count: 0, lowerBound: 0)
!68 = !{!69}
!69 = !DILocalVariable(name: "self", arg: 1, scope: !15, file: !16, line: 46, type: !51)
!70 = !{!71, !72}
!71 = !DITemplateTypeParameter(name: "T", type: !52)
!72 = !DITemplateTypeParameter(name: "U", type: !23)
!73 = !DILocation(line: 46, column: 26, scope: !15)
!74 = !DILocation(line: 47, column: 9, scope: !15)
!75 = !DILocation(line: 48, column: 6, scope: !15)
!76 = distinct !DISubprogram(name: "cast<libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t, libc::unix::linux_like::linux::gnu::{impl#0}::si_addr::siginfo_sigfault>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h7c14ea4c81a8329bE", scope: !17, file: !16, line: 46, type: !77, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !90, retainedNodes: !88)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !51}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const libc::unix::linux_like::linux::gnu::{impl#0}::si_addr::siginfo_sigfault", baseType: !80, size: 64, align: 64, dwarfAddressSpace: 0)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo_sigfault", scope: !81, file: !8, size: 192, align: 64, elements: !83, templateParams: !50, identifier: "4ccb555d434bf0473132dd8ad1917517")
!81 = !DINamespace(name: "si_addr", scope: !82)
!82 = !DINamespace(name: "{impl#0}", scope: !24)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_si_signo", scope: !80, file: !8, baseType: !32, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_si_errno", scope: !80, file: !8, baseType: !32, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_si_code", scope: !80, file: !8, baseType: !32, size: 32, align: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !80, file: !8, baseType: !39, size: 64, align: 64, offset: 128)
!88 = !{!89}
!89 = !DILocalVariable(name: "self", arg: 1, scope: !76, file: !16, line: 46, type: !51)
!90 = !{!71, !91}
!91 = !DITemplateTypeParameter(name: "U", type: !80)
!92 = !DILocation(line: 46, column: 26, scope: !76)
!93 = !DILocation(line: 47, column: 9, scope: !76)
!94 = !DILocation(line: 48, column: 6, scope: !76)
!95 = distinct !DISubprogram(name: "cast<libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t, libc::unix::linux_like::linux::gnu::{impl#0}::si_value::siginfo_timer>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h9e7d87b4750b964fE", scope: !17, file: !16, line: 46, type: !96, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !4, templateParams: !113, retainedNodes: !111)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !51}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const libc::unix::linux_like::linux::gnu::{impl#0}::si_value::siginfo_timer", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "siginfo_timer", scope: !100, file: !8, size: 256, align: 64, elements: !101, templateParams: !50, identifier: "f4f710caac968885709b16e90b8a9ef")
!100 = !DINamespace(name: "si_value", scope: !82)
!101 = !{!102, !103, !104, !105, !106, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_si_signo", scope: !99, file: !8, baseType: !32, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_si_errno", scope: !99, file: !8, baseType: !32, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_si_code", scope: !99, file: !8, baseType: !32, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_si_tid", scope: !99, file: !8, baseType: !32, size: 32, align: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_si_overrun", scope: !99, file: !8, baseType: !32, size: 32, align: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !99, file: !8, baseType: !108, size: 64, align: 64, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigval", scope: !27, file: !8, size: 64, align: 64, elements: !109, templateParams: !50, identifier: "d452e92c30f7ab5aea54f81d9ac0f0aa")
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !108, file: !8, baseType: !39, size: 64, align: 64)
!111 = !{!112}
!112 = !DILocalVariable(name: "self", arg: 1, scope: !95, file: !16, line: 46, type: !51)
!113 = !{!71, !114}
!114 = !DITemplateTypeParameter(name: "U", type: !99)
!115 = !DILocation(line: 46, column: 26, scope: !95)
!116 = !DILocation(line: 47, column: 9, scope: !95)
!117 = !DILocation(line: 48, column: 6, scope: !95)
!118 = distinct !DISubprogram(name: "_IOC", linkageName: "_ZN4libc4unix10linux_like4_IOC17h94b2de63b8e1bee4E", scope: !26, file: !119, line: 1754, type: !120, scopeLine: 1754, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !50, retainedNodes: !123)
!119 = !DIFile(filename: "src/unix/linux_like/mod.rs", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.175", checksumkind: CSK_MD5, checksum: "1b5c7c96e0bc58d19d2997d477365f04")
!120 = !DISubroutineType(types: !121)
!121 = !{!65, !45, !45, !45, !122}
!122 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!123 = !{!124, !125, !126, !127}
!124 = !DILocalVariable(name: "dir", arg: 1, scope: !118, file: !119, line: 1754, type: !45)
!125 = !DILocalVariable(name: "ty", arg: 2, scope: !118, file: !119, line: 1754, type: !45)
!126 = !DILocalVariable(name: "nr", arg: 3, scope: !118, file: !119, line: 1754, type: !45)
!127 = !DILocalVariable(name: "size", arg: 4, scope: !118, file: !119, line: 1754, type: !122)
!128 = !DILocation(line: 1754, column: 23, scope: !118)
!129 = !DILocation(line: 1754, column: 33, scope: !118)
!130 = !DILocation(line: 1754, column: 42, scope: !118)
!131 = !DILocation(line: 1754, column: 51, scope: !118)
!132 = !DILocation(line: 1763, column: 14, scope: !118)
!133 = !DILocation(line: 1764, column: 19, scope: !118)
!134 = !DILocation(line: 1765, column: 19, scope: !118)
!135 = !DILocation(line: 1766, column: 20, scope: !118)
!136 = !DILocation(line: 1766, column: 19, scope: !118)
!137 = !DILocation(line: 1763, column: 13, scope: !118)
!138 = !DILocation(line: 1767, column: 10, scope: !118)
!139 = distinct !DISubprogram(name: "_IO", linkageName: "_ZN4libc4unix10linux_like3_IO17he29b89bcb67a49cfE", scope: !26, file: !119, line: 1770, type: !140, scopeLine: 1770, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !50, retainedNodes: !142)
!140 = !DISubroutineType(types: !141)
!141 = !{!65, !45, !45}
!142 = !{!143, !144}
!143 = !DILocalVariable(name: "ty", arg: 1, scope: !139, file: !119, line: 1770, type: !45)
!144 = !DILocalVariable(name: "nr", arg: 2, scope: !139, file: !119, line: 1770, type: !45)
!145 = !DILocation(line: 1770, column: 26, scope: !139)
!146 = !DILocation(line: 1770, column: 35, scope: !139)
!147 = !DILocation(line: 1771, column: 13, scope: !139)
!148 = !DILocation(line: 1772, column: 10, scope: !139)
!149 = distinct !DISubprogram(name: "issecure_mask", linkageName: "_ZN4libc4unix10linux_like5linux13issecure_mask17hb0e0ece606e02931E", scope: !25, file: !150, line: 4808, type: !151, scopeLine: 4808, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, templateParams: !50, retainedNodes: !153)
!150 = !DIFile(filename: "src/unix/linux_like/linux/mod.rs", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/libc-0.2.175", checksumkind: CSK_MD5, checksum: "66fb097e92fde54a79caf041d4d53a4a")
!151 = !DISubroutineType(types: !152)
!152 = !{!32, !32}
!153 = !{!154}
!154 = !DILocalVariable(name: "x", arg: 1, scope: !149, file: !150, line: 4808, type: !32)
!155 = !DILocation(line: 4808, column: 24, scope: !149)
