; ModuleID = '378r416i0mi3tton'
source_filename = "378r416i0mi3tton"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_conditionals.rs:62:1: 74:2]" = type {}
%"[closure@src/test_conditionals.rs:86:1: 93:2]" = type {}
%"[closure@src/test_conditionals.rs:45:1: 59:2]" = type {}
%"[closure@src/test_conditionals.rs:30:1: 42:2]" = type {}
%"[closure@src/test_conditionals.rs:77:1: 83:2]" = type {}
%"conditionals::py_flag" = type { i32 }
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"core::ops::range::RangeFull" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&[i32; 6] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 6] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "358d88facf61ead4530386abd50fe857")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 6]", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 192, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 6, lowerBound: 0)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "<&[i32; 30] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 30] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !49, vtableHolder: !54, templateParams: !23, identifier: "bfb680c150120cb635d7e9d5d971ae55")
!49 = !{!50, !51, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !48, file: !2, baseType: !6, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !48, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !48, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 30]", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 960, align: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 30, lowerBound: 0)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "<&[i32; 4] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 4] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !61, vtableHolder: !66, templateParams: !23, identifier: "a95e8e1432549f1820c20f0bc70265a8")
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !60, file: !2, baseType: !6, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !60, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !60, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 4]", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, align: 32, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 4, lowerBound: 0)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "rust_abc", scope: !72, file: !74, line: 109, type: !33, isLocal: false, isDefinition: true, align: 32)
!72 = !DINamespace(name: "conditionals", scope: !73)
!73 = !DINamespace(name: "conditional_tests", scope: null)
!74 = !DIFile(filename: "src/conditionals.rs", directory: "/home/calvin/git/c2rust/tests/conditionals", checksumkind: CSK_MD5, checksum: "19876c0c066aca03ec13a3c147644fae")
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "rust_def", scope: !72, file: !74, line: 111, type: !33, isLocal: false, isDefinition: true, align: 32)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "rust_hij", scope: !72, file: !74, line: 113, type: !33, isLocal: false, isDefinition: true, align: 32)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "INIT_ARRAY", linkageName: "_ZN17conditional_tests12conditionals10INIT_ARRAY17h1f442a4add430111E", scope: !72, file: !74, line: 190, type: !81, isLocal: true, isDefinition: true, align: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, align: 64, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !{!84}
!84 = !DISubrange(count: 1, lowerBound: 0)
!85 = !{i32 7, !"PIC Level", i32 2}
!86 = !{i32 7, !"PIE Level", i32 2}
!87 = !{i32 2, !"RtLibUseGOT", i32 1}
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !91, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !92, globals: !115)
!91 = !DIFile(filename: "src/lib.rs/@/378r416i0mi3tton", directory: "/home/calvin/git/c2rust/tests/conditionals")
!92 = !{!93, !104, !109}
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !94, file: !2, baseType: !98, size: 8, align: 8, flags: DIFlagEnumClass, elements: !99)
!94 = !DINamespace(name: "v1", scope: !95)
!95 = !DINamespace(name: "rt", scope: !96)
!96 = !DINamespace(name: "fmt", scope: !97)
!97 = !DINamespace(name: "core", scope: null)
!98 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !105, file: !2, baseType: !98, size: 8, align: 8, flags: DIFlagEnumClass, elements: !106)
!105 = !DINamespace(name: "ffi", scope: !97)
!106 = !{!107, !108}
!107 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!108 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !110, file: !2, baseType: !98, size: 8, align: 8, flags: DIFlagEnumClass, elements: !111)
!110 = !DINamespace(name: "panicking", scope: !97)
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!115 = !{!0, !24, !34, !46, !58, !70, !75, !77, !79}
!116 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hc7d132a04ccb93d4E", scope: !118, file: !117, line: 118, type: !120, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !126, retainedNodes: !122)
!117 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!118 = !DINamespace(name: "backtrace", scope: !119)
!119 = !DINamespace(name: "sys_common", scope: !17)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !20}
!122 = !{!123, !124}
!123 = !DILocalVariable(name: "f", arg: 1, scope: !116, file: !117, line: 118, type: !20)
!124 = !DILocalVariable(name: "result", scope: !125, file: !117, line: 122, type: !7, align: 1)
!125 = distinct !DILexicalBlock(scope: !116, file: !117, line: 122, column: 5)
!126 = !{!127, !128}
!127 = !DITemplateTypeParameter(name: "F", type: !20)
!128 = !DITemplateTypeParameter(name: "T", type: !7)
!129 = !DILocation(line: 122, column: 9, scope: !125)
!130 = !DILocation(line: 118, column: 43, scope: !116)
!131 = !DILocalVariable(name: "dummy", scope: !132, file: !117, line: 125, type: !7, align: 1)
!132 = !DILexicalBlockFile(scope: !133, file: !117, discriminator: 0)
!133 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hb71d2172093e25deE", scope: !135, file: !134, line: 225, type: !136, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !139, retainedNodes: !138)
!134 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!135 = !DINamespace(name: "hint", scope: !97)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !7}
!138 = !{!131}
!139 = !{!128}
!140 = !DILocation(line: 125, column: 5, scope: !132, inlinedAt: !141)
!141 = !DILocation(line: 125, column: 5, scope: !125)
!142 = !DILocation(line: 122, column: 18, scope: !116)
!143 = !{i32 3353484}
!144 = !DILocation(line: 128, column: 2, scope: !116)
!145 = !DILocation(line: 128, column: 1, scope: !116)
!146 = !DILocation(line: 118, column: 1, scope: !116)
!147 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17he9fb75c4246b1653E", scope: !16, file: !148, line: 139, type: !149, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !139, retainedNodes: !154)
!148 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !20, !151, !152}
!151 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !{!155, !156, !157, !158}
!155 = !DILocalVariable(name: "main", arg: 1, scope: !147, file: !148, line: 140, type: !20)
!156 = !DILocalVariable(name: "argc", arg: 2, scope: !147, file: !148, line: 141, type: !151)
!157 = !DILocalVariable(name: "argv", arg: 3, scope: !147, file: !148, line: 142, type: !152)
!158 = !DILocalVariable(name: "v", scope: !159, file: !148, line: 144, type: !151, align: 8)
!159 = distinct !DILexicalBlock(scope: !147, file: !148, line: 144, column: 5)
!160 = !DILocation(line: 140, column: 5, scope: !147)
!161 = !DILocation(line: 141, column: 5, scope: !147)
!162 = !DILocation(line: 142, column: 5, scope: !147)
!163 = !DILocation(line: 145, column: 10, scope: !147)
!164 = !DILocation(line: 145, column: 9, scope: !147)
!165 = !DILocation(line: 144, column: 17, scope: !147)
!166 = !DILocation(line: 144, column: 12, scope: !147)
!167 = !DILocation(line: 144, column: 12, scope: !159)
!168 = !DILocation(line: 150, column: 2, scope: !147)
!169 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h56248eaae24c6fabE", scope: !15, file: !148, line: 145, type: !170, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !139, retainedNodes: !173)
!170 = !DISubroutineType(types: !171)
!171 = !{!33, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !{!174}
!174 = !DILocalVariable(name: "main", scope: !169, file: !148, line: 140, type: !20, align: 8)
!175 = !{i64 8}
!176 = !DILocation(line: 140, column: 5, scope: !169)
!177 = !DILocalVariable(name: "self", scope: !178, file: !148, line: 145, type: !181, align: 1)
!178 = !DILexicalBlockFile(scope: !179, file: !148, discriminator: 0)
!179 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h69f316579e07a24eE", scope: !181, file: !180, line: 1808, type: !192, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !23, retainedNodes: !194)
!180 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !182, file: !2, size: 8, align: 8, elements: !183, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!182 = !DINamespace(name: "process", scope: !17)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !181, file: !2, baseType: !185, size: 8, align: 8)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !186, file: !2, size: 8, align: 8, elements: !190, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!186 = !DINamespace(name: "process_common", scope: !187)
!187 = !DINamespace(name: "process", scope: !188)
!188 = !DINamespace(name: "unix", scope: !189)
!189 = !DINamespace(name: "sys", scope: !17)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !185, file: !2, baseType: !98, size: 8, align: 8)
!192 = !DISubroutineType(types: !193)
!193 = !{!33, !181}
!194 = !{!177}
!195 = !DILocation(line: 145, column: 18, scope: !178, inlinedAt: !196)
!196 = !DILocation(line: 145, column: 18, scope: !169)
!197 = !DILocation(line: 145, column: 77, scope: !169)
!198 = !DILocalVariable(name: "self", scope: !199, file: !148, line: 145, type: !204, align: 8)
!199 = !DILexicalBlockFile(scope: !200, file: !148, discriminator: 0)
!200 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h93563fbd12cfff8aE", scope: !185, file: !201, line: 485, type: !202, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !23, retainedNodes: !205)
!201 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!202 = !DISubroutineType(types: !203)
!203 = !{!33, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !{!198}
!206 = !DILocation(line: 145, column: 18, scope: !199, inlinedAt: !207)
!207 = !DILocation(line: 1809, column: 9, scope: !179, inlinedAt: !196)
!208 = !DILocation(line: 145, column: 17, scope: !169)
!209 = distinct !DISubprogram(name: "fmt<[i32; 6]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h4ba92788ccbc07aaE", scope: !211, file: !210, line: 2361, type: !212, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !271, retainedNodes: !268)
!210 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!211 = !DINamespace(name: "{impl#59}", scope: !96)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !231, !232}
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !215, file: !2, size: 8, align: 8, elements: !216, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!215 = !DINamespace(name: "result", scope: !97)
!216 = !{!217}
!217 = !DICompositeType(tag: DW_TAG_variant_part, scope: !214, file: !2, size: 8, align: 8, elements: !218, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !230)
!218 = !{!219, !226}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !217, file: !2, baseType: !220, size: 8, align: 8, extraData: i64 0)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !214, file: !2, size: 8, align: 8, elements: !221, templateParams: !223, identifier: "cea751326735c343faf647063a65ad14")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !220, file: !2, baseType: !7, align: 8, offset: 8)
!223 = !{!128, !224}
!224 = !DITemplateTypeParameter(name: "E", type: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !96, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !217, file: !2, baseType: !227, size: 8, align: 8, extraData: i64 1)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !214, file: !2, size: 8, align: 8, elements: !228, templateParams: !223, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !227, file: !2, baseType: !225, align: 8, offset: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !2, baseType: !98, size: 8, align: 8, flags: DIFlagArtificial)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 6]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !233, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !96, file: !2, size: 512, align: 64, elements: !234, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!234 = !{!235, !237, !239, !240, !256, !257}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !233, file: !2, baseType: !236, size: 32, align: 32, offset: 384)
!236 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !233, file: !2, baseType: !238, size: 32, align: 32, offset: 416)
!238 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !233, file: !2, baseType: !93, size: 8, align: 8, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !233, file: !2, baseType: !241, size: 128, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !242, file: !2, size: 128, align: 64, elements: !243, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!242 = !DINamespace(name: "option", scope: !97)
!243 = !{!244}
!244 = !DICompositeType(tag: DW_TAG_variant_part, scope: !241, file: !2, size: 128, align: 64, elements: !245, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !254)
!245 = !{!246, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !244, file: !2, baseType: !247, size: 128, align: 64, extraData: i64 0)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !241, file: !2, size: 128, align: 64, elements: !23, templateParams: !248, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "T", type: !9)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !244, file: !2, baseType: !251, size: 128, align: 64, extraData: i64 1)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !241, file: !2, size: 128, align: 64, elements: !252, templateParams: !248, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !251, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !2, baseType: !255, size: 64, align: 64, flags: DIFlagArtificial)
!255 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !233, file: !2, baseType: !241, size: 128, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !233, file: !2, baseType: !258, size: 128, align: 64, offset: 256)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !259, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !258, file: !2, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !258, file: !2, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !265, size: 64, align: 64, dwarfAddressSpace: 0)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 3, lowerBound: 0)
!268 = !{!269, !270}
!269 = !DILocalVariable(name: "self", arg: 1, scope: !209, file: !210, line: 2361, type: !231)
!270 = !DILocalVariable(name: "f", arg: 2, scope: !209, file: !210, line: 2361, type: !232)
!271 = !{!272}
!272 = !DITemplateTypeParameter(name: "T", type: !43)
!273 = !DILocation(line: 2361, column: 20, scope: !209)
!274 = !DILocation(line: 2361, column: 27, scope: !209)
!275 = !DILocation(line: 2361, column: 71, scope: !209)
!276 = !{i64 4}
!277 = !DILocation(line: 2361, column: 62, scope: !209)
!278 = !DILocation(line: 2361, column: 84, scope: !209)
!279 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hab96ff80dd06d362E", scope: !211, file: !210, line: 2361, type: !280, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !283)
!280 = !DISubroutineType(types: !281)
!281 = !{!214, !282, !232}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !{!284, !285}
!284 = !DILocalVariable(name: "self", arg: 1, scope: !279, file: !210, line: 2361, type: !282)
!285 = !DILocalVariable(name: "f", arg: 2, scope: !279, file: !210, line: 2361, type: !232)
!286 = !{!287}
!287 = !DITemplateTypeParameter(name: "T", type: !33)
!288 = !DILocation(line: 2361, column: 20, scope: !279)
!289 = !DILocation(line: 2361, column: 27, scope: !279)
!290 = !DILocation(line: 2361, column: 71, scope: !279)
!291 = !DILocation(line: 2361, column: 62, scope: !279)
!292 = !DILocation(line: 2361, column: 84, scope: !279)
!293 = distinct !DISubprogram(name: "fmt<[i32; 4]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hb6aeae75fec05ac2E", scope: !211, file: !210, line: 2361, type: !294, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !300, retainedNodes: !297)
!294 = !DISubroutineType(types: !295)
!295 = !{!214, !296, !232}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 4]", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !{!298, !299}
!298 = !DILocalVariable(name: "self", arg: 1, scope: !293, file: !210, line: 2361, type: !296)
!299 = !DILocalVariable(name: "f", arg: 2, scope: !293, file: !210, line: 2361, type: !232)
!300 = !{!301}
!301 = !DITemplateTypeParameter(name: "T", type: !67)
!302 = !DILocation(line: 2361, column: 20, scope: !293)
!303 = !DILocation(line: 2361, column: 27, scope: !293)
!304 = !DILocation(line: 2361, column: 71, scope: !293)
!305 = !DILocation(line: 2361, column: 62, scope: !293)
!306 = !DILocation(line: 2361, column: 84, scope: !293)
!307 = distinct !DISubprogram(name: "fmt<[i32; 30]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hd9469653db74ea63E", scope: !211, file: !210, line: 2361, type: !308, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !314, retainedNodes: !311)
!308 = !DISubroutineType(types: !309)
!309 = !{!214, !310, !232}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 30]", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !{!312, !313}
!312 = !DILocalVariable(name: "self", arg: 1, scope: !307, file: !210, line: 2361, type: !310)
!313 = !DILocalVariable(name: "f", arg: 2, scope: !307, file: !210, line: 2361, type: !232)
!314 = !{!315}
!315 = !DITemplateTypeParameter(name: "T", type: !55)
!316 = !DILocation(line: 2361, column: 20, scope: !307)
!317 = !DILocation(line: 2361, column: 27, scope: !307)
!318 = !DILocation(line: 2361, column: 71, scope: !307)
!319 = !DILocation(line: 2361, column: 62, scope: !307)
!320 = !DILocation(line: 2361, column: 84, scope: !307)
!321 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hfd00249108282cbfE", scope: !211, file: !210, line: 2361, type: !322, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !330)
!322 = !DISubroutineType(types: !323)
!323 = !{!214, !324, !232}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !326, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !325, file: !2, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !325, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!330 = !{!331, !332}
!331 = !DILocalVariable(name: "self", arg: 1, scope: !321, file: !210, line: 2361, type: !324)
!332 = !DILocalVariable(name: "f", arg: 2, scope: !321, file: !210, line: 2361, type: !232)
!333 = !DILocation(line: 2361, column: 20, scope: !321)
!334 = !DILocation(line: 2361, column: 27, scope: !321)
!335 = !DILocation(line: 2361, column: 71, scope: !321)
!336 = !DILocation(line: 2361, column: 62, scope: !321)
!337 = !DILocation(line: 2361, column: 84, scope: !321)
!338 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17h4f5434fa8f5d8479E", scope: !339, file: !210, line: 2586, type: !340, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !342)
!339 = !DINamespace(name: "{impl#26}", scope: !96)
!340 = !DISubroutineType(types: !341)
!341 = !{!214, !325, !232}
!342 = !{!343, !344}
!343 = !DILocalVariable(name: "self", arg: 1, scope: !338, file: !210, line: 2586, type: !325)
!344 = !DILocalVariable(name: "f", arg: 2, scope: !338, file: !210, line: 2586, type: !232)
!345 = !DILocation(line: 2586, column: 12, scope: !338)
!346 = !DILocation(line: 2586, column: 19, scope: !338)
!347 = !DILocation(line: 2587, column: 9, scope: !338)
!348 = !DILocation(line: 2587, column: 32, scope: !338)
!349 = !DILocalVariable(name: "self", scope: !350, file: !210, line: 2587, type: !325, align: 8)
!350 = !DILexicalBlockFile(scope: !351, file: !210, discriminator: 0)
!351 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17h542516e2e36466a2E", scope: !353, file: !352, line: 734, type: !355, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !373)
!352 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!353 = !DINamespace(name: "{impl#0}", scope: !354)
!354 = !DINamespace(name: "slice", scope: !97)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !325}
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !358, file: !2, size: 128, align: 64, elements: !359, templateParams: !286, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!358 = !DINamespace(name: "iter", scope: !354)
!359 = !{!360, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !357, file: !2, baseType: !361, size: 64, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !362, file: !2, size: 64, align: 64, elements: !364, templateParams: !286, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!362 = !DINamespace(name: "non_null", scope: !363)
!363 = !DINamespace(name: "ptr", scope: !97)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !361, file: !2, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !357, file: !2, baseType: !366, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !357, file: !2, baseType: !369, align: 8)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !370, file: !2, align: 8, elements: !23, templateParams: !371, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!370 = !DINamespace(name: "marker", scope: !97)
!371 = !{!372}
!372 = !DITemplateTypeParameter(name: "T", type: !32)
!373 = !{!349}
!374 = !DILocation(line: 2587, column: 32, scope: !350, inlinedAt: !348)
!375 = !DILocation(line: 2588, column: 6, scope: !338)
!376 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h84cb2e731adaa5ecE", scope: !378, file: !377, line: 185, type: !380, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !23, retainedNodes: !382)
!377 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!378 = !DINamespace(name: "{impl#80}", scope: !379)
!379 = !DINamespace(name: "num", scope: !96)
!380 = !DISubroutineType(types: !381)
!381 = !{!214, !32, !232}
!382 = !{!383, !384}
!383 = !DILocalVariable(name: "self", arg: 1, scope: !376, file: !377, line: 185, type: !32)
!384 = !DILocalVariable(name: "f", arg: 2, scope: !376, file: !377, line: 185, type: !232)
!385 = !DILocation(line: 185, column: 20, scope: !376)
!386 = !DILocation(line: 185, column: 27, scope: !376)
!387 = !DILocation(line: 186, column: 20, scope: !376)
!388 = !DILocation(line: 188, column: 27, scope: !376)
!389 = !DILocation(line: 187, column: 21, scope: !376)
!390 = !DILocation(line: 186, column: 17, scope: !376)
!391 = !DILocation(line: 193, column: 14, scope: !376)
!392 = !{i8 0, i8 2}
!393 = !DILocation(line: 191, column: 21, scope: !376)
!394 = !DILocation(line: 189, column: 21, scope: !376)
!395 = !DILocation(line: 188, column: 24, scope: !376)
!396 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hab11437addffd9bdE", scope: !398, file: !397, line: 637, type: !408, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !418, retainedNodes: !411)
!397 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !399, file: !2, size: 128, align: 64, elements: !400, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!399 = !DINamespace(name: "builders", scope: !96)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !398, file: !2, baseType: !402, size: 128, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !399, file: !2, size: 128, align: 64, elements: !403, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !402, file: !2, baseType: !232, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !402, file: !2, baseType: !214, size: 8, align: 8, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !402, file: !2, baseType: !407, size: 8, align: 8, offset: 72)
!407 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!408 = !DISubroutineType(types: !409)
!409 = !{!410, !410, !357}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !398, size: 64, align: 64, dwarfAddressSpace: 0)
!411 = !{!412, !413, !414, !416}
!412 = !DILocalVariable(name: "self", arg: 1, scope: !396, file: !397, line: 637, type: !410)
!413 = !DILocalVariable(name: "entries", arg: 2, scope: !396, file: !397, line: 637, type: !357)
!414 = !DILocalVariable(name: "iter", scope: !415, file: !397, line: 642, type: !357, align: 8)
!415 = distinct !DILexicalBlock(scope: !396, file: !397, line: 642, column: 9)
!416 = !DILocalVariable(name: "entry", scope: !417, file: !397, line: 642, type: !32, align: 8)
!417 = distinct !DILexicalBlock(scope: !415, file: !397, line: 642, column: 30)
!418 = !{!419, !420}
!419 = !DITemplateTypeParameter(name: "D", type: !32)
!420 = !DITemplateTypeParameter(name: "I", type: !357)
!421 = !DILocation(line: 637, column: 26, scope: !396)
!422 = !DILocation(line: 637, column: 37, scope: !396)
!423 = !DILocation(line: 642, column: 22, scope: !415)
!424 = !DILocation(line: 642, column: 13, scope: !417)
!425 = !DILocation(line: 642, column: 22, scope: !396)
!426 = !DILocation(line: 642, column: 9, scope: !415)
!427 = !DILocation(line: 642, column: 9, scope: !396)
!428 = !DILocation(line: 642, column: 13, scope: !415)
!429 = !DILocation(line: 643, column: 24, scope: !417)
!430 = !DILocation(line: 643, column: 13, scope: !417)
!431 = !DILocation(line: 644, column: 9, scope: !415)
!432 = !DILocation(line: 637, column: 5, scope: !396)
!433 = !DILocation(line: 646, column: 6, scope: !396)
!434 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h0741548b0913f5a4E", scope: !435, file: !210, line: 390, type: !509, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !23, retainedNodes: !511)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !96, file: !2, size: 384, align: 64, elements: !436, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!436 = !{!437, !448, !493}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !435, file: !2, baseType: !438, size: 128, align: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !439, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!439 = !{!440, !447}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !438, file: !2, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64, dwarfAddressSpace: 0)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !443, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!443 = !{!444, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !442, file: !2, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !442, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !438, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !435, file: !2, baseType: !449, size: 128, align: 64, offset: 128)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !242, file: !2, size: 128, align: 64, elements: !450, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!450 = !{!451}
!451 = !DICompositeType(tag: DW_TAG_variant_part, scope: !449, file: !2, size: 128, align: 64, elements: !452, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !492)
!452 = !{!453, !488}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !451, file: !2, baseType: !454, size: 128, align: 64, extraData: i64 0)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !449, file: !2, size: 128, align: 64, elements: !23, templateParams: !455, identifier: "742dbe7e160661d8ca36fcfff2574850")
!455 = !{!456}
!456 = !DITemplateTypeParameter(name: "T", type: !457)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !458, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!458 = !{!459, !487}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !457, file: !2, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !94, file: !2, size: 448, align: 64, elements: !462, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !461, file: !2, baseType: !9, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !461, file: !2, baseType: !465, size: 384, align: 64, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !94, file: !2, size: 384, align: 64, elements: !466, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!466 = !{!467, !468, !469, !470, !486}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !465, file: !2, baseType: !238, size: 32, align: 32, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !465, file: !2, baseType: !93, size: 8, align: 8, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !2, baseType: !236, size: 32, align: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !465, file: !2, baseType: !471, size: 128, align: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !94, file: !2, size: 128, align: 64, elements: !472, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!472 = !{!473}
!473 = !DICompositeType(tag: DW_TAG_variant_part, scope: !471, file: !2, size: 128, align: 64, elements: !474, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !485)
!474 = !{!475, !479, !483}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !473, file: !2, baseType: !476, size: 128, align: 64, extraData: i64 0)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !471, file: !2, size: 128, align: 64, elements: !477, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !476, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !473, file: !2, baseType: !480, size: 128, align: 64, extraData: i64 1)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !471, file: !2, size: 128, align: 64, elements: !481, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !480, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !473, file: !2, baseType: !484, size: 128, align: 64, extraData: i64 2)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !471, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!485 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !2, baseType: !255, size: 64, align: 64, flags: DIFlagArtificial)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !465, file: !2, baseType: !471, size: 128, align: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !457, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !451, file: !2, baseType: !489, size: 128, align: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !449, file: !2, size: 128, align: 64, elements: !490, templateParams: !455, identifier: "17f2fc106094349c7673abca4839c97a")
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !489, file: !2, baseType: !457, size: 128, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, scope: !449, file: !2, baseType: !255, size: 64, align: 64, flags: DIFlagArtificial)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !435, file: !2, baseType: !494, size: 128, align: 64, offset: 256)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !495, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!495 = !{!496, !508}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !494, file: !2, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !96, file: !2, size: 128, align: 64, elements: !499, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!499 = !{!500, !504}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !498, file: !2, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !502, size: 64, align: 64, dwarfAddressSpace: 0)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !503, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!503 = !DINamespace(name: "{extern#0}", scope: !96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !498, file: !2, baseType: !505, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!214, !501, !232}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !494, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!435, !438, !494}
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "pieces", arg: 1, scope: !434, file: !210, line: 390, type: !438)
!513 = !DILocalVariable(name: "args", arg: 2, scope: !434, file: !210, line: 390, type: !494)
!514 = !DILocation(line: 390, column: 25, scope: !434)
!515 = !DILocation(line: 390, column: 53, scope: !434)
!516 = !DILocation(line: 391, column: 12, scope: !434)
!517 = !DILocation(line: 391, column: 56, scope: !434)
!518 = !DILocation(line: 391, column: 41, scope: !434)
!519 = !DILocation(line: 394, column: 34, scope: !434)
!520 = !DILocation(line: 394, column: 9, scope: !434)
!521 = !DILocation(line: 395, column: 6, scope: !434)
!522 = !DILocation(line: 392, column: 13, scope: !434)
!523 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hc9194a37c1bc38d6E", scope: !525, file: !524, line: 248, type: !528, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !534, retainedNodes: !531)
!524 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!525 = !DINamespace(name: "FnOnce", scope: !526)
!526 = !DINamespace(name: "function", scope: !527)
!527 = !DINamespace(name: "ops", scope: !97)
!528 = !DISubroutineType(types: !529)
!529 = !{!33, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !{!532, !533}
!532 = !DILocalVariable(arg: 1, scope: !523, file: !524, line: 248, type: !530)
!533 = !DILocalVariable(arg: 2, scope: !523, file: !524, line: 248, type: !7)
!534 = !{!535, !536}
!535 = !DITemplateTypeParameter(name: "Self", type: !14)
!536 = !DITemplateTypeParameter(name: "Args", type: !7)
!537 = !DILocation(line: 248, column: 5, scope: !523)
!538 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h1a3e8af765d5a9caE", scope: !525, file: !524, line: 248, type: !539, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !534, retainedNodes: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!33, !14}
!541 = !{!542, !543}
!542 = !DILocalVariable(arg: 1, scope: !538, file: !524, line: 248, type: !14)
!543 = !DILocalVariable(arg: 2, scope: !538, file: !524, line: 248, type: !7)
!544 = !DILocation(line: 248, column: 5, scope: !538)
!545 = distinct !DISubprogram(name: "call_once<conditional_tests::test_conditionals::test_binary_conditionals::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h23f74013fac2eec4E", scope: !525, file: !524, line: 248, type: !546, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !554, retainedNodes: !551)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !549, file: !2, align: 8, elements: !23, identifier: "b05e55caa343a2ccedb80875f6db1b0")
!549 = !DINamespace(name: "test_binary_conditionals", scope: !550)
!550 = !DINamespace(name: "test_conditionals", scope: !73)
!551 = !{!552, !553}
!552 = !DILocalVariable(arg: 1, scope: !545, file: !524, line: 248, type: !548)
!553 = !DILocalVariable(arg: 2, scope: !545, file: !524, line: 248, type: !7)
!554 = !{!555, !536}
!555 = !DITemplateTypeParameter(name: "Self", type: !548)
!556 = !DILocation(line: 248, column: 5, scope: !545)
!557 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h24f5a6df8cab6bc5E", scope: !525, file: !524, line: 248, type: !120, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !561, retainedNodes: !558)
!558 = !{!559, !560}
!559 = !DILocalVariable(arg: 1, scope: !557, file: !524, line: 248, type: !20)
!560 = !DILocalVariable(arg: 2, scope: !557, file: !524, line: 248, type: !7)
!561 = !{!562, !536}
!562 = !DITemplateTypeParameter(name: "Self", type: !20)
!563 = !DILocation(line: 248, column: 5, scope: !557)
!564 = distinct !DISubprogram(name: "call_once<conditional_tests::test_conditionals::test_else_if_chain::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5347e9b2532e937fE", scope: !525, file: !524, line: 248, type: !565, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !572, retainedNodes: !569)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !567}
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !568, file: !2, align: 8, elements: !23, identifier: "13c240ba66e37aac240021c2cf28b24")
!568 = !DINamespace(name: "test_else_if_chain", scope: !550)
!569 = !{!570, !571}
!570 = !DILocalVariable(arg: 1, scope: !564, file: !524, line: 248, type: !567)
!571 = !DILocalVariable(arg: 2, scope: !564, file: !524, line: 248, type: !7)
!572 = !{!573, !536}
!573 = !DITemplateTypeParameter(name: "Self", type: !567)
!574 = !DILocation(line: 248, column: 5, scope: !564)
!575 = distinct !DISubprogram(name: "call_once<conditional_tests::test_conditionals::test_buffer2::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5645bfeebb5e2baeE", scope: !525, file: !524, line: 248, type: !576, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !583, retainedNodes: !580)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !578}
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !579, file: !2, align: 8, elements: !23, identifier: "5210352ab429333f26fdc0648d2294d5")
!579 = !DINamespace(name: "test_buffer2", scope: !550)
!580 = !{!581, !582}
!581 = !DILocalVariable(arg: 1, scope: !575, file: !524, line: 248, type: !578)
!582 = !DILocalVariable(arg: 2, scope: !575, file: !524, line: 248, type: !7)
!583 = !{!584, !536}
!584 = !DITemplateTypeParameter(name: "Self", type: !578)
!585 = !DILocation(line: 248, column: 5, scope: !575)
!586 = distinct !DISubprogram(name: "call_once<conditional_tests::test_conditionals::test_buffer::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf46fb3a7b6d671f2E", scope: !525, file: !524, line: 248, type: !587, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !594, retainedNodes: !591)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !589}
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !590, file: !2, align: 8, elements: !23, identifier: "d4eec479310e22489e1628613fd84667")
!590 = !DINamespace(name: "test_buffer", scope: !550)
!591 = !{!592, !593}
!592 = !DILocalVariable(arg: 1, scope: !586, file: !524, line: 248, type: !589)
!593 = !DILocalVariable(arg: 2, scope: !586, file: !524, line: 248, type: !7)
!594 = !{!595, !536}
!595 = !DITemplateTypeParameter(name: "Self", type: !589)
!596 = !DILocation(line: 248, column: 5, scope: !586)
!597 = distinct !DISubprogram(name: "call_once<conditional_tests::test_conditionals::test_unused_conditional::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hf664fea4da24098fE", scope: !525, file: !524, line: 248, type: !598, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !605, retainedNodes: !602)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600}
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !601, file: !2, align: 8, elements: !23, identifier: "1d6bace5f92c7c5e3f9c55f74dec3fda")
!601 = !DINamespace(name: "test_unused_conditional", scope: !550)
!602 = !{!603, !604}
!603 = !DILocalVariable(arg: 1, scope: !597, file: !524, line: 248, type: !600)
!604 = !DILocalVariable(arg: 2, scope: !597, file: !524, line: 248, type: !7)
!605 = !{!606, !536}
!606 = !DITemplateTypeParameter(name: "Self", type: !600)
!607 = !DILocation(line: 248, column: 5, scope: !597)
!608 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h902ef99a76185d1bE", scope: !363, file: !609, line: 487, type: !610, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !371, retainedNodes: !613)
!609 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!610 = !DISubroutineType(types: !611)
!611 = !{null, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!613 = !{!614}
!614 = !DILocalVariable(arg: 1, scope: !608, file: !609, line: 487, type: !612)
!615 = !DILocation(line: 487, column: 1, scope: !608)
!616 = distinct !DISubprogram(name: "drop_in_place<&[i32; 4]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$4$u5d$$GT$17h8cd2f2f85c518c1cE", scope: !363, file: !609, line: 487, type: !617, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !622, retainedNodes: !620)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 4]", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = !{!621}
!621 = !DILocalVariable(arg: 1, scope: !616, file: !609, line: 487, type: !619)
!622 = !{!623}
!623 = !DITemplateTypeParameter(name: "T", type: !66)
!624 = !DILocation(line: 487, column: 1, scope: !616)
!625 = distinct !DISubprogram(name: "drop_in_place<&[i32; 6]>", linkageName: "_ZN4core3ptr49drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$6$u5d$$GT$17h41612eb19462b473E", scope: !363, file: !609, line: 487, type: !626, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !631, retainedNodes: !629)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 6]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!629 = !{!630}
!630 = !DILocalVariable(arg: 1, scope: !625, file: !609, line: 487, type: !628)
!631 = !{!632}
!632 = !DITemplateTypeParameter(name: "T", type: !42)
!633 = !DILocation(line: 487, column: 1, scope: !625)
!634 = distinct !DISubprogram(name: "drop_in_place<&[i32; 30]>", linkageName: "_ZN4core3ptr50drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$30$u5d$$GT$17h59c77ffe7fc654d4E", scope: !363, file: !609, line: 487, type: !635, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !640, retainedNodes: !638)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 30]", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!638 = !{!639}
!639 = !DILocalVariable(arg: 1, scope: !634, file: !609, line: 487, type: !637)
!640 = !{!641}
!641 = !DITemplateTypeParameter(name: "T", type: !54)
!642 = !DILocation(line: 487, column: 1, scope: !634)
!643 = distinct !DISubprogram(name: "is_null<conditional_tests::conditionals::py_flag>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null17h8d9ed15824963850E", scope: !645, file: !644, line: 35, type: !647, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !655, retainedNodes: !653)
!644 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6672664af50614ec3c026afd55307af7")
!645 = !DINamespace(name: "{impl#0}", scope: !646)
!646 = !DINamespace(name: "mut_ptr", scope: !363)
!647 = !DISubroutineType(types: !648)
!648 = !{!407, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut conditional_tests::conditionals::py_flag", baseType: !650, size: 64, align: 64, dwarfAddressSpace: 0)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "py_flag", scope: !72, file: !2, size: 32, align: 32, elements: !651, templateParams: !23, identifier: "999708a81b8769b0221e7bc2df42cca9")
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !650, file: !2, baseType: !33, size: 32, align: 32)
!653 = !{!654}
!654 = !DILocalVariable(name: "self", arg: 1, scope: !643, file: !644, line: 35, type: !649)
!655 = !{!656}
!656 = !DITemplateTypeParameter(name: "T", type: !650)
!657 = !DILocation(line: 35, column: 26, scope: !643)
!658 = !DILocalVariable(name: "metadata", scope: !659, file: !644, line: 38, type: !7, align: 1)
!659 = !DILexicalBlockFile(scope: !660, file: !644, discriminator: 0)
!660 = distinct !DISubprogram(name: "from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h34aafc97a7ef5436E", scope: !662, file: !661, line: 127, type: !663, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !667)
!661 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!662 = !DINamespace(name: "metadata", scope: !363)
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !666, !7}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!667 = !{!668, !658}
!668 = !DILocalVariable(name: "data_address", scope: !659, file: !644, line: 38, type: !666, align: 8)
!669 = !{!670}
!670 = !DITemplateTypeParameter(name: "T", type: !98)
!671 = !DILocation(line: 38, column: 41, scope: !659, inlinedAt: !672)
!672 = !DILocation(line: 668, column: 5, scope: !673, inlinedAt: !676)
!673 = distinct !DISubprogram(name: "null_mut<u8>", linkageName: "_ZN4core3ptr8null_mut17h29bf71441b1e714bE", scope: !363, file: !609, line: 667, type: !674, scopeLine: 667, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !23)
!674 = !DISubroutineType(types: !675)
!675 = !{!665}
!676 = !DILocation(line: 38, column: 41, scope: !643)
!677 = !DILocation(line: 38, column: 9, scope: !643)
!678 = !DILocalVariable(name: "self", scope: !679, file: !644, line: 38, type: !665, align: 8)
!679 = distinct !DISubprogram(name: "guaranteed_eq<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$13guaranteed_eq17h887daadf530ab021E", scope: !645, file: !644, line: 707, type: !680, scopeLine: 707, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{!407, !665, !665}
!682 = !{!678, !683}
!683 = !DILocalVariable(name: "other", scope: !679, file: !644, line: 38, type: !665, align: 8)
!684 = !DILocation(line: 38, column: 9, scope: !679, inlinedAt: !677)
!685 = !DILocation(line: 38, column: 41, scope: !686, inlinedAt: !692)
!686 = !DILexicalBlockFile(scope: !687, file: !644, discriminator: 0)
!687 = distinct !DISubprogram(name: "invalid_mut<()>", linkageName: "_ZN4core3ptr11invalid_mut17h419acde58926ef17E", scope: !363, file: !609, line: 569, type: !688, scopeLine: 569, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !139, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!666, !9}
!690 = !{!691}
!691 = !DILocalVariable(name: "addr", scope: !686, file: !644, line: 38, type: !9, align: 8)
!692 = !DILocation(line: 668, column: 24, scope: !673, inlinedAt: !676)
!693 = !DILocation(line: 39, column: 6, scope: !643)
!694 = distinct !DISubprogram(name: "is_null<core::ffi::c_void>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null17hbc8ea403b93b708aE", scope: !645, file: !644, line: 35, type: !695, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !700, retainedNodes: !698)
!695 = !DISubroutineType(types: !696)
!696 = !{!407, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!698 = !{!699}
!699 = !DILocalVariable(name: "self", arg: 1, scope: !694, file: !644, line: 35, type: !697)
!700 = !{!701}
!701 = !DITemplateTypeParameter(name: "T", type: !104)
!702 = !DILocation(line: 35, column: 26, scope: !694)
!703 = !DILocalVariable(name: "metadata", scope: !704, file: !644, line: 38, type: !7, align: 1)
!704 = !DILexicalBlockFile(scope: !705, file: !644, discriminator: 0)
!705 = distinct !DISubprogram(name: "from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h34aafc97a7ef5436E", scope: !662, file: !661, line: 127, type: !663, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !706)
!706 = !{!707, !703}
!707 = !DILocalVariable(name: "data_address", scope: !704, file: !644, line: 38, type: !666, align: 8)
!708 = !DILocation(line: 38, column: 41, scope: !704, inlinedAt: !709)
!709 = !DILocation(line: 668, column: 5, scope: !710, inlinedAt: !711)
!710 = distinct !DISubprogram(name: "null_mut<u8>", linkageName: "_ZN4core3ptr8null_mut17h29bf71441b1e714bE", scope: !363, file: !609, line: 667, type: !674, scopeLine: 667, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !23)
!711 = !DILocation(line: 38, column: 41, scope: !694)
!712 = !DILocation(line: 38, column: 9, scope: !694)
!713 = !DILocalVariable(name: "self", scope: !714, file: !644, line: 38, type: !665, align: 8)
!714 = distinct !DISubprogram(name: "guaranteed_eq<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$13guaranteed_eq17h887daadf530ab021E", scope: !645, file: !644, line: 707, type: !680, scopeLine: 707, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !715)
!715 = !{!713, !716}
!716 = !DILocalVariable(name: "other", scope: !714, file: !644, line: 38, type: !665, align: 8)
!717 = !DILocation(line: 38, column: 9, scope: !714, inlinedAt: !712)
!718 = !DILocation(line: 38, column: 41, scope: !719, inlinedAt: !723)
!719 = !DILexicalBlockFile(scope: !720, file: !644, discriminator: 0)
!720 = distinct !DISubprogram(name: "invalid_mut<()>", linkageName: "_ZN4core3ptr11invalid_mut17h419acde58926ef17E", scope: !363, file: !609, line: 569, type: !688, scopeLine: 569, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !139, retainedNodes: !721)
!721 = !{!722}
!722 = !DILocalVariable(name: "addr", scope: !719, file: !644, line: 38, type: !9, align: 8)
!723 = !DILocation(line: 668, column: 24, scope: !710, inlinedAt: !711)
!724 = !DILocation(line: 39, column: 6, scope: !694)
!725 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17hfb6e525a6d2548beE", scope: !363, file: !609, line: 487, type: !726, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !730, retainedNodes: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !530}
!728 = !{!729}
!729 = !DILocalVariable(arg: 1, scope: !725, file: !609, line: 487, type: !530)
!730 = !{!731}
!731 = !DITemplateTypeParameter(name: "T", type: !14)
!732 = !DILocation(line: 487, column: 1, scope: !725)
!733 = distinct !DISubprogram(name: "is_null<core::ffi::c_void>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17hf54e692882b31083E", scope: !735, file: !734, line: 36, type: !737, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !700, retainedNodes: !740)
!734 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!735 = !DINamespace(name: "{impl#0}", scope: !736)
!736 = !DINamespace(name: "const_ptr", scope: !363)
!737 = !DISubroutineType(types: !738)
!738 = !{!407, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::ffi::c_void", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!740 = !{!741}
!741 = !DILocalVariable(name: "self", arg: 1, scope: !733, file: !734, line: 36, type: !739)
!742 = !DILocation(line: 36, column: 26, scope: !733)
!743 = !DILocalVariable(name: "metadata", scope: !744, file: !734, line: 39, type: !7, align: 1)
!744 = !DILexicalBlockFile(scope: !745, file: !734, discriminator: 0)
!745 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h8bcfb0e37818646dE", scope: !662, file: !661, line: 110, type: !746, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{!153, !6, !7}
!748 = !{!749, !743}
!749 = !DILocalVariable(name: "data_address", scope: !744, file: !734, line: 39, type: !6, align: 8)
!750 = !DILocation(line: 39, column: 43, scope: !744, inlinedAt: !751)
!751 = !DILocation(line: 513, column: 5, scope: !752, inlinedAt: !755)
!752 = distinct !DISubprogram(name: "null<u8>", linkageName: "_ZN4core3ptr4null17hedb8250260113de3E", scope: !363, file: !609, line: 512, type: !753, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !23)
!753 = !DISubroutineType(types: !754)
!754 = !{!153}
!755 = !DILocation(line: 39, column: 43, scope: !733)
!756 = !DILocation(line: 39, column: 9, scope: !733)
!757 = !DILocalVariable(name: "self", scope: !758, file: !734, line: 39, type: !153, align: 8)
!758 = distinct !DISubprogram(name: "guaranteed_eq<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$13guaranteed_eq17h8e0ed1648a7af27bE", scope: !735, file: !734, line: 777, type: !759, scopeLine: 777, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !761)
!759 = !DISubroutineType(types: !760)
!760 = !{!407, !153, !153}
!761 = !{!757, !762}
!762 = !DILocalVariable(name: "other", scope: !758, file: !734, line: 39, type: !153, align: 8)
!763 = !DILocation(line: 39, column: 9, scope: !758, inlinedAt: !756)
!764 = !DILocation(line: 39, column: 43, scope: !765, inlinedAt: !771)
!765 = !DILexicalBlockFile(scope: !766, file: !734, discriminator: 0)
!766 = distinct !DISubprogram(name: "invalid<()>", linkageName: "_ZN4core3ptr7invalid17h8396042e7bee8bafE", scope: !363, file: !609, line: 538, type: !767, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !139, retainedNodes: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!6, !9}
!769 = !{!770}
!770 = !DILocalVariable(name: "addr", scope: !765, file: !734, line: 39, type: !9, align: 8)
!771 = !DILocation(line: 513, column: 20, scope: !752, inlinedAt: !755)
!772 = !DILocation(line: 40, column: 6, scope: !733)
!773 = distinct !DISubprogram(name: "fmt<i32, 30>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17h22373c4754ced3beE", scope: !775, file: !774, line: 251, type: !777, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !779)
!774 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e237aff39bff30ac55984ee183267020")
!775 = !DINamespace(name: "{impl#12}", scope: !776)
!776 = !DINamespace(name: "array", scope: !97)
!777 = !DISubroutineType(types: !778)
!778 = !{!214, !54, !232}
!779 = !{!780, !781}
!780 = !DILocalVariable(name: "self", arg: 1, scope: !773, file: !774, line: 251, type: !54)
!781 = !DILocalVariable(name: "f", arg: 2, scope: !773, file: !774, line: 251, type: !232)
!782 = !DILocation(line: 251, column: 12, scope: !773)
!783 = !DILocation(line: 251, column: 19, scope: !773)
!784 = !DILocalVariable(name: "index", scope: !785, file: !774, line: 252, type: !789, align: 1)
!785 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 30>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h987b83bd0c88022cE", scope: !786, file: !774, line: 285, type: !787, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !801, retainedNodes: !799)
!786 = !DINamespace(name: "{impl#15}", scope: !776)
!787 = !DISubroutineType(types: !788)
!788 = !{!325, !54, !789, !791}
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !790, file: !2, align: 8, elements: !23, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!790 = !DINamespace(name: "range", scope: !527)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !792, size: 64, align: 64, dwarfAddressSpace: 0)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !793, file: !2, size: 192, align: 64, elements: !795, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!793 = !DINamespace(name: "location", scope: !794)
!794 = !DINamespace(name: "panic", scope: !97)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !792, file: !2, baseType: !442, size: 128, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !792, file: !2, baseType: !236, size: 32, align: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !792, file: !2, baseType: !236, size: 32, align: 32, offset: 160)
!799 = !{!800, !784}
!800 = !DILocalVariable(name: "self", scope: !785, file: !774, line: 252, type: !54, align: 8)
!801 = !{!287, !802}
!802 = !DITemplateTypeParameter(name: "I", type: !789)
!803 = !DILocation(line: 252, column: 27, scope: !785, inlinedAt: !804)
!804 = !DILocation(line: 252, column: 27, scope: !773)
!805 = !DILocalVariable(name: "index", scope: !806, file: !774, line: 252, type: !789, align: 1)
!806 = !DILexicalBlockFile(scope: !807, file: !774, discriminator: 0)
!807 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17h57bc1c22c515a65aE", scope: !809, file: !808, line: 17, type: !811, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !801, retainedNodes: !813)
!808 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!809 = !DINamespace(name: "{impl#0}", scope: !810)
!810 = !DINamespace(name: "index", scope: !354)
!811 = !DISubroutineType(types: !812)
!812 = !{!325, !325, !789, !791}
!813 = !{!814, !805}
!814 = !DILocalVariable(name: "self", scope: !806, file: !774, line: 252, type: !325, align: 8)
!815 = !DILocation(line: 252, column: 27, scope: !806, inlinedAt: !816)
!816 = !DILocation(line: 286, column: 9, scope: !785, inlinedAt: !804)
!817 = !DILocalVariable(name: "self", scope: !818, file: !774, line: 252, type: !789, align: 1)
!818 = !DILexicalBlockFile(scope: !819, file: !774, discriminator: 0)
!819 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hbcb09dabb09a4505E", scope: !820, file: !808, line: 432, type: !821, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !823)
!820 = !DINamespace(name: "{impl#6}", scope: !810)
!821 = !DISubroutineType(types: !822)
!822 = !{!325, !789, !325, !791}
!823 = !{!817, !824}
!824 = !DILocalVariable(name: "slice", scope: !818, file: !774, line: 252, type: !325, align: 8)
!825 = !DILocation(line: 252, column: 27, scope: !818, inlinedAt: !826)
!826 = !DILocation(line: 18, column: 9, scope: !807, inlinedAt: !816)
!827 = !DILocation(line: 252, column: 26, scope: !773)
!828 = !DILocation(line: 252, column: 9, scope: !773)
!829 = !DILocation(line: 253, column: 6, scope: !773)
!830 = distinct !DISubprogram(name: "fmt<i32, 6>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17h9a527c9266e25867E", scope: !775, file: !774, line: 251, type: !831, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!214, !42, !232}
!833 = !{!834, !835}
!834 = !DILocalVariable(name: "self", arg: 1, scope: !830, file: !774, line: 251, type: !42)
!835 = !DILocalVariable(name: "f", arg: 2, scope: !830, file: !774, line: 251, type: !232)
!836 = !DILocation(line: 251, column: 12, scope: !830)
!837 = !DILocation(line: 251, column: 19, scope: !830)
!838 = !DILocalVariable(name: "index", scope: !839, file: !774, line: 252, type: !789, align: 1)
!839 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 6>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h8ff47697d5c46a1eE", scope: !786, file: !774, line: 285, type: !840, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !801, retainedNodes: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!325, !42, !789, !791}
!842 = !{!843, !838}
!843 = !DILocalVariable(name: "self", scope: !839, file: !774, line: 252, type: !42, align: 8)
!844 = !DILocation(line: 252, column: 27, scope: !839, inlinedAt: !845)
!845 = !DILocation(line: 252, column: 27, scope: !830)
!846 = !DILocalVariable(name: "index", scope: !847, file: !774, line: 252, type: !789, align: 1)
!847 = !DILexicalBlockFile(scope: !848, file: !774, discriminator: 0)
!848 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17h57bc1c22c515a65aE", scope: !809, file: !808, line: 17, type: !811, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !801, retainedNodes: !849)
!849 = !{!850, !846}
!850 = !DILocalVariable(name: "self", scope: !847, file: !774, line: 252, type: !325, align: 8)
!851 = !DILocation(line: 252, column: 27, scope: !847, inlinedAt: !852)
!852 = !DILocation(line: 286, column: 9, scope: !839, inlinedAt: !845)
!853 = !DILocalVariable(name: "self", scope: !854, file: !774, line: 252, type: !789, align: 1)
!854 = !DILexicalBlockFile(scope: !855, file: !774, discriminator: 0)
!855 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hbcb09dabb09a4505E", scope: !820, file: !808, line: 432, type: !821, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !856)
!856 = !{!853, !857}
!857 = !DILocalVariable(name: "slice", scope: !854, file: !774, line: 252, type: !325, align: 8)
!858 = !DILocation(line: 252, column: 27, scope: !854, inlinedAt: !859)
!859 = !DILocation(line: 18, column: 9, scope: !848, inlinedAt: !852)
!860 = !DILocation(line: 252, column: 26, scope: !830)
!861 = !DILocation(line: 252, column: 9, scope: !830)
!862 = !DILocation(line: 253, column: 6, scope: !830)
!863 = distinct !DISubprogram(name: "fmt<i32, 4>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17hcabc00bee552e0ecE", scope: !775, file: !774, line: 251, type: !864, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!214, !66, !232}
!866 = !{!867, !868}
!867 = !DILocalVariable(name: "self", arg: 1, scope: !863, file: !774, line: 251, type: !66)
!868 = !DILocalVariable(name: "f", arg: 2, scope: !863, file: !774, line: 251, type: !232)
!869 = !DILocation(line: 251, column: 12, scope: !863)
!870 = !DILocation(line: 251, column: 19, scope: !863)
!871 = !DILocalVariable(name: "index", scope: !872, file: !774, line: 252, type: !789, align: 1)
!872 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 4>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h75297e91b1e229c8E", scope: !786, file: !774, line: 285, type: !873, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !801, retainedNodes: !875)
!873 = !DISubroutineType(types: !874)
!874 = !{!325, !66, !789, !791}
!875 = !{!876, !871}
!876 = !DILocalVariable(name: "self", scope: !872, file: !774, line: 252, type: !66, align: 8)
!877 = !DILocation(line: 252, column: 27, scope: !872, inlinedAt: !878)
!878 = !DILocation(line: 252, column: 27, scope: !863)
!879 = !DILocalVariable(name: "index", scope: !880, file: !774, line: 252, type: !789, align: 1)
!880 = !DILexicalBlockFile(scope: !881, file: !774, discriminator: 0)
!881 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17h57bc1c22c515a65aE", scope: !809, file: !808, line: 17, type: !811, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !801, retainedNodes: !882)
!882 = !{!883, !879}
!883 = !DILocalVariable(name: "self", scope: !880, file: !774, line: 252, type: !325, align: 8)
!884 = !DILocation(line: 252, column: 27, scope: !880, inlinedAt: !885)
!885 = !DILocation(line: 286, column: 9, scope: !872, inlinedAt: !878)
!886 = !DILocalVariable(name: "self", scope: !887, file: !774, line: 252, type: !789, align: 1)
!887 = !DILexicalBlockFile(scope: !888, file: !774, discriminator: 0)
!888 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hbcb09dabb09a4505E", scope: !820, file: !808, line: 432, type: !821, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !889)
!889 = !{!886, !890}
!890 = !DILocalVariable(name: "slice", scope: !887, file: !774, line: 252, type: !325, align: 8)
!891 = !DILocation(line: 252, column: 27, scope: !887, inlinedAt: !892)
!892 = !DILocation(line: 18, column: 9, scope: !881, inlinedAt: !885)
!893 = !DILocation(line: 252, column: 26, scope: !863)
!894 = !DILocation(line: 252, column: 9, scope: !863)
!895 = !DILocation(line: 253, column: 6, scope: !863)
!896 = distinct !DISubprogram(name: "eq<i32, i32, 4>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17h801033fca19a4772E", scope: !898, file: !897, line: 11, type: !900, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !905, retainedNodes: !902)
!897 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/equality.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b2a6ef978d2ec8f60a33a03ff9f5cb8")
!898 = !DINamespace(name: "{impl#0}", scope: !899)
!899 = !DINamespace(name: "equality", scope: !776)
!900 = !DISubroutineType(types: !901)
!901 = !{!407, !66, !66}
!902 = !{!903, !904}
!903 = !DILocalVariable(name: "self", arg: 1, scope: !896, file: !897, line: 11, type: !66)
!904 = !DILocalVariable(name: "other", arg: 2, scope: !896, file: !897, line: 11, type: !66)
!905 = !{!906, !907}
!906 = !DITemplateTypeParameter(name: "A", type: !33)
!907 = !DITemplateTypeParameter(name: "B", type: !33)
!908 = !DILocation(line: 11, column: 11, scope: !896)
!909 = !DILocation(line: 11, column: 18, scope: !896)
!910 = !DILocation(line: 12, column: 9, scope: !896)
!911 = !DILocation(line: 13, column: 6, scope: !896)
!912 = distinct !DISubprogram(name: "eq<i32, i32, 6>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17h925cfbd4c1a228e5E", scope: !898, file: !897, line: 11, type: !913, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !905, retainedNodes: !915)
!913 = !DISubroutineType(types: !914)
!914 = !{!407, !42, !42}
!915 = !{!916, !917}
!916 = !DILocalVariable(name: "self", arg: 1, scope: !912, file: !897, line: 11, type: !42)
!917 = !DILocalVariable(name: "other", arg: 2, scope: !912, file: !897, line: 11, type: !42)
!918 = !DILocation(line: 11, column: 11, scope: !912)
!919 = !DILocation(line: 11, column: 18, scope: !912)
!920 = !DILocation(line: 12, column: 9, scope: !912)
!921 = !DILocation(line: 13, column: 6, scope: !912)
!922 = distinct !DISubprogram(name: "eq<i32, i32, 30>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17hdfb198b0892f0dc1E", scope: !898, file: !897, line: 11, type: !923, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !905, retainedNodes: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{!407, !54, !54}
!925 = !{!926, !927}
!926 = !DILocalVariable(name: "self", arg: 1, scope: !922, file: !897, line: 11, type: !54)
!927 = !DILocalVariable(name: "other", arg: 2, scope: !922, file: !897, line: 11, type: !54)
!928 = !DILocation(line: 11, column: 11, scope: !922)
!929 = !DILocation(line: 11, column: 18, scope: !922)
!930 = !DILocation(line: 12, column: 9, scope: !922)
!931 = !DILocation(line: 13, column: 6, scope: !922)
!932 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h3fde33b6a595246eE", scope: !353, file: !352, line: 506, type: !933, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !940)
!933 = !DISubroutineType(types: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i32]", file: !2, size: 128, align: 64, elements: !937, templateParams: !23, identifier: "e558f8cebf02444c46b3d01510c8747d")
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !936, file: !2, baseType: !328, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !936, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!940 = !{!941}
!941 = !DILocalVariable(name: "self", arg: 1, scope: !932, file: !352, line: 506, type: !936)
!942 = !DILocation(line: 506, column: 29, scope: !932)
!943 = !DILocation(line: 507, column: 9, scope: !932)
!944 = !DILocation(line: 508, column: 6, scope: !932)
!945 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17hc44d8b1467b0945fE", scope: !357, file: !946, line: 88, type: !355, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !947)
!946 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "36678af40fdc22d7150f6f91e11271b3")
!947 = !{!948, !949, !951}
!948 = !DILocalVariable(name: "slice", arg: 1, scope: !945, file: !946, line: 88, type: !325)
!949 = !DILocalVariable(name: "ptr", scope: !950, file: !946, line: 89, type: !366, align: 8)
!950 = distinct !DILexicalBlock(scope: !945, file: !946, line: 89, column: 9)
!951 = !DILocalVariable(name: "end", scope: !952, file: !946, line: 94, type: !366, align: 8)
!952 = distinct !DILexicalBlock(scope: !950, file: !946, line: 94, column: 13)
!953 = !DILocation(line: 88, column: 23, scope: !945)
!954 = !DILocation(line: 94, column: 17, scope: !952)
!955 = !DILocalVariable(name: "metadata", scope: !956, file: !946, line: 92, type: !7, align: 1)
!956 = !DILexicalBlockFile(scope: !957, file: !946, discriminator: 0)
!957 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h8bcfb0e37818646dE", scope: !662, file: !661, line: 110, type: !746, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !958)
!958 = !{!959, !955}
!959 = !DILocalVariable(name: "data_address", scope: !956, file: !946, line: 92, type: !6, align: 8)
!960 = !DILocation(line: 92, column: 21, scope: !956, inlinedAt: !961)
!961 = !DILocation(line: 513, column: 5, scope: !962, inlinedAt: !963)
!962 = distinct !DISubprogram(name: "null<u8>", linkageName: "_ZN4core3ptr4null17hedb8250260113de3E", scope: !363, file: !609, line: 512, type: !753, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !669, retainedNodes: !23)
!963 = !DILocation(line: 39, column: 43, scope: !964, inlinedAt: !970)
!964 = distinct !DISubprogram(name: "is_null<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17he6281b21bc813e2fE", scope: !735, file: !734, line: 36, type: !965, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !967)
!965 = !DISubroutineType(types: !966)
!966 = !{!407, !366}
!967 = !{!968}
!968 = !DILocalVariable(name: "self", scope: !969, file: !946, line: 92, type: !366, align: 8)
!969 = !DILexicalBlockFile(scope: !964, file: !946, discriminator: 0)
!970 = !DILocation(line: 92, column: 21, scope: !950)
!971 = !DILocation(line: 89, column: 19, scope: !945)
!972 = !DILocalVariable(name: "self", scope: !973, file: !946, line: 89, type: !325, align: 8)
!973 = !DILexicalBlockFile(scope: !974, file: !946, discriminator: 0)
!974 = distinct !DISubprogram(name: "as_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17hd909c6c77ccfdb90E", scope: !353, file: !352, line: 476, type: !975, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !90, templateParams: !286, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{!366, !325}
!977 = !{!972}
!978 = !DILocation(line: 89, column: 19, scope: !973, inlinedAt: !971)
!979 = !DILocation(line: 89, column: 13, scope: !950)
