; ModuleID = '3kiyh0be32xedwy0'
source_filename = "3kiyh0be32xedwy0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::builders::DebugList" = type { %"core::fmt::builders::DebugInner" }
%"core::fmt::builders::DebugInner" = type { %"core::fmt::Formatter"*, i8, i8, [6 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_unions.rs:12:1: 24:2]" = type {}
%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrComponents<u8>" = type { {}*, {} }
%"core::ptr::metadata::PtrRepr<u8>" = type { [1 x i64] }
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"unions::my_union" = type { [3 x i32] }
%"unions::C2RustUnnamed" = type { i32 }
%"unions::union_with_anon_struct" = type { [1 x i32] }
%"unions::my_union_flipped" = type { [3 x i32] }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&[i32; 19] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 19] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "d56b3de56b53d4abc5cc1f3b1366242")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 19]", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 608, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 19, lowerBound: 0)
!46 = !{i32 7, !"PIC Level", i32 2}
!47 = !{i32 7, !"PIE Level", i32 2}
!48 = !{i32 2, !"RtLibUseGOT", i32 1}
!49 = !{i32 2, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !52, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !53, globals: !71)
!52 = !DIFile(filename: "src/lib.rs/@/3kiyh0be32xedwy0", directory: "/home/calvin/git/c2rust/tests/unions")
!53 = !{!54, !65}
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !55, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !60)
!55 = !DINamespace(name: "v1", scope: !56)
!56 = !DINamespace(name: "rt", scope: !57)
!57 = !DINamespace(name: "fmt", scope: !58)
!58 = !DINamespace(name: "core", scope: null)
!59 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64}
!61 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !66, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagEnumClass, elements: !67)
!66 = !DINamespace(name: "panicking", scope: !58)
!67 = !{!68, !69, !70}
!68 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!71 = !{!0, !24, !34}
!72 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hf9bba9e0f5aeb1ecE", scope: !74, file: !73, line: 118, type: !76, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !82, retainedNodes: !78)
!73 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!74 = !DINamespace(name: "backtrace", scope: !75)
!75 = !DINamespace(name: "sys_common", scope: !17)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !20}
!78 = !{!79, !80}
!79 = !DILocalVariable(name: "f", arg: 1, scope: !72, file: !73, line: 118, type: !20)
!80 = !DILocalVariable(name: "result", scope: !81, file: !73, line: 122, type: !7, align: 1)
!81 = distinct !DILexicalBlock(scope: !72, file: !73, line: 122, column: 5)
!82 = !{!83, !84}
!83 = !DITemplateTypeParameter(name: "F", type: !20)
!84 = !DITemplateTypeParameter(name: "T", type: !7)
!85 = !DILocation(line: 122, column: 9, scope: !81)
!86 = !DILocation(line: 118, column: 43, scope: !72)
!87 = !DILocalVariable(name: "dummy", scope: !88, file: !73, line: 125, type: !7, align: 1)
!88 = !DILexicalBlockFile(scope: !89, file: !73, discriminator: 0)
!89 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hf4acad431ee54745E", scope: !91, file: !90, line: 225, type: !92, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !95, retainedNodes: !94)
!90 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!91 = !DINamespace(name: "hint", scope: !58)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !7}
!94 = !{!87}
!95 = !{!84}
!96 = !DILocation(line: 125, column: 5, scope: !88, inlinedAt: !97)
!97 = !DILocation(line: 125, column: 5, scope: !81)
!98 = !DILocation(line: 122, column: 18, scope: !72)
!99 = !{i32 3346528}
!100 = !DILocation(line: 128, column: 2, scope: !72)
!101 = !DILocation(line: 128, column: 1, scope: !72)
!102 = !DILocation(line: 118, column: 1, scope: !72)
!103 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17hd5aa0c5c1d87ed73E", scope: !16, file: !104, line: 139, type: !105, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !95, retainedNodes: !110)
!104 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !20, !107, !108}
!107 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !{!111, !112, !113, !114}
!111 = !DILocalVariable(name: "main", arg: 1, scope: !103, file: !104, line: 140, type: !20)
!112 = !DILocalVariable(name: "argc", arg: 2, scope: !103, file: !104, line: 141, type: !107)
!113 = !DILocalVariable(name: "argv", arg: 3, scope: !103, file: !104, line: 142, type: !108)
!114 = !DILocalVariable(name: "v", scope: !115, file: !104, line: 144, type: !107, align: 8)
!115 = distinct !DILexicalBlock(scope: !103, file: !104, line: 144, column: 5)
!116 = !DILocation(line: 140, column: 5, scope: !103)
!117 = !DILocation(line: 141, column: 5, scope: !103)
!118 = !DILocation(line: 142, column: 5, scope: !103)
!119 = !DILocation(line: 145, column: 10, scope: !103)
!120 = !DILocation(line: 145, column: 9, scope: !103)
!121 = !DILocation(line: 144, column: 17, scope: !103)
!122 = !DILocation(line: 144, column: 12, scope: !103)
!123 = !DILocation(line: 144, column: 12, scope: !115)
!124 = !DILocation(line: 150, column: 2, scope: !103)
!125 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hcc28f224c70efc71E", scope: !15, file: !104, line: 145, type: !126, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !95, retainedNodes: !129)
!126 = !DISubroutineType(types: !127)
!127 = !{!33, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !{!130}
!130 = !DILocalVariable(name: "main", scope: !125, file: !104, line: 140, type: !20, align: 8)
!131 = !{i64 8}
!132 = !DILocation(line: 140, column: 5, scope: !125)
!133 = !DILocalVariable(name: "self", scope: !134, file: !104, line: 145, type: !137, align: 1)
!134 = !DILexicalBlockFile(scope: !135, file: !104, discriminator: 0)
!135 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h254d4affa97ae901E", scope: !137, file: !136, line: 1808, type: !148, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !150)
!136 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !138, file: !2, size: 8, align: 8, elements: !139, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!138 = !DINamespace(name: "process", scope: !17)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !2, baseType: !141, size: 8, align: 8)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !142, file: !2, size: 8, align: 8, elements: !146, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!142 = !DINamespace(name: "process_common", scope: !143)
!143 = !DINamespace(name: "process", scope: !144)
!144 = !DINamespace(name: "unix", scope: !145)
!145 = !DINamespace(name: "sys", scope: !17)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !141, file: !2, baseType: !59, size: 8, align: 8)
!148 = !DISubroutineType(types: !149)
!149 = !{!33, !137}
!150 = !{!133}
!151 = !DILocation(line: 145, column: 18, scope: !134, inlinedAt: !152)
!152 = !DILocation(line: 145, column: 18, scope: !125)
!153 = !DILocation(line: 145, column: 77, scope: !125)
!154 = !DILocalVariable(name: "self", scope: !155, file: !104, line: 145, type: !160, align: 8)
!155 = !DILexicalBlockFile(scope: !156, file: !104, discriminator: 0)
!156 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217hbff94374e9118dbfE", scope: !141, file: !157, line: 485, type: !158, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !161)
!157 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!158 = !DISubroutineType(types: !159)
!159 = !{!33, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !{!154}
!162 = !DILocation(line: 145, column: 18, scope: !155, inlinedAt: !163)
!163 = !DILocation(line: 1809, column: 9, scope: !135, inlinedAt: !152)
!164 = !DILocation(line: 145, column: 17, scope: !125)
!165 = distinct !DISubprogram(name: "fmt<[i32]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7ea5137ed14024a4E", scope: !167, file: !166, line: 2361, type: !168, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !229)
!166 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!167 = !DINamespace(name: "{impl#59}", scope: !57)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !187, !193}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !171, file: !2, size: 8, align: 8, elements: !172, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!171 = !DINamespace(name: "result", scope: !58)
!172 = !{!173}
!173 = !DICompositeType(tag: DW_TAG_variant_part, scope: !170, file: !2, size: 8, align: 8, elements: !174, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !186)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !173, file: !2, baseType: !176, size: 8, align: 8, extraData: i64 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !170, file: !2, size: 8, align: 8, elements: !177, templateParams: !179, identifier: "cea751326735c343faf647063a65ad14")
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !176, file: !2, baseType: !7, align: 8, offset: 8)
!179 = !{!84, !180}
!180 = !DITemplateTypeParameter(name: "E", type: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !57, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !173, file: !2, baseType: !183, size: 8, align: 8, extraData: i64 1)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !170, file: !2, size: 8, align: 8, elements: !184, templateParams: !179, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !183, file: !2, baseType: !181, align: 8, offset: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !2, baseType: !59, size: 8, align: 8, flags: DIFlagArtificial)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32]", baseType: !188, size: 64, align: 64, dwarfAddressSpace: 0)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i32]", file: !2, size: 128, align: 64, elements: !189, templateParams: !23, identifier: "8022034f3dbe6b09f9f0a7f6cd6bb480")
!189 = !{!190, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !188, file: !2, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !57, file: !2, size: 512, align: 64, elements: !195, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!195 = !{!196, !198, !200, !201, !217, !218}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !2, baseType: !197, size: 32, align: 32, offset: 384)
!197 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !194, file: !2, baseType: !199, size: 32, align: 32, offset: 416)
!199 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !194, file: !2, baseType: !54, size: 8, align: 8, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !194, file: !2, baseType: !202, size: 128, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !203, file: !2, size: 128, align: 64, elements: !204, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!203 = !DINamespace(name: "option", scope: !58)
!204 = !{!205}
!205 = !DICompositeType(tag: DW_TAG_variant_part, scope: !202, file: !2, size: 128, align: 64, elements: !206, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !215)
!206 = !{!207, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !205, file: !2, baseType: !208, size: 128, align: 64, extraData: i64 0)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !202, file: !2, size: 128, align: 64, elements: !23, templateParams: !209, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!209 = !{!210}
!210 = !DITemplateTypeParameter(name: "T", type: !9)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !205, file: !2, baseType: !212, size: 128, align: 64, extraData: i64 1)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !202, file: !2, size: 128, align: 64, elements: !213, templateParams: !209, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !212, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !2, baseType: !216, size: 64, align: 64, flags: DIFlagArtificial)
!216 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !194, file: !2, baseType: !202, size: 128, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !194, file: !2, baseType: !219, size: 128, align: 64, offset: 256)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !220, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!220 = !{!221, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !219, file: !2, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !219, file: !2, baseType: !225, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3, lowerBound: 0)
!229 = !{!230, !231}
!230 = !DILocalVariable(name: "self", arg: 1, scope: !165, file: !166, line: 2361, type: !187)
!231 = !DILocalVariable(name: "f", arg: 2, scope: !165, file: !166, line: 2361, type: !193)
!232 = !{!233}
!233 = !DITemplateTypeParameter(name: "T", type: !33)
!234 = !DILocation(line: 2361, column: 20, scope: !165)
!235 = !DILocation(line: 2361, column: 27, scope: !165)
!236 = !DILocation(line: 2361, column: 71, scope: !165)
!237 = !{i64 4}
!238 = !DILocation(line: 2361, column: 62, scope: !165)
!239 = !DILocation(line: 2361, column: 84, scope: !165)
!240 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h97f5779427a3ef47E", scope: !167, file: !166, line: 2361, type: !241, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !244)
!241 = !DISubroutineType(types: !242)
!242 = !{!170, !243, !193}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !{!245, !246}
!245 = !DILocalVariable(name: "self", arg: 1, scope: !240, file: !166, line: 2361, type: !243)
!246 = !DILocalVariable(name: "f", arg: 2, scope: !240, file: !166, line: 2361, type: !193)
!247 = !DILocation(line: 2361, column: 20, scope: !240)
!248 = !DILocation(line: 2361, column: 27, scope: !240)
!249 = !DILocation(line: 2361, column: 71, scope: !240)
!250 = !DILocation(line: 2361, column: 62, scope: !240)
!251 = !DILocation(line: 2361, column: 84, scope: !240)
!252 = distinct !DISubprogram(name: "fmt<[i32; 19]>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h9ae207755ec5e05eE", scope: !167, file: !166, line: 2361, type: !253, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !259, retainedNodes: !256)
!253 = !DISubroutineType(types: !254)
!254 = !{!170, !255, !193}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&[i32; 19]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!256 = !{!257, !258}
!257 = !DILocalVariable(name: "self", arg: 1, scope: !252, file: !166, line: 2361, type: !255)
!258 = !DILocalVariable(name: "f", arg: 2, scope: !252, file: !166, line: 2361, type: !193)
!259 = !{!260}
!260 = !DITemplateTypeParameter(name: "T", type: !43)
!261 = !DILocation(line: 2361, column: 20, scope: !252)
!262 = !DILocation(line: 2361, column: 27, scope: !252)
!263 = !DILocation(line: 2361, column: 71, scope: !252)
!264 = !DILocation(line: 2361, column: 62, scope: !252)
!265 = !DILocation(line: 2361, column: 84, scope: !252)
!266 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17hb4f40a80bbea8daaE", scope: !267, file: !166, line: 2586, type: !268, scopeLine: 2586, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !270)
!267 = !DINamespace(name: "{impl#26}", scope: !57)
!268 = !DISubroutineType(types: !269)
!269 = !{!170, !188, !193}
!270 = !{!271, !272}
!271 = !DILocalVariable(name: "self", arg: 1, scope: !266, file: !166, line: 2586, type: !188)
!272 = !DILocalVariable(name: "f", arg: 2, scope: !266, file: !166, line: 2586, type: !193)
!273 = !DILocation(line: 2586, column: 12, scope: !266)
!274 = !DILocation(line: 2586, column: 19, scope: !266)
!275 = !DILocation(line: 2587, column: 9, scope: !266)
!276 = !DILocation(line: 2587, column: 32, scope: !266)
!277 = !DILocalVariable(name: "self", scope: !278, file: !166, line: 2587, type: !188, align: 8)
!278 = !DILexicalBlockFile(scope: !279, file: !166, discriminator: 0)
!279 = distinct !DISubprogram(name: "iter<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17h58df8dc009998f6bE", scope: !281, file: !280, line: 734, type: !283, scopeLine: 734, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !301)
!280 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7e4712ab5341970456c5be6b0829b712")
!281 = !DINamespace(name: "{impl#0}", scope: !282)
!282 = !DINamespace(name: "slice", scope: !58)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !188}
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<i32>", scope: !286, file: !2, size: 128, align: 64, elements: !287, templateParams: !232, identifier: "96f846a3802ea0a0ed3707bd3e3e325d")
!286 = !DINamespace(name: "iter", scope: !282)
!287 = !{!288, !295, !296}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !285, file: !2, baseType: !289, size: 64, align: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<i32>", scope: !290, file: !2, size: 64, align: 64, elements: !292, templateParams: !232, identifier: "aa602cb571ba548f8a76bb877f42f41a")
!290 = !DINamespace(name: "non_null", scope: !291)
!291 = !DINamespace(name: "ptr", scope: !58)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !289, file: !2, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !285, file: !2, baseType: !294, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !285, file: !2, baseType: !297, align: 8)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&i32>", scope: !298, file: !2, align: 8, elements: !23, templateParams: !299, identifier: "9ba0fcf44e40729d0e472435eb55ec0")
!298 = !DINamespace(name: "marker", scope: !58)
!299 = !{!300}
!300 = !DITemplateTypeParameter(name: "T", type: !32)
!301 = !{!277}
!302 = !DILocation(line: 2587, column: 32, scope: !278, inlinedAt: !276)
!303 = !DILocation(line: 2588, column: 6, scope: !266)
!304 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h8d9ad18844052bd5E", scope: !306, file: !305, line: 185, type: !308, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !310)
!305 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!306 = !DINamespace(name: "{impl#80}", scope: !307)
!307 = !DINamespace(name: "num", scope: !57)
!308 = !DISubroutineType(types: !309)
!309 = !{!170, !32, !193}
!310 = !{!311, !312}
!311 = !DILocalVariable(name: "self", arg: 1, scope: !304, file: !305, line: 185, type: !32)
!312 = !DILocalVariable(name: "f", arg: 2, scope: !304, file: !305, line: 185, type: !193)
!313 = !DILocation(line: 185, column: 20, scope: !304)
!314 = !DILocation(line: 185, column: 27, scope: !304)
!315 = !DILocation(line: 186, column: 20, scope: !304)
!316 = !DILocation(line: 188, column: 27, scope: !304)
!317 = !DILocation(line: 187, column: 21, scope: !304)
!318 = !DILocation(line: 186, column: 17, scope: !304)
!319 = !DILocation(line: 193, column: 14, scope: !304)
!320 = !{i8 0, i8 2}
!321 = !DILocation(line: 191, column: 21, scope: !304)
!322 = !DILocation(line: 189, column: 21, scope: !304)
!323 = !DILocation(line: 188, column: 24, scope: !304)
!324 = distinct !DISubprogram(name: "entries<&i32, core::slice::iter::Iter<i32>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h812917931c866002E", scope: !326, file: !325, line: 637, type: !336, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !346, retainedNodes: !339)
!325 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e84d8f928a38ea86b324aa7d6aa80df8")
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !327, file: !2, size: 128, align: 64, elements: !328, templateParams: !23, identifier: "ae111038d86e71a88d7f5c91efdbb7c8")
!327 = !DINamespace(name: "builders", scope: !57)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !326, file: !2, baseType: !330, size: 128, align: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !327, file: !2, size: 128, align: 64, elements: !331, templateParams: !23, identifier: "a1aef014c36393c5f380a5492df722f1")
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !330, file: !2, baseType: !193, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !330, file: !2, baseType: !170, size: 8, align: 8, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !330, file: !2, baseType: !335, size: 8, align: 8, offset: 72)
!335 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !338, !285}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !{!340, !341, !342, !344}
!340 = !DILocalVariable(name: "self", arg: 1, scope: !324, file: !325, line: 637, type: !338)
!341 = !DILocalVariable(name: "entries", arg: 2, scope: !324, file: !325, line: 637, type: !285)
!342 = !DILocalVariable(name: "iter", scope: !343, file: !325, line: 642, type: !285, align: 8)
!343 = distinct !DILexicalBlock(scope: !324, file: !325, line: 642, column: 9)
!344 = !DILocalVariable(name: "entry", scope: !345, file: !325, line: 642, type: !32, align: 8)
!345 = distinct !DILexicalBlock(scope: !343, file: !325, line: 642, column: 30)
!346 = !{!347, !348}
!347 = !DITemplateTypeParameter(name: "D", type: !32)
!348 = !DITemplateTypeParameter(name: "I", type: !285)
!349 = !DILocation(line: 637, column: 26, scope: !324)
!350 = !DILocation(line: 637, column: 37, scope: !324)
!351 = !DILocation(line: 642, column: 22, scope: !343)
!352 = !DILocation(line: 642, column: 13, scope: !345)
!353 = !DILocation(line: 642, column: 22, scope: !324)
!354 = !DILocation(line: 642, column: 9, scope: !343)
!355 = !DILocation(line: 642, column: 9, scope: !324)
!356 = !DILocation(line: 642, column: 13, scope: !343)
!357 = !DILocation(line: 643, column: 24, scope: !345)
!358 = !DILocation(line: 643, column: 13, scope: !345)
!359 = !DILocation(line: 644, column: 9, scope: !343)
!360 = !DILocation(line: 637, column: 5, scope: !324)
!361 = !DILocation(line: 646, column: 6, scope: !324)
!362 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117hdb9a40b0a66fa608E", scope: !363, file: !166, line: 390, type: !437, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !23, retainedNodes: !439)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !57, file: !2, size: 384, align: 64, elements: !364, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!364 = !{!365, !376, !421}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !363, file: !2, baseType: !366, size: 128, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !367, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!367 = !{!368, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !366, file: !2, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64, dwarfAddressSpace: 0)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !371, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!371 = !{!372, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !370, file: !2, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !370, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !366, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !363, file: !2, baseType: !377, size: 128, align: 64, offset: 128)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !203, file: !2, size: 128, align: 64, elements: !378, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!378 = !{!379}
!379 = !DICompositeType(tag: DW_TAG_variant_part, scope: !377, file: !2, size: 128, align: 64, elements: !380, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !420)
!380 = !{!381, !416}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !379, file: !2, baseType: !382, size: 128, align: 64, extraData: i64 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !377, file: !2, size: 128, align: 64, elements: !23, templateParams: !383, identifier: "742dbe7e160661d8ca36fcfff2574850")
!383 = !{!384}
!384 = !DITemplateTypeParameter(name: "T", type: !385)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !386, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!386 = !{!387, !415}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !385, file: !2, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64, dwarfAddressSpace: 0)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !55, file: !2, size: 448, align: 64, elements: !390, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !389, file: !2, baseType: !9, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !389, file: !2, baseType: !393, size: 384, align: 64, offset: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !55, file: !2, size: 384, align: 64, elements: !394, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!394 = !{!395, !396, !397, !398, !414}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !393, file: !2, baseType: !199, size: 32, align: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !393, file: !2, baseType: !54, size: 8, align: 8, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !2, baseType: !197, size: 32, align: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !393, file: !2, baseType: !399, size: 128, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !55, file: !2, size: 128, align: 64, elements: !400, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!400 = !{!401}
!401 = !DICompositeType(tag: DW_TAG_variant_part, scope: !399, file: !2, size: 128, align: 64, elements: !402, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !413)
!402 = !{!403, !407, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !401, file: !2, baseType: !404, size: 128, align: 64, extraData: i64 0)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !399, file: !2, size: 128, align: 64, elements: !405, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !404, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !401, file: !2, baseType: !408, size: 128, align: 64, extraData: i64 1)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !399, file: !2, size: 128, align: 64, elements: !409, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !408, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !401, file: !2, baseType: !412, size: 128, align: 64, extraData: i64 2)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !399, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !399, file: !2, baseType: !216, size: 64, align: 64, flags: DIFlagArtificial)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !393, file: !2, baseType: !399, size: 128, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !385, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !379, file: !2, baseType: !417, size: 128, align: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !377, file: !2, size: 128, align: 64, elements: !418, templateParams: !383, identifier: "17f2fc106094349c7673abca4839c97a")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !417, file: !2, baseType: !385, size: 128, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !2, baseType: !216, size: 64, align: 64, flags: DIFlagArtificial)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !363, file: !2, baseType: !422, size: 128, align: 64, offset: 256)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !423, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!423 = !{!424, !436}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !422, file: !2, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64, dwarfAddressSpace: 0)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !57, file: !2, size: 128, align: 64, elements: !427, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!427 = !{!428, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !426, file: !2, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !430, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !431, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!431 = !DINamespace(name: "{extern#0}", scope: !57)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !426, file: !2, baseType: !433, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !434, size: 64, align: 64, dwarfAddressSpace: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!170, !429, !193}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !422, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!363, !366, !422}
!439 = !{!440, !441}
!440 = !DILocalVariable(name: "pieces", arg: 1, scope: !362, file: !166, line: 390, type: !366)
!441 = !DILocalVariable(name: "args", arg: 2, scope: !362, file: !166, line: 390, type: !422)
!442 = !DILocation(line: 390, column: 25, scope: !362)
!443 = !DILocation(line: 390, column: 53, scope: !362)
!444 = !DILocation(line: 391, column: 12, scope: !362)
!445 = !DILocation(line: 391, column: 56, scope: !362)
!446 = !DILocation(line: 391, column: 41, scope: !362)
!447 = !DILocation(line: 394, column: 34, scope: !362)
!448 = !DILocation(line: 394, column: 9, scope: !362)
!449 = !DILocation(line: 395, column: 6, scope: !362)
!450 = !DILocation(line: 392, column: 13, scope: !362)
!451 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hc661d0924d16ee4bE", scope: !453, file: !452, line: 248, type: !456, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !462, retainedNodes: !459)
!452 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!453 = !DINamespace(name: "FnOnce", scope: !454)
!454 = !DINamespace(name: "function", scope: !455)
!455 = !DINamespace(name: "ops", scope: !58)
!456 = !DISubroutineType(types: !457)
!457 = !{!33, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!459 = !{!460, !461}
!460 = !DILocalVariable(arg: 1, scope: !451, file: !452, line: 248, type: !458)
!461 = !DILocalVariable(arg: 2, scope: !451, file: !452, line: 248, type: !7)
!462 = !{!463, !464}
!463 = !DITemplateTypeParameter(name: "Self", type: !14)
!464 = !DITemplateTypeParameter(name: "Args", type: !7)
!465 = !DILocation(line: 248, column: 5, scope: !451)
!466 = distinct !DISubprogram(name: "call_once<union_tests::test_unions::test_buffer::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h2b0199b811320f1fE", scope: !453, file: !452, line: 248, type: !467, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !476, retainedNodes: !473)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !470, file: !2, align: 8, elements: !23, identifier: "7505866048771eb042cd553142cda33e")
!470 = !DINamespace(name: "test_buffer", scope: !471)
!471 = !DINamespace(name: "test_unions", scope: !472)
!472 = !DINamespace(name: "union_tests", scope: null)
!473 = !{!474, !475}
!474 = !DILocalVariable(arg: 1, scope: !466, file: !452, line: 248, type: !469)
!475 = !DILocalVariable(arg: 2, scope: !466, file: !452, line: 248, type: !7)
!476 = !{!477, !464}
!477 = !DITemplateTypeParameter(name: "Self", type: !469)
!478 = !DILocation(line: 248, column: 5, scope: !466)
!479 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5db0a789075783d0E", scope: !453, file: !452, line: 248, type: !480, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !462, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!33, !14}
!482 = !{!483, !484}
!483 = !DILocalVariable(arg: 1, scope: !479, file: !452, line: 248, type: !14)
!484 = !DILocalVariable(arg: 2, scope: !479, file: !452, line: 248, type: !7)
!485 = !DILocation(line: 248, column: 5, scope: !479)
!486 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hec62391b1c7e3c8cE", scope: !453, file: !452, line: 248, type: !76, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !490, retainedNodes: !487)
!487 = !{!488, !489}
!488 = !DILocalVariable(arg: 1, scope: !486, file: !452, line: 248, type: !20)
!489 = !DILocalVariable(arg: 2, scope: !486, file: !452, line: 248, type: !7)
!490 = !{!491, !464}
!491 = !DITemplateTypeParameter(name: "Self", type: !20)
!492 = !DILocation(line: 248, column: 5, scope: !486)
!493 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17ha0b46abc4944fad7E", scope: !291, file: !494, line: 487, type: !495, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !299, retainedNodes: !498)
!494 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !{!499}
!499 = !DILocalVariable(arg: 1, scope: !493, file: !494, line: 487, type: !497)
!500 = !DILocation(line: 487, column: 1, scope: !493)
!501 = distinct !DISubprogram(name: "drop_in_place<&[i32; 19]>", linkageName: "_ZN4core3ptr50drop_in_place$LT$$RF$$u5b$i32$u3b$$u20$19$u5d$$GT$17he61e6ce11f2fbdeeE", scope: !291, file: !494, line: 487, type: !502, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !507, retainedNodes: !505)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &[i32; 19]", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!505 = !{!506}
!506 = !DILocalVariable(arg: 1, scope: !501, file: !494, line: 487, type: !504)
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "T", type: !42)
!509 = !DILocation(line: 487, column: 1, scope: !501)
!510 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h848523885de7d08aE", scope: !291, file: !494, line: 487, type: !511, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !515, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !458}
!513 = !{!514}
!514 = !DILocalVariable(arg: 1, scope: !510, file: !494, line: 487, type: !458)
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "T", type: !14)
!517 = !DILocation(line: 487, column: 1, scope: !510)
!518 = distinct !DISubprogram(name: "fmt<i32, 19>", linkageName: "_ZN4core5array69_$LT$impl$u20$core..fmt..Debug$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$3fmt17he94af7a7a3eefe3fE", scope: !520, file: !519, line: 251, type: !522, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !524)
!519 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "e237aff39bff30ac55984ee183267020")
!520 = !DINamespace(name: "{impl#12}", scope: !521)
!521 = !DINamespace(name: "array", scope: !58)
!522 = !DISubroutineType(types: !523)
!523 = !{!170, !42, !193}
!524 = !{!525, !526}
!525 = !DILocalVariable(name: "self", arg: 1, scope: !518, file: !519, line: 251, type: !42)
!526 = !DILocalVariable(name: "f", arg: 2, scope: !518, file: !519, line: 251, type: !193)
!527 = !DILocation(line: 251, column: 12, scope: !518)
!528 = !DILocation(line: 251, column: 19, scope: !518)
!529 = !DILocalVariable(name: "index", scope: !530, file: !519, line: 252, type: !534, align: 1)
!530 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull, 19>", linkageName: "_ZN4core5array85_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u3b$$u20$N$u5d$$GT$5index17h47279e39e1f0c1e0E", scope: !531, file: !519, line: 285, type: !532, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !546, retainedNodes: !544)
!531 = !DINamespace(name: "{impl#15}", scope: !521)
!532 = !DISubroutineType(types: !533)
!533 = !{!188, !42, !534, !536}
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !535, file: !2, align: 8, elements: !23, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!535 = !DINamespace(name: "range", scope: !455)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !538, file: !2, size: 192, align: 64, elements: !540, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!538 = !DINamespace(name: "location", scope: !539)
!539 = !DINamespace(name: "panic", scope: !58)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !537, file: !2, baseType: !370, size: 128, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !537, file: !2, baseType: !197, size: 32, align: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !537, file: !2, baseType: !197, size: 32, align: 32, offset: 160)
!544 = !{!545, !529}
!545 = !DILocalVariable(name: "self", scope: !530, file: !519, line: 252, type: !42, align: 8)
!546 = !{!233, !547}
!547 = !DITemplateTypeParameter(name: "I", type: !534)
!548 = !DILocation(line: 252, column: 27, scope: !530, inlinedAt: !549)
!549 = !DILocation(line: 252, column: 27, scope: !518)
!550 = !DILocalVariable(name: "index", scope: !551, file: !519, line: 252, type: !534, align: 1)
!551 = !DILexicalBlockFile(scope: !552, file: !519, discriminator: 0)
!552 = distinct !DISubprogram(name: "index<i32, core::ops::range::RangeFull>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17hc8cc303e982f4106E", scope: !554, file: !553, line: 17, type: !556, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !546, retainedNodes: !558)
!553 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!554 = !DINamespace(name: "{impl#0}", scope: !555)
!555 = !DINamespace(name: "index", scope: !282)
!556 = !DISubroutineType(types: !557)
!557 = !{!188, !188, !534, !536}
!558 = !{!559, !550}
!559 = !DILocalVariable(name: "self", scope: !551, file: !519, line: 252, type: !188, align: 8)
!560 = !DILocation(line: 252, column: 27, scope: !551, inlinedAt: !561)
!561 = !DILocation(line: 286, column: 9, scope: !530, inlinedAt: !549)
!562 = !DILocalVariable(name: "self", scope: !563, file: !519, line: 252, type: !534, align: 1)
!563 = !DILexicalBlockFile(scope: !564, file: !519, discriminator: 0)
!564 = distinct !DISubprogram(name: "index<i32>", linkageName: "_ZN97_$LT$core..ops..range..RangeFull$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17he84dd9ebf0b568b4E", scope: !565, file: !553, line: 432, type: !566, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !568)
!565 = !DINamespace(name: "{impl#6}", scope: !555)
!566 = !DISubroutineType(types: !567)
!567 = !{!188, !534, !188, !536}
!568 = !{!562, !569}
!569 = !DILocalVariable(name: "slice", scope: !563, file: !519, line: 252, type: !188, align: 8)
!570 = !DILocation(line: 252, column: 27, scope: !563, inlinedAt: !571)
!571 = !DILocation(line: 18, column: 9, scope: !552, inlinedAt: !561)
!572 = !DILocation(line: 252, column: 26, scope: !518)
!573 = !DILocation(line: 252, column: 9, scope: !518)
!574 = !DILocation(line: 253, column: 6, scope: !518)
!575 = distinct !DISubprogram(name: "eq<i32, i32, 19>", linkageName: "_ZN4core5array8equality103_$LT$impl$u20$core..cmp..PartialEq$LT$$u5b$B$u3b$$u20$N$u5d$$GT$$u20$for$u20$$u5b$A$u3b$$u20$N$u5d$$GT$2eq17h26be36a8a3d4d0b3E", scope: !577, file: !576, line: 11, type: !579, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !584, retainedNodes: !581)
!576 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/array/equality.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b2a6ef978d2ec8f60a33a03ff9f5cb8")
!577 = !DINamespace(name: "{impl#0}", scope: !578)
!578 = !DINamespace(name: "equality", scope: !521)
!579 = !DISubroutineType(types: !580)
!580 = !{!335, !42, !42}
!581 = !{!582, !583}
!582 = !DILocalVariable(name: "self", arg: 1, scope: !575, file: !576, line: 11, type: !42)
!583 = !DILocalVariable(name: "other", arg: 2, scope: !575, file: !576, line: 11, type: !42)
!584 = !{!585, !586}
!585 = !DITemplateTypeParameter(name: "A", type: !33)
!586 = !DITemplateTypeParameter(name: "B", type: !33)
!587 = !DILocation(line: 11, column: 11, scope: !575)
!588 = !DILocation(line: 11, column: 18, scope: !575)
!589 = !DILocation(line: 12, column: 9, scope: !575)
!590 = !DILocation(line: 13, column: 6, scope: !575)
!591 = distinct !DISubprogram(name: "as_mut_ptr<i32>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h29cdbf8eb18690acE", scope: !281, file: !280, line: 506, type: !592, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !599)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i32]", file: !2, size: 128, align: 64, elements: !596, templateParams: !23, identifier: "e558f8cebf02444c46b3d01510c8747d")
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !595, file: !2, baseType: !191, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !595, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!599 = !{!600}
!600 = !DILocalVariable(name: "self", arg: 1, scope: !591, file: !280, line: 506, type: !595)
!601 = !DILocation(line: 506, column: 29, scope: !591)
!602 = !DILocation(line: 507, column: 9, scope: !591)
!603 = !DILocation(line: 508, column: 6, scope: !591)
!604 = distinct !DISubprogram(name: "new<i32>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17hcbcfa5c18b0350f3E", scope: !285, file: !605, line: 88, type: !283, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !606)
!605 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "36678af40fdc22d7150f6f91e11271b3")
!606 = !{!607, !608, !610}
!607 = !DILocalVariable(name: "slice", arg: 1, scope: !604, file: !605, line: 88, type: !188)
!608 = !DILocalVariable(name: "ptr", scope: !609, file: !605, line: 89, type: !294, align: 8)
!609 = distinct !DILexicalBlock(scope: !604, file: !605, line: 89, column: 9)
!610 = !DILocalVariable(name: "end", scope: !611, file: !605, line: 94, type: !294, align: 8)
!611 = distinct !DILexicalBlock(scope: !609, file: !605, line: 94, column: 13)
!612 = !DILocation(line: 88, column: 23, scope: !604)
!613 = !DILocation(line: 94, column: 17, scope: !611)
!614 = !DILocalVariable(name: "metadata", scope: !615, file: !605, line: 92, type: !7, align: 1)
!615 = !DILexicalBlockFile(scope: !616, file: !605, discriminator: 0)
!616 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h00dcbb6e4909f019E", scope: !618, file: !617, line: 110, type: !619, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !623, retainedNodes: !621)
!617 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!618 = !DINamespace(name: "metadata", scope: !291)
!619 = !DISubroutineType(types: !620)
!620 = !{!109, !6, !7}
!621 = !{!622, !614}
!622 = !DILocalVariable(name: "data_address", scope: !615, file: !605, line: 92, type: !6, align: 8)
!623 = !{!624}
!624 = !DITemplateTypeParameter(name: "T", type: !59)
!625 = !DILocation(line: 92, column: 21, scope: !615, inlinedAt: !626)
!626 = !DILocation(line: 513, column: 5, scope: !627, inlinedAt: !630)
!627 = distinct !DISubprogram(name: "null<u8>", linkageName: "_ZN4core3ptr4null17h67b9b6a364939c51E", scope: !291, file: !494, line: 512, type: !628, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !623, retainedNodes: !23)
!628 = !DISubroutineType(types: !629)
!629 = !{!109}
!630 = !DILocation(line: 39, column: 43, scope: !631, inlinedAt: !640)
!631 = distinct !DISubprogram(name: "is_null<i32>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$7is_null17h04bb10ae85a80bbfE", scope: !633, file: !632, line: 36, type: !635, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, templateParams: !232, retainedNodes: !637)
!632 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!633 = !DINamespace(name: "{impl#0}", scope: !634)
!634 = !DINamespace(name: "const_ptr", scope: !291)
!635 = !DISubroutineType(types: !636)
!636 = !{!335, !294}
!637 = !{!638}
!638 = !DILocalVariable(name: "self", scope: !639, file: !605, line: 92, type: !294, align: 8)
!639 = !DILexicalBlockFile(scope: !631, file: !605, discriminator: 0)
!640 = !DILocation(line: 92, column: 21, scope: !609)
!641 = !DILocation(line: 89, column: 19, scope: !604)
