; ModuleID = 'build_script_build.ee23358a-cgu.0'
source_filename = "build_script_build.ee23358a-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"cc::Build" = type { %"alloc::vec::Vec<alloc::sync::Arc<std::path::Path>>", %"alloc::vec::Vec<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)>", %"alloc::vec::Vec<alloc::sync::Arc<std::path::Path>>", %"alloc::vec::Vec<alloc::sync::Arc<std::ffi::os_str::OsStr>>", %"alloc::vec::Vec<alloc::sync::Arc<std::ffi::os_str::OsStr>>", %"alloc::vec::Vec<alloc::sync::Arc<std::ffi::os_str::OsStr>>", %"alloc::vec::Vec<alloc::sync::Arc<std::ffi::os_str::OsStr>>", %"alloc::vec::Vec<alloc::sync::Arc<std::path::Path>>", %"core::option::Option<core::option::Option<alloc::sync::Arc<str>>>", { i64*, i64 }, { i64*, i64 }, { i64*, i64 }, { i64*, i64 }, { i64*, i64 }, { i64*, i64 }, { i64*, i64 }, %"alloc::vec::Vec<(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>)>", { i64*, i64 }, { i64*, i64 }, { i64*, i64 }, %"cc::command_helpers::CargoOutput", %"alloc::vec::Vec<alloc::sync::Arc<std::ffi::os_str::OsStr>>", i64*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [6 x i8] }
%"alloc::vec::Vec<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)>" = type { { i64*, i64 }, i64 }
%"alloc::vec::Vec<alloc::sync::Arc<std::path::Path>>" = type { { i64*, i64 }, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !{i32 7, !"PIC Level", i32 2}
!25 = !{i32 7, !"PIE Level", i32 2}
!26 = !{i32 2, !"RtLibUseGOT", i32 1}
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !30, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, globals: !131)
!30 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_internal-0.2.2/build.rs/@/build_script_build.ee23358a-cgu.0", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_internal-0.2.2")
!31 = !{!32, !40, !52, !62}
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputKind", scope: !33, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !36)
!33 = !DINamespace(name: "command_helpers", scope: !34)
!34 = !DINamespace(name: "cc", scope: null)
!35 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "Forward", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "Discard", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Capture", value: 2, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !34, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!42 = !DIEnumerator(name: "IOError", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "EnvVarNotFound", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "ToolExecError", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "ToolNotFound", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "InvalidArgument", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "ToolFamilyMacroNotFound", value: 5, isUnsigned: true)
!48 = !DIEnumerator(name: "InvalidTarget", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "UnknownTarget", value: 7, isUnsigned: true)
!50 = !DIEnumerator(name: "InvalidFlag", value: 8, isUnsigned: true)
!51 = !DIEnumerator(name: "Disabled", value: 9, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !53, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagEnumClass, elements: !57)
!53 = !DINamespace(name: "v1", scope: !54)
!54 = !DINamespace(name: "rt", scope: !55)
!55 = !DINamespace(name: "fmt", scope: !56)
!56 = !DINamespace(name: "core", scope: null)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !63, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagEnumClass, elements: !66)
!63 = !DINamespace(name: "valid_align", scope: !64)
!64 = !DINamespace(name: "mem", scope: !56)
!65 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!67 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!83 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!84 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!85 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!86 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!87 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!88 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!89 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!90 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!91 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!92 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!93 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!94 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!95 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!96 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!97 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!98 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!99 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!100 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!101 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!102 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!103 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!104 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!105 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!106 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!107 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!108 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!109 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!110 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!111 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!112 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!113 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!114 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!115 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!116 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!131 = !{!0}
!132 = distinct !DISubprogram(name: "file<&str>", linkageName: "_ZN2cc5Build4file17h497e9f2de3ce65a2E", scope: !134, file: !133, line: 760, type: !954, scopeLine: 760, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, templateParams: !960, retainedNodes: !957)
!133 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/cc-1.2.32/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "0803c396dfce686183b53e83f8466353")
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Build", scope: !34, file: !2, size: 3776, align: 64, elements: !135, templateParams: !23, identifier: "5779ebb8036c1002d9b8e150a081e296")
!135 = !{!136, !217, !279, !280, !324, !325, !326, !327, !329, !330, !331, !345, !346, !347, !348, !349, !350, !351, !352, !353, !365, !366, !380, !381, !407, !408, !409, !410, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !953}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "include_directories", scope: !134, file: !2, baseType: !137, size: 192, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<std::path::Path>, alloc::alloc::Global>", scope: !138, file: !2, size: 192, align: 64, elements: !140, templateParams: !214, identifier: "99846e8cd4ba742d6da0b5d592fb2722")
!138 = !DINamespace(name: "vec", scope: !139)
!139 = !DINamespace(name: "alloc", scope: null)
!140 = !{!141, !216}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !137, file: !2, baseType: !142, size: 128, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<std::path::Path>, alloc::alloc::Global>", scope: !143, file: !2, size: 128, align: 64, elements: !144, templateParams: !214, identifier: "c2da383affd6196065c1183d0cbfecfc")
!143 = !DINamespace(name: "raw_vec", scope: !139)
!144 = !{!145, !210, !211}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !142, file: !2, baseType: !146, size: 64, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::sync::Arc<std::path::Path>>", scope: !147, file: !2, size: 64, align: 64, elements: !149, templateParams: !206, identifier: "9d3a872488565ab9d0ae4b68dbc67fd5")
!147 = !DINamespace(name: "unique", scope: !148)
!148 = !DINamespace(name: "ptr", scope: !56)
!149 = !{!150, !208}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !146, file: !2, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::Arc<std::path::Path>>", scope: !152, file: !2, size: 64, align: 64, elements: !153, templateParams: !206, identifier: "870dbb52d39f6aba65c30ac7f3146abc")
!152 = !DINamespace(name: "non_null", scope: !148)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !151, file: !2, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::Arc<std::path::Path>", baseType: !156, size: 64, align: 64, dwarfAddressSpace: 0)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::path::Path>", scope: !157, file: !2, size: 128, align: 64, elements: !158, templateParams: !198, identifier: "ddd911dfacfd1e28c8b4f68a9a9ca967")
!157 = !DINamespace(name: "sync", scope: !139)
!158 = !{!159, !203}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !156, file: !2, baseType: !160, size: 128, align: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::path::Path>>", scope: !152, file: !2, size: 128, align: 64, elements: !161, templateParams: !201, identifier: "a00a706360b5820bc23c27c5f16ac85")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !160, file: !2, baseType: !163, size: 128, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<std::path::Path>", file: !2, size: 128, align: 64, elements: !164, templateParams: !23, identifier: "4cc6c553b60bc39ff321f865e6751a10")
!164 = !{!165, !200}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !163, file: !2, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::path::Path>", scope: !157, file: !2, size: 128, align: 64, elements: !168, templateParams: !198, identifier: "9b17d872d1c10d8e25b456f1acc9300b")
!168 = !{!169, !181, !182}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !167, file: !2, baseType: !170, size: 64, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !171, file: !2, size: 64, align: 64, elements: !173, templateParams: !23, identifier: "7ffec6c78d83ad83b9e8e18b9f044e78")
!171 = !DINamespace(name: "atomic", scope: !172)
!172 = !DINamespace(name: "sync", scope: !56)
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !170, file: !2, baseType: !175, size: 64, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !176, file: !2, size: 64, align: 64, elements: !177, templateParams: !179, identifier: "1096bf4d22c004093180ac32ada74dc8")
!176 = !DINamespace(name: "cell", scope: !56)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !175, file: !2, baseType: !9, size: 64, align: 64)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !9)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !167, file: !2, baseType: !170, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !2, baseType: !183, align: 8, offset: 128)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Path", scope: !184, file: !2, align: 8, elements: !185, templateParams: !23, identifier: "e0a341fca0327603cd29dd2bb88eafab")
!184 = !DINamespace(name: "path", scope: !17)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !183, file: !2, baseType: !187, align: 8)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsStr", scope: !188, file: !2, align: 8, elements: !190, templateParams: !23, identifier: "d7ab7c08a026e413156c261f0070868e")
!188 = !DINamespace(name: "os_str", scope: !189)
!189 = !DINamespace(name: "ffi", scope: !17)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !187, file: !2, baseType: !192, align: 8)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slice", scope: !193, file: !2, align: 8, elements: !196, templateParams: !23, identifier: "ba965fbd54122a7c6da1f1397881640d")
!193 = !DINamespace(name: "os_str", scope: !194)
!194 = !DINamespace(name: "unix", scope: !195)
!195 = !DINamespace(name: "sys", scope: !17)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !192, file: !2, baseType: !35, align: 8)
!198 = !{!199}
!199 = !DITemplateTypeParameter(name: "T", type: !183)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !163, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!201 = !{!202}
!202 = !DITemplateTypeParameter(name: "T", type: !167)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !156, file: !2, baseType: !204, align: 8)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::path::Path>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !201, identifier: "81e08cee7b081545daf899f376d69bd")
!205 = !DINamespace(name: "marker", scope: !56)
!206 = !{!207}
!207 = !DITemplateTypeParameter(name: "T", type: !156)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !146, file: !2, baseType: !209, align: 8)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<std::path::Path>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !206, identifier: "efa327bd80bad4ebc39eb41e38b24a76")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !142, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !142, file: !2, baseType: !212, align: 8)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !213, file: !2, align: 8, elements: !23, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!213 = !DINamespace(name: "alloc", scope: !139)
!214 = !{!207, !215}
!215 = !DITemplateTypeParameter(name: "A", type: !212)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !137, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "definitions", scope: !134, file: !2, baseType: !218, size: 192, align: 64, offset: 192)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>), alloc::alloc::Global>", scope: !138, file: !2, size: 192, align: 64, elements: !219, templateParams: !277, identifier: "833a2e6d35cbc873bef070e83e89686c")
!219 = !{!220, !278}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !218, file: !2, baseType: !221, size: 128, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>), alloc::alloc::Global>", scope: !143, file: !2, size: 128, align: 64, elements: !222, templateParams: !277, identifier: "a3c282dd26107f3c69087930434b712d")
!222 = !{!223, !275, !276}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !221, file: !2, baseType: !224, size: 64, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)>", scope: !147, file: !2, size: 64, align: 64, elements: !225, templateParams: !271, identifier: "10726597a7ac3e169d0aad4fd76c8ccf")
!225 = !{!226, !273}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !224, file: !2, baseType: !227, size: 64, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)>", scope: !152, file: !2, size: 64, align: 64, elements: !228, templateParams: !271, identifier: "a63a1c98082a291b968f435c33d262f5")
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !227, file: !2, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const (alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)", baseType: !231, size: 64, align: 64, dwarfAddressSpace: 0)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)", file: !2, size: 256, align: 64, elements: !232, templateParams: !23, identifier: "d3ec9d6ffc15eeeaea2eb885a5fc7bd5")
!232 = !{!233, !256}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !231, file: !2, baseType: !234, size: 128, align: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<str>", scope: !157, file: !2, size: 128, align: 64, elements: !235, templateParams: !249, identifier: "721297c9e2bd1a6216cf78ec7de6a3f3")
!235 = !{!236, !254}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !234, file: !2, baseType: !237, size: 128, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<str>>", scope: !152, file: !2, size: 128, align: 64, elements: !238, templateParams: !252, identifier: "4493b9fa76b85d22170948aabdd36a31")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !237, file: !2, baseType: !240, size: 128, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<str>", file: !2, size: 128, align: 64, elements: !241, templateParams: !23, identifier: "84e52acd8898b8b28694142510b05989")
!241 = !{!242, !251}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !240, file: !2, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<str>", scope: !157, file: !2, size: 128, align: 64, elements: !245, templateParams: !249, identifier: "453f263c8a11da141f04a8507fe05adc")
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !244, file: !2, baseType: !170, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !244, file: !2, baseType: !170, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !2, baseType: !35, align: 8, offset: 128)
!249 = !{!250}
!250 = !DITemplateTypeParameter(name: "T", type: !35)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !240, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!252 = !{!253}
!253 = !DITemplateTypeParameter(name: "T", type: !244)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !234, file: !2, baseType: !255, align: 8)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<str>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !252, identifier: "4897c8edeed1e94b5b799dcda8322450")
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !231, file: !2, baseType: !257, size: 128, align: 64, offset: 128)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<str>>", scope: !258, file: !2, size: 128, align: 64, elements: !259, templateParams: !23, identifier: "98122a0830465c54621efd067d3ea524")
!258 = !DINamespace(name: "option", scope: !56)
!259 = !{!260}
!260 = !DICompositeType(tag: DW_TAG_variant_part, scope: !257, file: !2, size: 128, align: 64, elements: !261, templateParams: !23, identifier: "3ae80cd7b301dc2d8b9ea32e4e8221b0", discriminator: !270)
!261 = !{!262, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !260, file: !2, baseType: !263, size: 128, align: 64, extraData: i64 0)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !257, file: !2, size: 128, align: 64, elements: !23, templateParams: !264, identifier: "40b4cd3173dd6424ffb8ae17813cef2c")
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !234)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !260, file: !2, baseType: !267, size: 128, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !257, file: !2, size: 128, align: 64, elements: !268, templateParams: !264, identifier: "537fe5e7c13decdce7118e11f0e1fc9")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !267, file: !2, baseType: !234, size: 128, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagArtificial)
!271 = !{!272}
!272 = !DITemplateTypeParameter(name: "T", type: !231)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !224, file: !2, baseType: !274, align: 8)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::sync::Arc<str>, core::option::Option<alloc::sync::Arc<str>>)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !271, identifier: "b2d3726f86b0888a55de4bfd4ff8913c")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !221, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !221, file: !2, baseType: !212, align: 8)
!277 = !{!272, !215}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !134, file: !2, baseType: !137, size: 192, align: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !2, baseType: !281, size: 192, align: 64, offset: 576)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::alloc::Global>", scope: !138, file: !2, size: 192, align: 64, elements: !282, templateParams: !322, identifier: "cea3894fa06a90122d82dfaf9eeaa092")
!282 = !{!283, !323}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !281, file: !2, baseType: !284, size: 128, align: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::alloc::Global>", scope: !143, file: !2, size: 128, align: 64, elements: !285, templateParams: !322, identifier: "44344b968d40292b956c0e27d9807960")
!285 = !{!286, !320, !321}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !284, file: !2, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::sync::Arc<std::ffi::os_str::OsStr>>", scope: !147, file: !2, size: 64, align: 64, elements: !288, templateParams: !316, identifier: "a69aed671132ac8b5d3cfef3e1232c22")
!288 = !{!289, !318}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !287, file: !2, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::Arc<std::ffi::os_str::OsStr>>", scope: !152, file: !2, size: 64, align: 64, elements: !291, templateParams: !316, identifier: "8aa09051c17f6691183fe3dce6c7f983")
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !290, file: !2, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::Arc<std::ffi::os_str::OsStr>", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::ffi::os_str::OsStr>", scope: !157, file: !2, size: 128, align: 64, elements: !295, templateParams: !309, identifier: "d191ee781570ebb268dbbb92e30aada5")
!295 = !{!296, !314}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !294, file: !2, baseType: !297, size: 128, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>", scope: !152, file: !2, size: 128, align: 64, elements: !298, templateParams: !312, identifier: "55a5b2cf1516c6ce303a8f8eb8f33db2")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !297, file: !2, baseType: !300, size: 128, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<std::ffi::os_str::OsStr>", file: !2, size: 128, align: 64, elements: !301, templateParams: !23, identifier: "fcf17b57840082f1a11e4d70e168b5ff")
!301 = !{!302, !311}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !300, file: !2, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64, dwarfAddressSpace: 0)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::ffi::os_str::OsStr>", scope: !157, file: !2, size: 128, align: 64, elements: !305, templateParams: !309, identifier: "be1449d85afd74957ee2095a2784f516")
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !304, file: !2, baseType: !170, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !304, file: !2, baseType: !170, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !2, baseType: !187, align: 8, offset: 128)
!309 = !{!310}
!310 = !DITemplateTypeParameter(name: "T", type: !187)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !300, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "T", type: !304)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !294, file: !2, baseType: !315, align: 8)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !312, identifier: "a8449b25ecffb33077c89aeedc574b5")
!316 = !{!317}
!317 = !DITemplateTypeParameter(name: "T", type: !294)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !287, file: !2, baseType: !319, align: 8)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<std::ffi::os_str::OsStr>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !316, identifier: "207c91691b5e472073fec2e744909c33")
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !284, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !284, file: !2, baseType: !212, align: 8)
!322 = !{!317, !215}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !281, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags_supported", scope: !134, file: !2, baseType: !281, size: 192, align: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ar_flags", scope: !134, file: !2, baseType: !281, size: 192, align: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "asm_flags", scope: !134, file: !2, baseType: !281, size: 192, align: 64, offset: 1152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "no_default_flags", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3584)
!328 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !134, file: !2, baseType: !137, size: 192, align: 64, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3592)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_link_stdlib", scope: !134, file: !2, baseType: !332, size: 192, align: 64, offset: 1536)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::option::Option<alloc::sync::Arc<str>>>", scope: !258, file: !2, size: 192, align: 64, elements: !333, templateParams: !23, identifier: "92a81958de945cbc1489f8b846f05fa8")
!333 = !{!334}
!334 = !DICompositeType(tag: DW_TAG_variant_part, scope: !332, file: !2, size: 192, align: 64, elements: !335, templateParams: !23, identifier: "efcf30d298f987f8a7400daee6c957ff", discriminator: !344)
!335 = !{!336, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !334, file: !2, baseType: !337, size: 192, align: 64, extraData: i64 0)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !332, file: !2, size: 192, align: 64, elements: !23, templateParams: !338, identifier: "bcfa2bc089f5985499aceebd9569b839")
!338 = !{!339}
!339 = !DITemplateTypeParameter(name: "T", type: !257)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !334, file: !2, baseType: !341, size: 192, align: 64, extraData: i64 1)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !332, file: !2, size: 192, align: 64, elements: !342, templateParams: !338, identifier: "2aecb0a76feab7d42dc89bb0f85315c7")
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !341, file: !2, baseType: !257, size: 128, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !332, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagArtificial)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_link_stdlib_static", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3600)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_set_stdlib", scope: !134, file: !2, baseType: !257, size: 128, align: 64, offset: 1728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cuda", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3608)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cudart", scope: !134, file: !2, baseType: !257, size: 128, align: 64, offset: 1856)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ccbin", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3616)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !134, file: !2, baseType: !257, size: 128, align: 64, offset: 1984)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !134, file: !2, baseType: !257, size: 128, align: 64, offset: 2112)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !134, file: !2, baseType: !257, size: 128, align: 64, offset: 2240)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "out_dir", scope: !134, file: !2, baseType: !354, size: 128, align: 64, offset: 2368)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::path::Path>>", scope: !258, file: !2, size: 128, align: 64, elements: !355, templateParams: !23, identifier: "591415a14b68ec243d202789d00abcaf")
!355 = !{!356}
!356 = !DICompositeType(tag: DW_TAG_variant_part, scope: !354, file: !2, size: 128, align: 64, elements: !357, templateParams: !23, identifier: "3e01f0ce458bee1f7807d2467f0919a7", discriminator: !364)
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !356, file: !2, baseType: !359, size: 128, align: 64, extraData: i64 0)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !354, file: !2, size: 128, align: 64, elements: !23, templateParams: !206, identifier: "bad402909da8af4bdf4fe6d3a2931ea8")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !356, file: !2, baseType: !361, size: 128, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !354, file: !2, size: 128, align: 64, elements: !362, templateParams: !206, identifier: "d5cbb4ba71bce31e394692c79265353")
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !361, file: !2, baseType: !156, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, scope: !354, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagArtificial)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "opt_level", scope: !134, file: !2, baseType: !257, size: 128, align: 64, offset: 2496)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3624)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bool>", scope: !258, file: !2, size: 8, align: 8, elements: !368, templateParams: !23, identifier: "8ca893378d8176ad7ee1a8a3e1f576f9")
!368 = !{!369}
!369 = !DICompositeType(tag: DW_TAG_variant_part, scope: !367, file: !2, size: 8, align: 8, elements: !370, templateParams: !23, identifier: "da5019aea4d8b18d701bdab161ae49b0", discriminator: !379)
!370 = !{!371, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !369, file: !2, baseType: !372, size: 8, align: 8, extraData: i64 2)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !367, file: !2, size: 8, align: 8, elements: !23, templateParams: !373, identifier: "626b2df65f039b34774ca0e29a769720")
!373 = !{!374}
!374 = !DITemplateTypeParameter(name: "T", type: !328)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !369, file: !2, baseType: !376, size: 8, align: 8)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !367, file: !2, size: 8, align: 8, elements: !377, templateParams: !373, identifier: "1c261429ee6e77dd7f4eb04dd3ea241d")
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !376, file: !2, baseType: !328, size: 8, align: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !367, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagArtificial)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "force_frame_pointer", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3632)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !134, file: !2, baseType: !382, size: 192, align: 64, offset: 2624)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>), alloc::alloc::Global>", scope: !138, file: !2, size: 192, align: 64, elements: !383, templateParams: !405, identifier: "4eba910167facbf58981d8a585a2240f")
!383 = !{!384, !406}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !382, file: !2, baseType: !385, size: 128, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>), alloc::alloc::Global>", scope: !143, file: !2, size: 128, align: 64, elements: !386, templateParams: !405, identifier: "8761fc4abcce672c92ac7bac56c607ce")
!386 = !{!387, !403, !404}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !385, file: !2, baseType: !388, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>)>", scope: !147, file: !2, size: 64, align: 64, elements: !389, templateParams: !399, identifier: "26a53db521d85b03e4118374e07d7de")
!389 = !{!390, !401}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !388, file: !2, baseType: !391, size: 64, align: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>)>", scope: !152, file: !2, size: 64, align: 64, elements: !392, templateParams: !399, identifier: "e9f52887aa990167b621aa1c9a1955ff")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !391, file: !2, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const (alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>)", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>)", file: !2, size: 256, align: 64, elements: !396, templateParams: !23, identifier: "b9d125e030788aaea96b384482ba6247")
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !395, file: !2, baseType: !294, size: 128, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !395, file: !2, baseType: !294, size: 128, align: 64, offset: 128)
!399 = !{!400}
!400 = !DITemplateTypeParameter(name: "T", type: !395)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !388, file: !2, baseType: !402, align: 8)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::sync::Arc<std::ffi::os_str::OsStr>, alloc::sync::Arc<std::ffi::os_str::OsStr>)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !399, identifier: "578ab9dc3c0b3fe58e837a7c74bc2f0e")
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !385, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !385, file: !2, baseType: !212, align: 8)
!405 = !{!400, !215}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !382, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "compiler", scope: !134, file: !2, baseType: !354, size: 128, align: 64, offset: 2816)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "archiver", scope: !134, file: !2, baseType: !354, size: 128, align: 64, offset: 2944)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ranlib", scope: !134, file: !2, baseType: !354, size: 128, align: 64, offset: 3072)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cargo_output", scope: !134, file: !2, baseType: !411, size: 128, align: 64, offset: 3200)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "CargoOutput", scope: !33, file: !2, size: 128, align: 64, elements: !412, templateParams: !23, identifier: "bc433dd653177afaa8b811276c372893")
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !411, file: !2, baseType: !328, size: 8, align: 8, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "warnings", scope: !411, file: !2, baseType: !328, size: 8, align: 8, offset: 72)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !411, file: !2, baseType: !328, size: 8, align: 8, offset: 80)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !411, file: !2, baseType: !32, size: 8, align: 8, offset: 88)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "checked_dbg_var", scope: !411, file: !2, baseType: !418, size: 64, align: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::sync::atomic::AtomicBool>", scope: !157, file: !2, size: 64, align: 64, elements: !419, templateParams: !436, identifier: "71c2bf2c2eb34b4741e70d5171104ffa")
!419 = !{!420, !440}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !418, file: !2, baseType: !421, size: 64, align: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::sync::atomic::AtomicBool>>", scope: !152, file: !2, size: 64, align: 64, elements: !422, templateParams: !438, identifier: "cabc5788bedd2e4f28931a7c98b68c42")
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !421, file: !2, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<core::sync::atomic::AtomicBool>", baseType: !425, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::sync::atomic::AtomicBool>", scope: !157, file: !2, size: 192, align: 64, elements: !426, templateParams: !436, identifier: "b9055d590ff0e45edaa2d579ddd67613")
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !425, file: !2, baseType: !170, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !425, file: !2, baseType: !170, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !425, file: !2, baseType: !430, size: 8, align: 8, offset: 128)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !171, file: !2, size: 8, align: 8, elements: !431, templateParams: !23, identifier: "18df8ce09b617745af0df8c35407fa0c")
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !430, file: !2, baseType: !433, size: 8, align: 8)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !176, file: !2, size: 8, align: 8, elements: !434, templateParams: !249, identifier: "b7b48363b5d13e5be0aac741c1d39baf")
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !433, file: !2, baseType: !35, size: 8, align: 8)
!436 = !{!437}
!437 = !DITemplateTypeParameter(name: "T", type: !430)
!438 = !{!439}
!439 = !DITemplateTypeParameter(name: "T", type: !425)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !418, file: !2, baseType: !441, align: 8)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::sync::atomic::AtomicBool>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !438, identifier: "ad6d15e0d4955151413bd91f3540454")
!442 = !DIDerivedType(tag: DW_TAG_member, name: "link_lib_modifiers", scope: !134, file: !2, baseType: !281, size: 192, align: 64, offset: 3328)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "use_plt", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3648)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "static_crt", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3656)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "shared_flag", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3664)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "warnings_into_errors", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3680)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "warnings", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3688)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "extra_warnings", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3696)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "emit_rerun_if_env_changed", scope: !134, file: !2, baseType: !328, size: 8, align: 8, offset: 3704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "shell_escaped_flags", scope: !134, file: !2, baseType: !367, size: 8, align: 8, offset: 3712)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "build_cache", scope: !134, file: !2, baseType: !454, size: 64, align: 64, offset: 3520)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<cc::BuildCache>", scope: !157, file: !2, size: 64, align: 64, elements: !455, templateParams: !947, identifier: "745a20109e1c9e4cc3753d5890ae3900")
!455 = !{!456, !951}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !454, file: !2, baseType: !457, size: 64, align: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<cc::BuildCache>>", scope: !152, file: !2, size: 64, align: 64, elements: !458, templateParams: !949, identifier: "9cea6dfd1c0f53998e5d40694c8247a1")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !457, file: !2, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<cc::BuildCache>", baseType: !461, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<cc::BuildCache>", scope: !157, file: !2, size: 3584, align: 64, elements: !462, templateParams: !947, identifier: "12e14f14a3969d35e93165ed4bd647b9")
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !461, file: !2, baseType: !170, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !461, file: !2, baseType: !170, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !2, baseType: !466, size: 3456, align: 64, offset: 128)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuildCache", scope: !34, file: !2, size: 3456, align: 64, elements: !467, templateParams: !23, identifier: "ec5e5fb278d28875010652f8c4d3b")
!467 = !{!468, !567, !600, !633, !693, !736}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "env_cache", scope: !466, file: !2, baseType: !469, size: 512, align: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>, std::collections::hash::map::RandomState>>", scope: !470, file: !2, size: 512, align: 64, elements: !472, templateParams: !565, identifier: "2c727b7087b9ac855df9656f4257d046")
!470 = !DINamespace(name: "rwlock", scope: !471)
!471 = !DINamespace(name: "sync", scope: !17)
!472 = !{!473, !494, !499}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !469, file: !2, baseType: !474, size: 64, align: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableRwLock", scope: !475, file: !2, size: 64, align: 32, elements: !477, templateParams: !23, identifier: "4393b755119cc2e3423e774462bd3790")
!475 = !DINamespace(name: "rwlock", scope: !476)
!476 = !DINamespace(name: "sys_common", scope: !17)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !474, file: !2, baseType: !479, size: 64, align: 32)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock", scope: !480, file: !2, size: 64, align: 32, elements: !482, templateParams: !23, identifier: "581389eb3983b7fadd260743aeafadc2")
!480 = !DINamespace(name: "futex_rwlock", scope: !481)
!481 = !DINamespace(name: "locks", scope: !194)
!482 = !{!483, !493}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !479, file: !2, baseType: !484, size: 32, align: 32)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !171, file: !2, size: 32, align: 32, elements: !485, templateParams: !23, identifier: "df28c1061f1f509fecdfe447f073fe05")
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !484, file: !2, baseType: !487, size: 32, align: 32)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !176, file: !2, size: 32, align: 32, elements: !488, templateParams: !491, identifier: "913c5966f37dcbe528496c11edeecf37")
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !487, file: !2, baseType: !490, size: 32, align: 32)
!490 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!491 = !{!492}
!492 = !DITemplateTypeParameter(name: "T", type: !490)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "writer_notify", scope: !479, file: !2, baseType: !484, size: 32, align: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !469, file: !2, baseType: !495, size: 8, align: 8, offset: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !496, file: !2, size: 8, align: 8, elements: !497, templateParams: !23, identifier: "f0efe752869ac106b25c24d064c5feb7")
!496 = !DINamespace(name: "poison", scope: !471)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !495, file: !2, baseType: !430, size: 8, align: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !2, baseType: !500, size: 384, align: 64, offset: 128)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>, std::collections::hash::map::RandomState>>", scope: !176, file: !2, size: 384, align: 64, elements: !501, templateParams: !565, identifier: "7988a5f214a5dabd138c8a3fcdb2884c")
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !500, file: !2, baseType: !503, size: 384, align: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>, std::collections::hash::map::RandomState>", scope: !504, file: !2, size: 384, align: 64, elements: !507, templateParams: !564, identifier: "f3fee8fa8a9db1bf8b1b31927c9824e8")
!504 = !DINamespace(name: "map", scope: !505)
!505 = !DINamespace(name: "hash", scope: !506)
!506 = !DINamespace(name: "collections", scope: !17)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !503, file: !2, baseType: !509, size: 384, align: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !510, file: !2, size: 384, align: 64, elements: !512, templateParams: !560, identifier: "d1fe94e836b1de686f7489cdf81575b8")
!510 = !DINamespace(name: "map", scope: !511)
!511 = !DINamespace(name: "hashbrown", scope: null)
!512 = !{!513, !518}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !509, file: !2, baseType: !514, size: 128, align: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !504, file: !2, size: 128, align: 64, elements: !515, templateParams: !23, identifier: "407f044fb477ce78847ad86ebd8866d7")
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !514, file: !2, baseType: !65, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !514, file: !2, baseType: !65, size: 64, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !509, file: !2, baseType: !519, size: 256, align: 64, offset: 128)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>), alloc::alloc::Global>", scope: !520, file: !2, size: 256, align: 64, elements: !521, templateParams: !559, identifier: "e95c5352820a80eaff6444038a137be4")
!520 = !DINamespace(name: "raw", scope: !511)
!521 = !{!522, !535}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !519, file: !2, baseType: !523, size: 256, align: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTableInner<alloc::alloc::Global>", scope: !520, file: !2, size: 256, align: 64, elements: !524, templateParams: !534, identifier: "260ec1f589127bde4549445f8657df9e")
!524 = !{!525, !526, !531, !532, !533}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !523, file: !2, baseType: !9, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !523, file: !2, baseType: !527, size: 64, align: 64, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !152, file: !2, size: 64, align: 64, elements: !528, templateParams: !249, identifier: "3160283ea80cecf6149fff38a2e996de")
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !527, file: !2, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !523, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !523, file: !2, baseType: !9, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !523, file: !2, baseType: !212, align: 8)
!534 = !{!215}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !519, file: !2, baseType: !536, align: 8)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !537, identifier: "db773c1250ad518074a4fda83df02b73")
!537 = !{!538}
!538 = !DITemplateTypeParameter(name: "T", type: !539)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>)", file: !2, size: 256, align: 64, elements: !540, templateParams: !23, identifier: "51db2d4b0ab63741e275925ba13aeb6")
!540 = !{!541, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !539, file: !2, baseType: !542, size: 128, align: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !543, templateParams: !23, identifier: "754135b9d49885d7c71336017ccc8da9")
!543 = !{!544, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !542, file: !2, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !542, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !539, file: !2, baseType: !548, size: 128, align: 64, offset: 128)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::ffi::os_str::OsStr>>", scope: !258, file: !2, size: 128, align: 64, elements: !549, templateParams: !23, identifier: "87290fc030597c03a23b32012ed148ed")
!549 = !{!550}
!550 = !DICompositeType(tag: DW_TAG_variant_part, scope: !548, file: !2, size: 128, align: 64, elements: !551, templateParams: !23, identifier: "256629dd7a646ed948619dd42dcd1a54", discriminator: !558)
!551 = !{!552, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !550, file: !2, baseType: !553, size: 128, align: 64, extraData: i64 0)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !548, file: !2, size: 128, align: 64, elements: !23, templateParams: !316, identifier: "99ba5d622011d089175e4231fb258bb")
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !550, file: !2, baseType: !555, size: 128, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !548, file: !2, size: 128, align: 64, elements: !556, templateParams: !316, identifier: "5c5156622f5c57d17d04a65e95a6fe25")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !555, file: !2, baseType: !294, size: 128, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !548, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagArtificial)
!559 = !{!538, !215}
!560 = !{!561, !562, !563, !215}
!561 = !DITemplateTypeParameter(name: "K", type: !542)
!562 = !DITemplateTypeParameter(name: "V", type: !548)
!563 = !DITemplateTypeParameter(name: "S", type: !514)
!564 = !{!561, !562, !563}
!565 = !{!566}
!566 = !DITemplateTypeParameter(name: "T", type: !503)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "apple_sdk_root_cache", scope: !466, file: !2, baseType: !568, size: 512, align: 64, offset: 512)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>, std::collections::hash::map::RandomState>>", scope: !470, file: !2, size: 512, align: 64, elements: !569, templateParams: !598, identifier: "91921c1390b3ab8bc49f866191031885")
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !568, file: !2, baseType: !474, size: 64, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !568, file: !2, baseType: !495, size: 8, align: 8, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !568, file: !2, baseType: !573, size: 384, align: 64, offset: 128)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>, std::collections::hash::map::RandomState>>", scope: !176, file: !2, size: 384, align: 64, elements: !574, templateParams: !598, identifier: "16918ab2031cf213d47a0bdc0b4f2b3f")
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !573, file: !2, baseType: !576, size: 384, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>, std::collections::hash::map::RandomState>", scope: !504, file: !2, size: 384, align: 64, elements: !577, templateParams: !597, identifier: "83422e80618065ed816a06fe055b877f")
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !576, file: !2, baseType: !579, size: 384, align: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !510, file: !2, size: 384, align: 64, elements: !580, templateParams: !595, identifier: "15da33fb52249c061f29009d41a93ba6")
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !579, file: !2, baseType: !514, size: 128, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !579, file: !2, baseType: !583, size: 256, align: 64, offset: 128)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>), alloc::alloc::Global>", scope: !520, file: !2, size: 256, align: 64, elements: !584, templateParams: !594, identifier: "23b748a383644a832c313858898112a1")
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !583, file: !2, baseType: !523, size: 256, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !583, file: !2, baseType: !587, align: 8)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !588, identifier: "24e52129aebd46d3cea476203238ef38")
!588 = !{!589}
!589 = !DITemplateTypeParameter(name: "T", type: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr>)", file: !2, size: 256, align: 64, elements: !591, templateParams: !23, identifier: "496b6db50fa636fde3e7a9a71dd10315")
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !590, file: !2, baseType: !542, size: 128, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !590, file: !2, baseType: !294, size: 128, align: 64, offset: 128)
!594 = !{!589, !215}
!595 = !{!561, !596, !563, !215}
!596 = !DITemplateTypeParameter(name: "V", type: !294)
!597 = !{!561, !596, !563}
!598 = !{!599}
!599 = !DITemplateTypeParameter(name: "T", type: !576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "apple_versions_cache", scope: !466, file: !2, baseType: !601, size: 512, align: 64, offset: 1024)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>, std::collections::hash::map::RandomState>>", scope: !470, file: !2, size: 512, align: 64, elements: !602, templateParams: !631, identifier: "4ffde93d2d1f4b6c28fc811f0f0402d3")
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !601, file: !2, baseType: !474, size: 64, align: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !601, file: !2, baseType: !495, size: 8, align: 8, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !2, baseType: !606, size: 384, align: 64, offset: 128)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>, std::collections::hash::map::RandomState>>", scope: !176, file: !2, size: 384, align: 64, elements: !607, templateParams: !631, identifier: "a326bbbd5ce58911171c632214e1974d")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !606, file: !2, baseType: !609, size: 384, align: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>, std::collections::hash::map::RandomState>", scope: !504, file: !2, size: 384, align: 64, elements: !610, templateParams: !630, identifier: "39034f575a87ece821e3ef38c649835d")
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !609, file: !2, baseType: !612, size: 384, align: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !510, file: !2, size: 384, align: 64, elements: !613, templateParams: !628, identifier: "40451d029178ea07e97812567459331")
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !612, file: !2, baseType: !514, size: 128, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !612, file: !2, baseType: !616, size: 256, align: 64, offset: 128)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>), alloc::alloc::Global>", scope: !520, file: !2, size: 256, align: 64, elements: !617, templateParams: !627, identifier: "ee95a1db906601fc2706ddd98618977b")
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !616, file: !2, baseType: !523, size: 256, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !616, file: !2, baseType: !620, align: 8)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !621, identifier: "9550765709bda5222234ec81d409d429")
!621 = !{!622}
!622 = !DITemplateTypeParameter(name: "T", type: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str>)", file: !2, size: 256, align: 64, elements: !624, templateParams: !23, identifier: "3f8fb7ff7877db3e74f7322bacd8a93c")
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !623, file: !2, baseType: !542, size: 128, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !623, file: !2, baseType: !234, size: 128, align: 64, offset: 128)
!627 = !{!622, !215}
!628 = !{!561, !629, !563, !215}
!629 = !DITemplateTypeParameter(name: "V", type: !234)
!630 = !{!561, !629, !563}
!631 = !{!632}
!632 = !DITemplateTypeParameter(name: "T", type: !609)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cached_compiler_family", scope: !466, file: !2, baseType: !634, size: 512, align: 64, offset: 1536)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::collections::hash::map::RandomState>>", scope: !470, file: !2, size: 512, align: 64, elements: !635, templateParams: !691, identifier: "e34fd27470d49667192e7248dd23b8cf")
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !634, file: !2, baseType: !474, size: 64, align: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !634, file: !2, baseType: !495, size: 8, align: 8, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !634, file: !2, baseType: !639, size: 384, align: 64, offset: 128)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::collections::hash::map::RandomState>>", scope: !176, file: !2, size: 384, align: 64, elements: !640, templateParams: !691, identifier: "d561f6f0d127e777eecfc458f10362c")
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !639, file: !2, baseType: !642, size: 384, align: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::collections::hash::map::RandomState>", scope: !504, file: !2, size: 384, align: 64, elements: !643, templateParams: !690, identifier: "ba7395ee6a0b4b24865be69a64e1277a")
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !642, file: !2, baseType: !645, size: 384, align: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !510, file: !2, size: 384, align: 64, elements: !646, templateParams: !687, identifier: "f2d0dcf02e98e38b1111f9f5ced3453f")
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !645, file: !2, baseType: !514, size: 128, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !645, file: !2, baseType: !649, size: 256, align: 64, offset: 128)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily), alloc::alloc::Global>", scope: !520, file: !2, size: 256, align: 64, elements: !650, templateParams: !686, identifier: "c8bb30d3ade69f32ed4f7bccf42b008a")
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !649, file: !2, baseType: !523, size: 256, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !649, file: !2, baseType: !653, align: 8)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !654, identifier: "395fc6a93bbbe69498088e2da529a8a6")
!654 = !{!655}
!655 = !DITemplateTypeParameter(name: "T", type: !656)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily)", file: !2, size: 192, align: 64, elements: !657, templateParams: !23, identifier: "3bb0ad2cbe4ba0444945ca8ff7ee04ca")
!657 = !{!658, !669}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !656, file: !2, baseType: !659, size: 128, align: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !660, templateParams: !23, identifier: "c4a9b5b3b256545bc8cd067826bbcc1")
!660 = !{!661, !668}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !659, file: !2, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64, dwarfAddressSpace: 0)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !664, templateParams: !23, identifier: "22a7a95dd8b5251d33ed5fb1c60412c8")
!664 = !{!665, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !663, file: !2, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !663, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !659, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !656, file: !2, baseType: !670, size: 16, align: 8, offset: 128)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "ToolFamily", scope: !671, file: !2, size: 16, align: 8, elements: !672, templateParams: !23, identifier: "c6bac393da7a0b6c875160eb0d3085ab")
!671 = !DINamespace(name: "tool", scope: !34)
!672 = !{!673}
!673 = !DICompositeType(tag: DW_TAG_variant_part, scope: !670, file: !2, size: 16, align: 8, elements: !674, templateParams: !23, identifier: "bbf3bb9e1549ccdb3b62e13917921473", discriminator: !685)
!674 = !{!675, !677, !681}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Gnu", scope: !673, file: !2, baseType: !676, size: 16, align: 8, extraData: i64 0)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "Gnu", scope: !670, file: !2, size: 16, align: 8, elements: !23, identifier: "49c65d9d3973604dfe9a5c4c8e4d920d")
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Clang", scope: !673, file: !2, baseType: !678, size: 16, align: 8, extraData: i64 1)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Clang", scope: !670, file: !2, size: 16, align: 8, elements: !679, templateParams: !23, identifier: "a20b460c116799c4e5c4690d85b4891c")
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zig_cc", scope: !678, file: !2, baseType: !328, size: 8, align: 8, offset: 8)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Msvc", scope: !673, file: !2, baseType: !682, size: 16, align: 8, extraData: i64 2)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "Msvc", scope: !670, file: !2, size: 16, align: 8, elements: !683, templateParams: !23, identifier: "51e9999c558d3c5c173dfd97dc0adf64")
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "clang_cl", scope: !682, file: !2, baseType: !328, size: 8, align: 8, offset: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !2, baseType: !35, size: 8, align: 8, flags: DIFlagArtificial)
!686 = !{!655, !215}
!687 = !{!688, !689, !563, !215}
!688 = !DITemplateTypeParameter(name: "K", type: !659)
!689 = !DITemplateTypeParameter(name: "V", type: !670)
!690 = !{!688, !689, !563}
!691 = !{!692}
!692 = !DITemplateTypeParameter(name: "T", type: !642)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "known_flag_support_status_cache", scope: !466, file: !2, baseType: !694, size: 512, align: 64, offset: 2048)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<cc::CompilerFlag, bool, std::collections::hash::map::RandomState>>", scope: !470, file: !2, size: 512, align: 64, elements: !695, templateParams: !734, identifier: "e8a673bfe7d983babcd42c991c3ebbf9")
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !694, file: !2, baseType: !474, size: 64, align: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !694, file: !2, baseType: !495, size: 8, align: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !694, file: !2, baseType: !699, size: 384, align: 64, offset: 128)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<cc::CompilerFlag, bool, std::collections::hash::map::RandomState>>", scope: !176, file: !2, size: 384, align: 64, elements: !700, templateParams: !734, identifier: "5328ee2b212ca8faf5f55532a5a86a67")
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !699, file: !2, baseType: !702, size: 384, align: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<cc::CompilerFlag, bool, std::collections::hash::map::RandomState>", scope: !504, file: !2, size: 384, align: 64, elements: !703, templateParams: !733, identifier: "80afe025f80d61bc4caadaf9502dffd0")
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !702, file: !2, baseType: !705, size: 384, align: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<cc::CompilerFlag, bool, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !510, file: !2, size: 384, align: 64, elements: !706, templateParams: !730, identifier: "8f5325044d975bf8741834bb8b3c5a83")
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !705, file: !2, baseType: !514, size: 128, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !705, file: !2, baseType: !709, size: 256, align: 64, offset: 128)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(cc::CompilerFlag, bool), alloc::alloc::Global>", scope: !520, file: !2, size: 256, align: 64, elements: !710, templateParams: !729, identifier: "ae252be490fb13953074e8c528046b8d")
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !709, file: !2, baseType: !523, size: 256, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !709, file: !2, baseType: !713, align: 8)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(cc::CompilerFlag, bool)>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !714, identifier: "d99f7f13875851339a2969a780465f00")
!714 = !{!715}
!715 = !DITemplateTypeParameter(name: "T", type: !716)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "(cc::CompilerFlag, bool)", file: !2, size: 320, align: 64, elements: !717, templateParams: !23, identifier: "1eeb4fdbea699e80a887dd770edc9201")
!717 = !{!718, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !716, file: !2, baseType: !719, size: 256, align: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "CompilerFlag", scope: !34, file: !2, size: 256, align: 64, elements: !720, templateParams: !23, identifier: "604224995c1715106b9cd30bc03f61a1")
!720 = !{!721, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "compiler", scope: !719, file: !2, baseType: !722, size: 128, align: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<std::path::Path, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !723, templateParams: !23, identifier: "fa35ccc605a15662e940802c1fe45ae6")
!723 = !{!724, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !722, file: !2, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !722, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !719, file: !2, baseType: !663, size: 128, align: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !716, file: !2, baseType: !328, size: 8, align: 8, offset: 256)
!729 = !{!715, !215}
!730 = !{!731, !732, !563, !215}
!731 = !DITemplateTypeParameter(name: "K", type: !719)
!732 = !DITemplateTypeParameter(name: "V", type: !328)
!733 = !{!731, !732, !563}
!734 = !{!735}
!735 = !DITemplateTypeParameter(name: "T", type: !702)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "target_info_parser", scope: !466, file: !2, baseType: !737, size: 896, align: 64, offset: 2560)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "TargetInfoParser", scope: !738, file: !2, size: 896, align: 64, elements: !740, templateParams: !23, identifier: "21bea2221e1c22d418c2268d83e684c")
!738 = !DINamespace(name: "parser", scope: !739)
!739 = !DINamespace(name: "target", scope: !34)
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !737, file: !2, baseType: !742, size: 896, align: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnceLock<core::result::Result<cc::target::parser::TargetInfoParserInner, cc::Error>>", scope: !743, file: !2, size: 896, align: 64, elements: !744, templateParams: !941, identifier: "ee3c28231518196fb823bf73aeeb063b")
!743 = !DINamespace(name: "utilities", scope: !34)
!744 = !{!745, !860, !945}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "once", scope: !742, file: !2, baseType: !746, size: 64, align: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !747, file: !2, size: 64, align: 64, elements: !748, templateParams: !23, identifier: "cd0ff6a1a5d2f3217ce662dc0ca5a76b")
!747 = !DINamespace(name: "once", scope: !471)
!748 = !{!749, !761}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "state_and_queue", scope: !746, file: !2, baseType: !750, size: 64, align: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<()>", scope: !171, file: !2, size: 64, align: 64, elements: !751, templateParams: !759, identifier: "bd1b6312d1ddc2fb005e84ae5f9bdc3")
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !750, file: !2, baseType: !753, size: 64, align: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut ()>", scope: !176, file: !2, size: 64, align: 64, elements: !754, templateParams: !757, identifier: "df3806da8b62306e5ad46460e6013361")
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !753, file: !2, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!757 = !{!758}
!758 = !DITemplateTypeParameter(name: "T", type: !756)
!759 = !{!760}
!760 = !DITemplateTypeParameter(name: "T", type: !7)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !746, file: !2, baseType: !762, align: 8)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*const std::sync::once::Waiter>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !763, identifier: "c411b9ea90787033c31cec6571f9938d")
!763 = !{!764}
!764 = !DITemplateTypeParameter(name: "T", type: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const std::sync::once::Waiter", baseType: !766, size: 64, align: 64, dwarfAddressSpace: 0)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waiter", scope: !747, file: !2, size: 192, align: 64, elements: !767, templateParams: !23, identifier: "1011d7df8bff3732647b130aa30a05ff")
!767 = !{!768, !858, !859}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !766, file: !2, baseType: !769, size: 64, align: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<std::thread::Thread>>", scope: !176, file: !2, size: 64, align: 64, elements: !770, templateParams: !856, identifier: "db853e6b6e355d49cf0eb6fdc203fdb6")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !769, file: !2, baseType: !772, size: 64, align: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::thread::Thread>>", scope: !176, file: !2, size: 64, align: 64, elements: !773, templateParams: !856, identifier: "aab223b8e9bb22876c9a641d27fec188")
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !772, file: !2, baseType: !775, size: 64, align: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::Thread>", scope: !258, file: !2, size: 64, align: 64, elements: !776, templateParams: !23, identifier: "ac9e055aea8b2c71b222a26a0b2d605b")
!776 = !{!777}
!777 = !DICompositeType(tag: DW_TAG_variant_part, scope: !775, file: !2, size: 64, align: 64, elements: !778, templateParams: !23, identifier: "d189238fc29c8746e9964ec6280b68ea", discriminator: !855)
!778 = !{!779, !851}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !777, file: !2, baseType: !780, size: 64, align: 64, extraData: i64 0)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !775, file: !2, size: 64, align: 64, elements: !23, templateParams: !781, identifier: "c62297ce425f510d1c4313cc9186294f")
!781 = !{!782}
!782 = !DITemplateTypeParameter(name: "T", type: !783)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !784, file: !2, size: 64, align: 64, elements: !785, templateParams: !23, identifier: "181d11db8a84642a3d9f2fdd068530a3")
!784 = !DINamespace(name: "thread", scope: !17)
!785 = !{!786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !783, file: !2, baseType: !787, size: 64, align: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::Inner>>", scope: !788, file: !2, size: 64, align: 64, elements: !789, templateParams: !849, identifier: "e9ad1bd6432910d9a3eb8c1441038616")
!788 = !DINamespace(name: "pin", scope: !56)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !787, file: !2, baseType: !791, size: 64, align: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !157, file: !2, size: 64, align: 64, elements: !792, templateParams: !843, identifier: "fa53fb10d452b801a2c9df37976b7c0f")
!792 = !{!793, !847}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !791, file: !2, baseType: !794, size: 64, align: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !152, file: !2, size: 64, align: 64, elements: !795, templateParams: !845, identifier: "ca467cef215b0b688cec8b37ff67e3eb")
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !794, file: !2, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !798, size: 64, align: 64, dwarfAddressSpace: 0)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !157, file: !2, size: 384, align: 64, elements: !799, templateParams: !843, identifier: "af768f86552c1580b6bad22038e52e6b")
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !798, file: !2, baseType: !170, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !798, file: !2, baseType: !170, size: 64, align: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !2, baseType: !803, size: 256, align: 64, offset: 128)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !784, file: !2, size: 256, align: 64, elements: !804, templateParams: !23, identifier: "c4cf126348540eb9d47a2569a004f23c")
!804 = !{!805, !828, !837}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !803, file: !2, baseType: !806, size: 128, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::ffi::c_str::CString>", scope: !258, file: !2, size: 128, align: 64, elements: !807, templateParams: !23, identifier: "11079736a8cf7d01b5081204844afabf")
!807 = !{!808}
!808 = !DICompositeType(tag: DW_TAG_variant_part, scope: !806, file: !2, size: 128, align: 64, elements: !809, templateParams: !23, identifier: "24a4f611368b1aaecb2a2d1015a4e208", discriminator: !827)
!809 = !{!810, !823}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !808, file: !2, baseType: !811, size: 128, align: 64, extraData: i64 0)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !806, file: !2, size: 128, align: 64, elements: !23, templateParams: !812, identifier: "a0925efc4ffffc6b6e6a847eade956da")
!812 = !{!813}
!813 = !DITemplateTypeParameter(name: "T", type: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !815, file: !2, size: 128, align: 64, elements: !817, templateParams: !23, identifier: "a4dcbb113228472ac833458ca2f5ee8d")
!815 = !DINamespace(name: "c_str", scope: !816)
!816 = !DINamespace(name: "ffi", scope: !139)
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !814, file: !2, baseType: !819, size: 128, align: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !820, templateParams: !23, identifier: "e783b0825321c11fc908377d145707b4")
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !819, file: !2, baseType: !545, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !819, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !808, file: !2, baseType: !824, size: 128, align: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !806, file: !2, size: 128, align: 64, elements: !825, templateParams: !812, identifier: "b95ab6a63fa54894b511858e9aa487eb")
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !824, file: !2, baseType: !814, size: 128, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, scope: !806, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagArtificial)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !803, file: !2, baseType: !829, size: 64, align: 64, offset: 128)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !784, file: !2, size: 64, align: 64, elements: !830, templateParams: !23, identifier: "14daaba64fc0b725cea71c77b1c0dda0")
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !829, file: !2, baseType: !832, size: 64, align: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !833, file: !2, size: 64, align: 64, elements: !835, templateParams: !23, identifier: "c75221714c3cb037594d5c7d9a6076e4")
!833 = !DINamespace(name: "nonzero", scope: !834)
!834 = !DINamespace(name: "num", scope: !56)
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !832, file: !2, baseType: !65, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !803, file: !2, baseType: !838, size: 32, align: 32, offset: 192)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !839, file: !2, size: 32, align: 32, elements: !841, templateParams: !23, identifier: "c35d3c03a2fef7c43fe89d6d5817985")
!839 = !DINamespace(name: "futex", scope: !840)
!840 = !DINamespace(name: "thread_parker", scope: !476)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !838, file: !2, baseType: !484, size: 32, align: 32)
!843 = !{!844}
!844 = !DITemplateTypeParameter(name: "T", type: !803)
!845 = !{!846}
!846 = !DITemplateTypeParameter(name: "T", type: !798)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !791, file: !2, baseType: !848, align: 8)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !205, file: !2, align: 8, elements: !23, templateParams: !845, identifier: "d5fdc42d9e07c76ff2921be32eeec608")
!849 = !{!850}
!850 = !DITemplateTypeParameter(name: "P", type: !791)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !777, file: !2, baseType: !852, size: 64, align: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !775, file: !2, size: 64, align: 64, elements: !853, templateParams: !781, identifier: "6bc2de44d37c9dda9c762cea1a674a19")
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !852, file: !2, baseType: !783, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, scope: !775, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagArtificial)
!856 = !{!857}
!857 = !DITemplateTypeParameter(name: "T", type: !775)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !766, file: !2, baseType: !430, size: 8, align: 8, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !2, baseType: !765, size: 64, align: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !742, file: !2, baseType: !861, size: 832, align: 64, offset: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::mem::maybe_uninit::MaybeUninit<core::result::Result<cc::target::parser::TargetInfoParserInner, cc::Error>>>", scope: !176, file: !2, size: 832, align: 64, elements: !862, templateParams: !943, identifier: "6ba5923e53d55dadd8facaa616d492c")
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !861, file: !2, baseType: !864, size: 832, align: 64)
!864 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<core::result::Result<cc::target::parser::TargetInfoParserInner, cc::Error>>", scope: !865, file: !2, size: 832, align: 64, elements: !866, templateParams: !941, identifier: "c7086e75d4cdc8e22791296038d3dd9")
!865 = !DINamespace(name: "maybe_uninit", scope: !64)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !864, file: !2, baseType: !7, align: 8)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !864, file: !2, baseType: !869, size: 832, align: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<core::result::Result<cc::target::parser::TargetInfoParserInner, cc::Error>>", scope: !870, file: !2, size: 832, align: 64, elements: !871, templateParams: !941, identifier: "7b44961c699f52831019f6206ad8c5bd")
!870 = !DINamespace(name: "manually_drop", scope: !64)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !869, file: !2, baseType: !873, size: 832, align: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<cc::target::parser::TargetInfoParserInner, cc::Error>", scope: !874, file: !2, size: 832, align: 64, elements: !875, templateParams: !23, identifier: "77bae074358d9ff7299e5322cbb25dce")
!874 = !DINamespace(name: "result", scope: !56)
!875 = !{!876}
!876 = !DICompositeType(tag: DW_TAG_variant_part, scope: !873, file: !2, size: 832, align: 64, elements: !877, templateParams: !23, identifier: "ee1d23912df377841f4090ff3d2dd865", discriminator: !940)
!877 = !{!878, !936}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !876, file: !2, baseType: !879, size: 832, align: 64, extraData: i64 0)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !873, file: !2, size: 832, align: 64, elements: !880, templateParams: !890, identifier: "71f26677710e98136d593d716e0cafc")
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !879, file: !2, baseType: !882, size: 768, align: 64, offset: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "TargetInfoParserInner", scope: !738, file: !2, size: 768, align: 64, elements: !883, templateParams: !23, identifier: "628187739ffd3b69b9d736d987235e")
!883 = !{!884, !885, !886, !887, !888, !889}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "full_arch", scope: !882, file: !2, baseType: !542, size: 128, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !882, file: !2, baseType: !542, size: 128, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !882, file: !2, baseType: !542, size: 128, align: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !882, file: !2, baseType: !542, size: 128, align: 64, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !882, file: !2, baseType: !542, size: 128, align: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !882, file: !2, baseType: !542, size: 128, align: 64, offset: 640)
!890 = !{!891, !892}
!891 = !DITemplateTypeParameter(name: "T", type: !882)
!892 = !DITemplateTypeParameter(name: "E", type: !893)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !34, file: !2, size: 320, align: 64, elements: !894, templateParams: !23, identifier: "329b500159e03c1a7372d47d34bdb0de")
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !893, file: !2, baseType: !40, size: 8, align: 8, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !893, file: !2, baseType: !897, size: 256, align: 64)
