; ModuleID = 'f128_input.d0c3c3a7-cgu.0'
source_filename = "f128_input.d0c3c3a7-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::thread::local::fast::Key<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>" = type { %"std::thread::local::lazy::LazyKeyInner<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>", i8, [7 x i8] }
%"std::thread::local::lazy::LazyKeyInner<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>" = type { %"core::cell::UnsafeCell<core::option::Option<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>>" }
%"core::cell::UnsafeCell<core::option::Option<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>>" = type { %"core::option::Option<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>" }
%"core::option::Option<proc_macro::bridge::scoped_cell::ScopedCell<proc_macro::bridge::client::BridgeStateL>>" = type { i64, [10 x i64] }
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::panicking::begin_panic::PanicPayload<alloc::string::String> as core::panic::BoxMeUp>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::panicking::begin_panic::PanicPayload<alloc::string::String> as core::panic::BoxMeUp>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !13, templateParams: !27, identifier: "7985524a3c51ce4b77a9c3b0aceb6a6")
!4 = !{!5, !8, !10, !11, !12}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicPayload<alloc::string::String>", scope: !14, file: !2, size: 192, align: 64, elements: !17, templateParams: !72, identifier: "9c605b083cb151925c83fcf695b3d34b")
!14 = !DINamespace(name: "begin_panic", scope: !15)
!15 = !DINamespace(name: "panicking", scope: !16)
!16 = !DINamespace(name: "std", scope: null)
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !13, file: !2, baseType: !19, size: 192, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::string::String>", scope: !20, file: !2, size: 192, align: 64, elements: !22, templateParams: !27, identifier: "e57ba4b2645742ac80028345ae3e3b7e")
!20 = !DINamespace(name: "option", scope: !21)
!21 = !DINamespace(name: "core", scope: null)
!22 = !{!23}
!23 = !DICompositeType(tag: DW_TAG_variant_part, scope: !19, file: !2, size: 192, align: 64, elements: !24, templateParams: !27, identifier: "543e21bd6ff6b14b475ba99e29f0198a", discriminator: !70)
!24 = !{!25, !66}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !23, file: !2, baseType: !26, size: 192, align: 64, extraData: i64 0)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !19, file: !2, size: 192, align: 64, elements: !27, templateParams: !28, identifier: "ec22a260f66480db9e9c99b9abc35989")
!27 = !{}
!28 = !{!29}
!29 = !DITemplateTypeParameter(name: "T", type: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !31, file: !2, size: 192, align: 64, elements: !33, templateParams: !27, identifier: "f9be69e76fc784402e5b8eb88fb718b5")
!31 = !DINamespace(name: "string", scope: !32)
!32 = !DINamespace(name: "alloc", scope: null)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !30, file: !2, baseType: !35, size: 192, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !36, file: !2, size: 192, align: 64, elements: !37, templateParams: !63, identifier: "f48a096c1ed19eb7ba15a7173429013")
!36 = !DINamespace(name: "vec", scope: !32)
!37 = !{!38, !65}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !35, file: !2, baseType: !39, size: 128, align: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !40, file: !2, size: 128, align: 64, elements: !41, templateParams: !63, identifier: "d09dab1a097018b9dd4dad6f3ce84c27")
!40 = !DINamespace(name: "raw_vec", scope: !32)
!41 = !{!42, !59, !60}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !39, file: !2, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !44, file: !2, size: 64, align: 64, elements: !46, templateParams: !54, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!44 = !DINamespace(name: "unique", scope: !45)
!45 = !DINamespace(name: "ptr", scope: !21)
!46 = !{!47, !56}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !43, file: !2, baseType: !48, size: 64, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !49, file: !2, size: 64, align: 64, elements: !50, templateParams: !54, identifier: "3160283ea80cecf6149fff38a2e996de")
!49 = !DINamespace(name: "non_null", scope: !45)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !48, file: !2, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "T", type: !53)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !43, file: !2, baseType: !57, align: 8)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !58, file: !2, align: 8, elements: !27, templateParams: !54, identifier: "e338a8151f1037c76eadd10ab3c53972")
!58 = !DINamespace(name: "marker", scope: !21)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !39, file: !2, baseType: !61, align: 8)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !62, file: !2, align: 8, elements: !27, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!62 = !DINamespace(name: "alloc", scope: !32)
!63 = !{!55, !64}
!64 = !DITemplateTypeParameter(name: "A", type: !61)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !23, file: !2, baseType: !67, size: 192, align: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !19, file: !2, size: 192, align: 64, elements: !68, templateParams: !28, identifier: "10653187bab481cceda9c29be1112f74")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !67, file: !2, baseType: !30, size: 192, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagArtificial)
!71 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "A", type: !30)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !77, vtableHolder: !82, templateParams: !27, identifier: "cc03c6bff4d9639024183c9c09565e2e")
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !76, file: !2, baseType: !6, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !76, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !76, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !86, vtableHolder: !91, templateParams: !27, identifier: "cc5be580cb0df255ec480aafb486f1d8")
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !85, file: !2, baseType: !6, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !85, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !92, file: !2, align: 8, elements: !27, identifier: "b46b3a258fa8da6295bb615e7cb8f1fa")
!92 = !DINamespace(name: "local", scope: !93)
!93 = !DINamespace(name: "thread", scope: !16)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !97, vtableHolder: !102, templateParams: !27, identifier: "5524bda69378138df0eaa44a0fa62936")
!97 = !{!98, !99, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !96, file: !2, baseType: !6, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !96, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !96, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !103, file: !2, size: 64, align: 64, elements: !105, templateParams: !27, identifier: "35ef22def08c837ae3878504674e366b")
!103 = !DINamespace(name: "error", scope: !104)
!104 = !DINamespace(name: "io", scope: !16)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !102, file: !2, baseType: !107, size: 64, align: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !108, file: !2, size: 64, align: 64, elements: !109, templateParams: !27, identifier: "6570f3d28135329fbed4cb7a1951e32d")
!108 = !DINamespace(name: "repr_bitpacked", scope: !103)
!109 = !{!110, !116}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !107, file: !2, baseType: !111, size: 64, align: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !49, file: !2, size: 64, align: 64, elements: !112, templateParams: !114, identifier: "b858013ea474e1eef5ccba3870fe353d")
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !111, file: !2, baseType: !6, size: 64, align: 64)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "T", type: !7)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !107, file: !2, baseType: !117, align: 8)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !58, file: !2, align: 8, elements: !27, templateParams: !118, identifier: "1d073321bd67e7be57d2b831b78eb78b")
!118 = !{!119}
!119 = !DITemplateTypeParameter(name: "T", type: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !103, file: !2, size: 128, align: 64, elements: !121, templateParams: !27, identifier: "64bf9ab43a422ff7882cc64d405e6db4")
!121 = !{!122}
!122 = !DICompositeType(tag: DW_TAG_variant_part, scope: !120, file: !2, size: 128, align: 64, elements: !123, templateParams: !27, identifier: "32d46417816a4970232155829bec3de0", discriminator: !211)
!123 = !{!124, !189, !193, !207}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !122, file: !2, baseType: !125, size: 128, align: 64, extraData: i64 0)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !120, file: !2, size: 128, align: 64, elements: !126, templateParams: !129, identifier: "51312ccd08399ffb43fb895d8a6353de")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !125, file: !2, baseType: !128, size: 32, align: 32, offset: 32)
!128 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "C", type: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !132, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !103, file: !2, size: 192, align: 64, elements: !133, templateParams: !27, identifier: "387ae58cacb5ae1d4fddf7f57315f38d")
!133 = !{!134, !178}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !132, file: !2, baseType: !135, size: 8, align: 8, offset: 128)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !103, file: !2, baseType: !53, size: 8, align: 8, flags: DIFlagEnumClass, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!137 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!138 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!140 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!141 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!142 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!143 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!144 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!145 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!146 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!147 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!148 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!149 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!150 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!151 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!152 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!153 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!154 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!155 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!156 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!157 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!158 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!159 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!160 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!161 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!162 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!163 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!164 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!165 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!166 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!167 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!168 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!169 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!170 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!171 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!172 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!173 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!174 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!175 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!176 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!177 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !132, file: !2, baseType: !179, size: 128, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !180, templateParams: !27, identifier: "49e1ff5efd573d092283dcd4348771ac")
!180 = !{!181, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !179, file: !2, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !27, identifier: "d998709730b54ebefffe35f2808c071f")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !179, file: !2, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 3, lowerBound: 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !122, file: !2, baseType: !190, size: 128, align: 64, extraData: i64 1)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !120, file: !2, size: 128, align: 64, elements: !191, templateParams: !129, identifier: "d6fdaf6afb7f06ba830e20c3b7cdf96a")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !190, file: !2, baseType: !135, size: 8, align: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !122, file: !2, baseType: !194, size: 128, align: 64, extraData: i64 2)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !120, file: !2, size: 128, align: 64, elements: !195, templateParams: !129, identifier: "6cf4fba8ceca59eba147622df4399a69")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !2, baseType: !197, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !198, size: 64, align: 64, dwarfAddressSpace: 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !103, file: !2, size: 192, align: 64, elements: !199, templateParams: !27, identifier: "7efc891383873a5dce28ace1bc51c9d2")
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !198, file: !2, baseType: !135, size: 8, align: 8, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !198, file: !2, baseType: !202, size: 128, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !203, templateParams: !27, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!203 = !{!204, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !202, file: !2, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !202, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !122, file: !2, baseType: !208, size: 128, align: 64, extraData: i64 3)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !120, file: !2, size: 128, align: 64, elements: !209, templateParams: !129, identifier: "591e506d10606579798142c7aef919f4")
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !208, file: !2, baseType: !131, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, scope: !120, file: !2, baseType: !53, size: 8, align: 8, flags: DIFlagArtificial)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "<proc_macro::LexError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "<proc_macro::LexError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !215, vtableHolder: !220, templateParams: !27, identifier: "de5d9466ee59d16cb68259c3b1ff6265")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !214, file: !2, baseType: !6, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !214, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !214, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !214, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "LexError", scope: !221, file: !2, align: 8, elements: !27, identifier: "561439df579bba39d27b41bb6e6d90bd")
!221 = !DINamespace(name: "proc_macro", scope: null)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "<alloc::string::String as core::any::Any>::{vtable}", scope: null, file: !2, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::String as core::any::Any>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !225, vtableHolder: !30, templateParams: !27, identifier: "c6324ed888f6efcb4653fbd70e377684")
!225 = !{!226, !227, !228, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !224, file: !2, baseType: !6, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !224, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "_DECLS", linkageName: "__rustc_proc_macro_decls_df67d460d0c3c3a7__", scope: !232, file: !2, type: !234, isLocal: false, isDefinition: true, align: 64)
!232 = !DINamespace(name: "_", scope: !233)
!233 = !DINamespace(name: "f128_input", scope: null)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[proc_macro::bridge::client::ProcMacro]", file: !2, size: 128, align: 64, elements: !235, templateParams: !27, identifier: "f373bec6ae2e5d675b86a8e1b94caae")
!235 = !{!236, !394}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !234, file: !2, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMacro", scope: !239, file: !2, size: 448, align: 64, elements: !241, templateParams: !27, identifier: "38d3b9ee6744be26ea9712825c3539fb")
!239 = !DINamespace(name: "client", scope: !240)
!240 = !DINamespace(name: "bridge", scope: !221)
!241 = !{!242}
!242 = !DICompositeType(tag: DW_TAG_variant_part, scope: !238, file: !2, size: 448, align: 64, elements: !243, templateParams: !27, identifier: "369c11e06d1ad367f08ea7dfedca98db", discriminator: !393)
!243 = !{!244, !366, !388}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "CustomDerive", scope: !242, file: !2, baseType: !245, size: 448, align: 64, extraData: i64 0)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDerive", scope: !238, file: !2, size: 448, align: 64, elements: !246, templateParams: !27, identifier: "fbad7f2aa44b10cbde1d77240c9833e5")
!246 = !{!247, !248, !254}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "trait_name", scope: !245, file: !2, baseType: !202, size: 128, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !245, file: !2, baseType: !249, size: 128, align: 64, offset: 192)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !250, templateParams: !27, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!250 = !{!251, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !249, file: !2, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !249, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !245, file: !2, baseType: !255, size: 128, align: 64, offset: 320)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client<proc_macro::TokenStream, proc_macro::TokenStream>", scope: !239, file: !2, size: 128, align: 64, elements: !256, templateParams: !363, identifier: "ff2935b1576f1d2b2a4f64f85a027975")
!256 = !{!257, !281, !330}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "get_handle_counters", scope: !255, file: !2, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22C\22 fn() -> &proc_macro::bridge::client::HandleCounters", baseType: !259, size: 64, align: 64, dwarfAddressSpace: 0)
!259 = !DISubroutineType(types: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&proc_macro::bridge::client::HandleCounters", baseType: !262, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandleCounters", scope: !239, file: !2, size: 384, align: 64, elements: !263, templateParams: !27, identifier: "6db19962c029e3f09ff8ad0d22ecf3dc")
!263 = !{!264, !276, !277, !278, !279, !280}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "FreeFunctions", scope: !262, file: !2, baseType: !265, size: 64, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !266, file: !2, size: 64, align: 64, elements: !268, templateParams: !27, identifier: "7ffec6c78d83ad83b9e8e18b9f044e78")
!266 = !DINamespace(name: "atomic", scope: !267)
!267 = !DINamespace(name: "sync", scope: !21)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !265, file: !2, baseType: !270, size: 64, align: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !271, file: !2, size: 64, align: 64, elements: !272, templateParams: !274, identifier: "1096bf4d22c004093180ac32ada74dc8")
!271 = !DINamespace(name: "cell", scope: !21)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !270, file: !2, baseType: !9, size: 64, align: 64)
!274 = !{!275}
!275 = !DITemplateTypeParameter(name: "T", type: !9)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "TokenStream", scope: !262, file: !2, baseType: !265, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "SourceFile", scope: !262, file: !2, baseType: !265, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "MultiSpan", scope: !262, file: !2, baseType: !265, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Diagnostic", scope: !262, file: !2, baseType: !265, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Span", scope: !262, file: !2, baseType: !265, size: 64, align: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !255, file: !2, baseType: !282, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22C\22 fn(proc_macro::bridge::BridgeConfig) -> proc_macro::bridge::buffer::Buffer", baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !300}
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buffer", scope: !286, file: !2, size: 320, align: 64, elements: !287, templateParams: !27, identifier: "602fbda2600c0b836462c7307194818f")
!286 = !DINamespace(name: "buffer", scope: !240)
!287 = !{!288, !290, !291, !292, !296}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !2, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !285, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !285, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !285, file: !2, baseType: !293, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22C\22 fn(proc_macro::bridge::buffer::Buffer, usize) -> proc_macro::bridge::buffer::Buffer", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DISubroutineType(types: !295)
!295 = !{!285, !285, !9}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !285, file: !2, baseType: !297, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22C\22 fn(proc_macro::bridge::buffer::Buffer)", baseType: !298, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !285}
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "BridgeConfig", scope: !240, file: !2, size: 512, align: 64, elements: !301, templateParams: !27, identifier: "e393a279696efe6e6a43699d5cee1e76")
!301 = !{!302, !303, !323, !325}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !300, file: !2, baseType: !285, size: 320, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !300, file: !2, baseType: !304, size: 128, align: 64, offset: 320)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Closure<proc_macro::bridge::buffer::Buffer, proc_macro::bridge::buffer::Buffer>", scope: !305, file: !2, size: 128, align: 64, elements: !306, templateParams: !320, identifier: "81bc8d741a2c2ee739cd61395b540e79")
!305 = !DINamespace(name: "closure", scope: !240)
!306 = !{!307, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !304, file: !2, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut proc_macro::bridge::closure::Env, proc_macro::bridge::buffer::Buffer) -> proc_macro::bridge::buffer::Buffer", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{!285, !311, !285}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut proc_macro::bridge::closure::Env", baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Env", scope: !305, file: !2, align: 8, elements: !27, identifier: "9658592641be235dbd27ee1e5cf7af65")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !304, file: !2, baseType: !311, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !304, file: !2, baseType: !315, align: 8, offset: 128)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*mut &mut ()>", scope: !58, file: !2, align: 8, elements: !27, templateParams: !316, identifier: "26601eacdb4fa3c81325244f62de1ac4")
!316 = !{!317}
!317 = !DITemplateTypeParameter(name: "T", type: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &mut ()", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!320 = !{!321, !322}
!321 = !DITemplateTypeParameter(name: "A", type: !285)
!322 = !DITemplateTypeParameter(name: "R", type: !285)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "force_show_panics", scope: !300, file: !2, baseType: !324, size: 8, align: 8, offset: 448)
!324 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !300, file: !2, baseType: !326, align: 8, offset: 456)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*mut ()>", scope: !58, file: !2, align: 8, elements: !27, templateParams: !327, identifier: "18fb208f61778056185d1ea9e77c84e5")
!327 = !{!328}
!328 = !DITemplateTypeParameter(name: "T", type: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !255, file: !2, baseType: !331, align: 8, offset: 128)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<fn(proc_macro::TokenStream) -> proc_macro::TokenStream>", scope: !58, file: !2, align: 8, elements: !27, templateParams: !332, identifier: "10277d79c0b195dcd589b2656da817e0")
!332 = !{!333}
!333 = !DITemplateTypeParameter(name: "T", type: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(proc_macro::TokenStream) -> proc_macro::TokenStream", baseType: !335, size: 64, align: 64, dwarfAddressSpace: 0)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !337}
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !221, file: !2, size: 32, align: 32, elements: !338, templateParams: !27, identifier: "92ca8ef9bc6e2b4863b0959f9c97216e")
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !337, file: !2, baseType: !340, size: 32, align: 32)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<proc_macro::bridge::client::TokenStream>", scope: !20, file: !2, size: 32, align: 32, elements: !341, templateParams: !27, identifier: "8ad0b25bb8d31228302e94cee0a24034")
!341 = !{!342}
!342 = !DICompositeType(tag: DW_TAG_variant_part, scope: !340, file: !2, size: 32, align: 32, elements: !343, templateParams: !27, identifier: "74e7cf86130dadfdfb4eb9fb5d8c5ce4", discriminator: !362)
!343 = !{!344, !358}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !342, file: !2, baseType: !345, size: 32, align: 32, extraData: i64 0)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !340, file: !2, size: 32, align: 32, elements: !27, templateParams: !346, identifier: "51a5de093dc0919c17bbc4e5158ef522")
!346 = !{!347}
!347 = !DITemplateTypeParameter(name: "T", type: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "TokenStream", scope: !239, file: !2, size: 32, align: 32, elements: !349, templateParams: !27, identifier: "d9e64564679f5fcbdec22187d04d0987")
!349 = !{!350, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !348, file: !2, baseType: !351, size: 32, align: 32)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU32", scope: !352, file: !2, size: 32, align: 32, elements: !354, templateParams: !27, identifier: "e46ff5734dc27d2ff94aac449842093")
!352 = !DINamespace(name: "nonzero", scope: !353)
!353 = !DINamespace(name: "num", scope: !21)
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !351, file: !2, baseType: !356, size: 32, align: 32)
!356 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !348, file: !2, baseType: !326, align: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !342, file: !2, baseType: !359, size: 32, align: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !340, file: !2, size: 32, align: 32, elements: !360, templateParams: !346, identifier: "543621716dfd29ee353ce82dd9490845")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !359, file: !2, baseType: !348, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, scope: !340, file: !2, baseType: !356, size: 32, align: 32, flags: DIFlagArtificial)
!363 = !{!364, !365}
!364 = !DITemplateTypeParameter(name: "I", type: !337)
!365 = !DITemplateTypeParameter(name: "O", type: !337)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Attr", scope: !242, file: !2, baseType: !367, size: 448, align: 64, extraData: i64 1)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Attr", scope: !238, file: !2, size: 448, align: 64, elements: !368, templateParams: !27, identifier: "dc352e3c8e4cf28720a68070a7d998d2")
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !2, baseType: !202, size: 128, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !367, file: !2, baseType: !371, size: 128, align: 64, offset: 192)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client<(proc_macro::TokenStream, proc_macro::TokenStream), proc_macro::TokenStream>", scope: !239, file: !2, size: 128, align: 64, elements: !372, templateParams: !386, identifier: "ada14285547462f6acbabdf1de63eec0")
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "get_handle_counters", scope: !371, file: !2, baseType: !258, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !371, file: !2, baseType: !282, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !371, file: !2, baseType: !376, align: 8, offset: 128)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<fn((proc_macro::TokenStream, proc_macro::TokenStream)) -> proc_macro::TokenStream>", scope: !58, file: !2, align: 8, elements: !27, templateParams: !377, identifier: "2b5967d5296cf6d4ea0bbe5c0167b767")
!377 = !{!378}
!378 = !DITemplateTypeParameter(name: "T", type: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn((proc_macro::TokenStream, proc_macro::TokenStream)) -> proc_macro::TokenStream", baseType: !380, size: 64, align: 64, dwarfAddressSpace: 0)
!380 = !DISubroutineType(types: !381)
!381 = !{!337, !382}
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "(proc_macro::TokenStream, proc_macro::TokenStream)", file: !2, size: 64, align: 32, elements: !383, templateParams: !27, identifier: "af8de5f6083ea7e5431ff9973c5541e2")
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !2, baseType: !337, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !382, file: !2, baseType: !337, size: 32, align: 32, offset: 32)
!386 = !{!387, !365}
!387 = !DITemplateTypeParameter(name: "I", type: !382)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Bang", scope: !242, file: !2, baseType: !389, size: 448, align: 64, extraData: i64 2)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bang", scope: !238, file: !2, size: 448, align: 64, elements: !390, templateParams: !27, identifier: "d2a17108da42cd68ff239ec74328f674")
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !2, baseType: !202, size: 128, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !389, file: !2, baseType: !255, size: 128, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !2, baseType: !356, size: 32, align: 32, flags: DIFlagArtificial)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !234, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!395 = !{i32 7, !"PIC Level", i32 2}
!396 = !{i32 2, !"RtLibUseGOT", i32 1}
!397 = !{i32 2, !"Dwarf Version", i32 4}
!398 = !{i32 2, !"Debug Info Version", i32 3}
!399 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !400, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !401, globals: !498)
!400 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_input-0.2.1/src/lib.rs/@/f128_input.d0c3c3a7-cgu.0", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_input-0.2.1")
!401 = !{!402, !411, !135, !479, !485, !492}
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !403, file: !2, baseType: !53, size: 8, align: 8, flags: DIFlagEnumClass, elements: !406)
!403 = !DINamespace(name: "v1", scope: !404)
!404 = !DINamespace(name: "rt", scope: !405)
!405 = !DINamespace(name: "fmt", scope: !21)
!406 = !{!407, !408, !409, !410}
!407 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!408 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!409 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!410 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !412, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagEnumClass, elements: !414)
!412 = !DINamespace(name: "valid_align", scope: !413)
!413 = !DINamespace(name: "mem", scope: !21)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!415 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!416 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!417 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!418 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!419 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!420 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!421 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!422 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!423 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!424 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!425 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!426 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!427 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!428 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!429 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!430 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!431 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!432 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!433 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!434 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!435 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!436 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!437 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!438 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!439 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!440 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!441 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!442 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!443 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!444 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!445 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!446 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!447 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!448 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!449 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!450 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!451 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!452 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!453 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!454 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!455 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!456 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!457 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!458 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!459 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!460 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!461 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!462 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!463 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!464 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!465 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!466 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!467 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!468 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!469 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!470 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!471 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!472 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!473 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!474 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!475 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!476 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!477 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!478 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DtorState", scope: !480, file: !2, baseType: !53, size: 8, align: 8, flags: DIFlagEnumClass, elements: !481)
!480 = !DINamespace(name: "fast", scope: !92)
!481 = !{!482, !483, !484}
!482 = !DIEnumerator(name: "Unregistered", value: 0, isUnsigned: true)
!483 = !DIEnumerator(name: "Registered", value: 1, isUnsigned: true)
!484 = !DIEnumerator(name: "RunningOrHasRun", value: 2, isUnsigned: true)
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !486, file: !2, baseType: !487, size: 8, align: 8, flags: DIFlagEnumClass, elements: !488)
!486 = !DINamespace(name: "cmp", scope: !21)
!487 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!488 = !{!489, !490, !491}
!489 = !DIEnumerator(name: "Less", value: 255)
!490 = !DIEnumerator(name: "Equal", value: 0)
!491 = !DIEnumerator(name: "Greater", value: 1)
!492 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !493, file: !2, baseType: !53, size: 8, align: 8, flags: DIFlagEnumClass, elements: !494)
!493 = !DINamespace(name: "panicking", scope: !21)
!494 = !{!495, !496, !497}
!495 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!496 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!497 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!498 = !{!0, !74, !83, !94, !212, !222, !230}
!499 = distinct !DISubprogram(name: "index", linkageName: "_ZN100_$LT$alloc..string..String$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17h5b81c5e26663cc31E", scope: !501, file: !500, line: 2341, type: !502, scopeLine: 2341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !27, retainedNodes: !516)
!500 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "e1c2cdf24b94f38a53da13b30e8aa8ef")
!501 = !DINamespace(name: "{impl#28}", scope: !31)
!502 = !DISubroutineType(types: !503)
!503 = !{!202, !504, !505, !508}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !506, file: !2, align: 8, elements: !27, identifier: "63a67109926f3a3dc00488fbc228c0f9")
!506 = !DINamespace(name: "range", scope: !507)
!507 = !DINamespace(name: "ops", scope: !21)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !510, file: !2, size: 192, align: 64, elements: !512, templateParams: !27, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!510 = !DINamespace(name: "location", scope: !511)
!511 = !DINamespace(name: "panic", scope: !21)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !509, file: !2, baseType: !202, size: 128, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !509, file: !2, baseType: !356, size: 32, align: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !509, file: !2, baseType: !356, size: 32, align: 32, offset: 160)
!516 = !{!517, !518}
!517 = !DILocalVariable(name: "self", arg: 1, scope: !499, file: !500, line: 2341, type: !504)
!518 = !DILocalVariable(name: "_index", arg: 2, scope: !499, file: !500, line: 2341, type: !505)
!519 = !DILocation(line: 2341, column: 14, scope: !499)
!520 = !DILocation(line: 2341, column: 21, scope: !499)
!521 = !DILocation(line: 2342, column: 43, scope: !499)
!522 = !DILocalVariable(name: "self", scope: !523, file: !500, line: 2342, type: !533, align: 8)
!523 = !DILexicalBlockFile(scope: !524, file: !500, discriminator: 0)
!524 = distinct !DISubprogram(name: "deref<u8, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$core..ops..deref..Deref$GT$5deref17h609659c293a24929E", scope: !526, file: !525, line: 2531, type: !527, scopeLine: 2531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !63, retainedNodes: !534)
!525 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/alloc/src/vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ccced07f4d2284e276bdff9c5cb81e82")
!526 = !DINamespace(name: "{impl#10}", scope: !36)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !533}
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !530, templateParams: !27, identifier: "7d49e60d2ca720f66806f7375f860e2")
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !529, file: !2, baseType: !205, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !529, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!534 = !{!522}
!535 = !DILocation(line: 2342, column: 43, scope: !523, inlinedAt: !521)
!536 = !DILocalVariable(name: "data", scope: !537, file: !500, line: 2342, type: !52, align: 8)
!537 = !DILexicalBlockFile(scope: !538, file: !500, discriminator: 0)
!538 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h56ee2ae194163066E", scope: !540, file: !539, line: 90, type: !542, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !544)
!539 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "bc05ab33aeb77226885613c6dc511a0a")
!540 = !DINamespace(name: "raw", scope: !541)
!541 = !DINamespace(name: "slice", scope: !21)
!542 = !DISubroutineType(types: !543)
!543 = !{!529, !52, !9}
!544 = !{!536, !545, !546}
!545 = !DILocalVariable(name: "len", scope: !537, file: !500, line: 2342, type: !9, align: 8)
!546 = !DILocalVariable(name: "runtime", scope: !547, file: !500, line: 2342, type: !550, align: 8)
!547 = !DILexicalBlockFile(scope: !548, file: !500, discriminator: 0)
!548 = distinct !DILexicalBlock(scope: !538, file: !549, line: 2336, column: 13)
!549 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "f96ba730d7cf23ae45fdc72e7caf5f1b")
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !551, file: !2, size: 128, align: 64, elements: !552, templateParams: !27, identifier: "ca6adac9bf5585e57d20f143c4c8a4b5")
!551 = !DINamespace(name: "from_raw_parts", scope: !540)
!552 = !{!553, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__data", scope: !550, file: !2, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const u8", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__len", scope: !550, file: !2, baseType: !556, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!557 = !DILocation(line: 2342, column: 43, scope: !537, inlinedAt: !558)
!558 = !DILocation(line: 2532, column: 18, scope: !524, inlinedAt: !521)
!559 = !DILocalVariable(name: "data", scope: !560, file: !500, line: 2342, type: !52, align: 8)
!560 = !DILexicalBlockFile(scope: !561, file: !500, discriminator: 0)
!561 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h6cf0bcc2226f7384E", scope: !45, file: !562, line: 695, type: !563, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !569)
!562 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !52, !9}
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !566, templateParams: !27, identifier: "7b54d414f2f329e57c9aa3e4ca07f4")
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !565, file: !2, baseType: !205, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !565, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!569 = !{!559, !570}
!570 = !DILocalVariable(name: "len", scope: !560, file: !500, line: 2342, type: !9, align: 8)
!571 = !DILocation(line: 2342, column: 43, scope: !560, inlinedAt: !572)
!572 = !DILocation(line: 97, column: 11, scope: !538, inlinedAt: !558)
!573 = !DILocalVariable(name: "self", scope: !574, file: !500, line: 2342, type: !52, align: 8)
!574 = !DILexicalBlockFile(scope: !575, file: !500, discriminator: 0)
!575 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hb0bf0b669ab1d998E", scope: !577, file: !576, line: 46, type: !579, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !582, retainedNodes: !581)
!576 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!577 = !DINamespace(name: "{impl#0}", scope: !578)
!578 = !DINamespace(name: "const_ptr", scope: !45)
!579 = !DISubroutineType(types: !580)
!580 = !{!6, !52}
!581 = !{!573}
!582 = !{!55, !583}
!583 = !DITemplateTypeParameter(name: "U", type: !7)
!584 = !DILocation(line: 2342, column: 43, scope: !574, inlinedAt: !585)
!585 = !DILocation(line: 696, column: 20, scope: !561, inlinedAt: !572)
!586 = !DILocalVariable(name: "data_address", scope: !587, file: !500, line: 2342, type: !6, align: 8)
!587 = !DILexicalBlockFile(scope: !588, file: !500, discriminator: 0)
!588 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h496989047ed841a4E", scope: !590, file: !589, line: 110, type: !591, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !593)
!589 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!590 = !DINamespace(name: "metadata", scope: !45)
!591 = !DISubroutineType(types: !592)
!592 = !{!565, !6, !9}
!593 = !{!586, !594}
!594 = !DILocalVariable(name: "metadata", scope: !587, file: !500, line: 2342, type: !9, align: 8)
!595 = !DILocation(line: 2342, column: 43, scope: !587, inlinedAt: !596)
!596 = !DILocation(line: 696, column: 5, scope: !561, inlinedAt: !572)
!597 = !DILocalVariable(name: "v", scope: !598, file: !500, line: 2342, type: !529, align: 8)
!598 = !DILexicalBlockFile(scope: !599, file: !500, discriminator: 0)
!599 = distinct !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN4core3str8converts19from_utf8_unchecked17hcd20fde6de9d471cE", scope: !601, file: !600, line: 170, type: !603, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !27, retainedNodes: !605)
!600 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "459d256946ab11c35b95264d728167a0")
!601 = !DINamespace(name: "converts", scope: !602)
!602 = !DINamespace(name: "str", scope: !21)
!603 = !DISubroutineType(types: !604)
!604 = !{!202, !529}
!605 = !{!597}
!606 = !DILocation(line: 2342, column: 18, scope: !598, inlinedAt: !607)
!607 = !DILocation(line: 2342, column: 18, scope: !499)
!608 = !{i64 1}
!609 = !DILocation(line: 2343, column: 6, scope: !499)
!610 = distinct !DISubprogram(name: "encode<()>", linkageName: "_ZN100_$LT$proc_macro..bridge..client..TokenStream$u20$as$u20$proc_macro..bridge..rpc..Encode$LT$S$GT$$GT$6encode17h1c05180f801e837eE", scope: !612, file: !611, line: 67, type: !613, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !622, retainedNodes: !616)
!611 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/proc_macro/src/bridge/client.rs", directory: "", checksumkind: CSK_MD5, checksum: "29b98a70c46716230bba99b5d50c99ad")
!612 = !DINamespace(name: "{impl#26}", scope: !239)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !348, !615, !319}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut proc_macro::bridge::buffer::Buffer", baseType: !285, size: 64, align: 64, dwarfAddressSpace: 0)
!616 = !{!617, !618, !619, !620}
!617 = !DILocalVariable(name: "self", arg: 1, scope: !610, file: !611, line: 67, type: !348)
!618 = !DILocalVariable(name: "w", arg: 2, scope: !610, file: !611, line: 67, type: !615)
!619 = !DILocalVariable(name: "s", arg: 3, scope: !610, file: !611, line: 67, type: !319)
!620 = !DILocalVariable(name: "handle", scope: !621, file: !611, line: 68, type: !351, align: 4)
!621 = distinct !DILexicalBlock(scope: !610, file: !611, line: 68, column: 21)
!622 = !{!623}
!623 = !DITemplateTypeParameter(name: "S", type: !7)
!624 = !DILocation(line: 67, column: 27, scope: !610)
!625 = !DILocation(line: 67, column: 33, scope: !610)
!626 = !DILocation(line: 67, column: 49, scope: !610)
!627 = !DILocation(line: 68, column: 34, scope: !610)
!628 = !DILocation(line: 68, column: 25, scope: !621)
!629 = !DILocation(line: 70, column: 21, scope: !621)
!630 = !DILocation(line: 71, column: 18, scope: !610)
!631 = distinct !DISubprogram(name: "decode<()>", linkageName: "_ZN103_$LT$proc_macro..bridge..client..TokenStream$u20$as$u20$proc_macro..bridge..rpc..DecodeMut$LT$S$GT$$GT$6decode17he5ea93e573f0561cE", scope: !632, file: !611, line: 122, type: !633, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !622, retainedNodes: !636)
!632 = !DINamespace(name: "{impl#33}", scope: !239)
!633 = !DISubroutineType(types: !634)
!634 = !{!348, !635, !319}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &[u8]", baseType: !529, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !{!637, !638}
!637 = !DILocalVariable(name: "r", arg: 1, scope: !631, file: !611, line: 122, type: !635)
!638 = !DILocalVariable(name: "s", arg: 2, scope: !631, file: !611, line: 122, type: !319)
!639 = !DILocation(line: 122, column: 27, scope: !631)
!640 = !DILocation(line: 122, column: 47, scope: !631)
!641 = !DILocation(line: 124, column: 33, scope: !631)
!642 = !{i32 1, i32 0}
!643 = !DILocation(line: 123, column: 21, scope: !631)
!644 = !DILocation(line: 127, column: 18, scope: !631)
!645 = distinct !DISubprogram(name: "get_unchecked_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h6f044855ca2f8af0E", scope: !647, file: !646, line: 291, type: !649, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !661)
!646 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!647 = !DINamespace(name: "{impl#3}", scope: !648)
!648 = !DINamespace(name: "index", scope: !541)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !655, !651}
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u8]", file: !2, size: 128, align: 64, elements: !652, templateParams: !27, identifier: "2081d302591cc0e6b89f57ab75a79c1e")
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !651, file: !2, baseType: !205, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !506, file: !2, size: 128, align: 64, elements: !656, templateParams: !659, identifier: "855eb37746b15049ea4556b174e97dd7")
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !655, file: !2, baseType: !9, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !655, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!659 = !{!660}
!660 = !DITemplateTypeParameter(name: "Idx", type: !9)
!661 = !{!662, !663, !664}
!662 = !DILocalVariable(name: "self", arg: 1, scope: !645, file: !646, line: 291, type: !655)
!663 = !DILocalVariable(name: "slice", arg: 2, scope: !645, file: !646, line: 291, type: !651)
!664 = !DILocalVariable(name: "runtime", scope: !665, file: !646, line: 294, type: !667, align: 8)
!665 = !DILexicalBlockFile(scope: !666, file: !646, discriminator: 0)
!666 = distinct !DILexicalBlock(scope: !645, file: !549, line: 2336, column: 13)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !668, file: !2, size: 192, align: 64, elements: !669, templateParams: !27, identifier: "28ce5b8f96862f9bf6a66e974f54fbc9")
!668 = !DINamespace(name: "get_unchecked_mut", scope: !647)
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__start", scope: !667, file: !2, baseType: !556, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__end", scope: !667, file: !2, baseType: !556, size: 64, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__slice", scope: !667, file: !2, baseType: !673, size: 64, align: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*mut [u8]", baseType: !651, size: 64, align: 64, dwarfAddressSpace: 0)
!674 = !DILocation(line: 291, column: 33, scope: !645)
!675 = !DILocation(line: 291, column: 39, scope: !645)
!676 = !DILocation(line: 294, column: 13, scope: !665)
!677 = !DILocation(line: 295, column: 43, scope: !645)
!678 = !DILocalVariable(name: "self", scope: !679, file: !646, line: 295, type: !651, align: 8)
!679 = !DILexicalBlockFile(scope: !680, file: !646, discriminator: 0)
!680 = distinct !DISubprogram(name: "as_mut_ptr<u8>", linkageName: "_ZN4core3ptr7mut_ptr41_$LT$impl$u20$$BP$mut$u20$$u5b$T$u5d$$GT$10as_mut_ptr17h7fd536a97e153cfbE", scope: !682, file: !681, line: 1778, type: !684, scopeLine: 1778, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !686)
!681 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "6672664af50614ec3c026afd55307af7")
!682 = !DINamespace(name: "{impl#1}", scope: !683)
!683 = !DINamespace(name: "mut_ptr", scope: !45)
!684 = !DISubroutineType(types: !685)
!685 = !{!289, !651}
!686 = !{!678}
!687 = !DILocation(line: 295, column: 43, scope: !679, inlinedAt: !677)
!688 = !DILocalVariable(name: "self", scope: !689, file: !646, line: 295, type: !289, align: 8)
!689 = !DILexicalBlockFile(scope: !690, file: !646, discriminator: 0)
!690 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hce95b2f782375a87E", scope: !691, file: !681, line: 985, type: !692, scopeLine: 985, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !694)
!691 = !DINamespace(name: "{impl#0}", scope: !683)
!692 = !DISubroutineType(types: !693)
!693 = !{!289, !289, !9}
!694 = !{!688, !695}
!695 = !DILocalVariable(name: "count", scope: !689, file: !646, line: 295, type: !9, align: 8)
!696 = !DILocation(line: 295, column: 43, scope: !689, inlinedAt: !677)
!697 = !DILocation(line: 295, column: 66, scope: !645)
!698 = !DILocalVariable(name: "self", scope: !699, file: !646, line: 295, type: !289, align: 8)
!699 = !DILexicalBlockFile(scope: !700, file: !646, discriminator: 0)
!700 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h774ff863e67a55bdE", scope: !691, file: !681, line: 465, type: !701, scopeLine: 465, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!289, !289, !703}
!703 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!704 = !{!698, !705}
!705 = !DILocalVariable(name: "count", scope: !699, file: !646, line: 295, type: !703, align: 8)
!706 = !DILocation(line: 295, column: 43, scope: !699, inlinedAt: !707)
!707 = !DILocation(line: 990, column: 18, scope: !690, inlinedAt: !677)
!708 = !DILocalVariable(name: "data", scope: !709, file: !646, line: 295, type: !289, align: 8)
!709 = !DILexicalBlockFile(scope: !710, file: !646, discriminator: 0)
!710 = distinct !DISubprogram(name: "slice_from_raw_parts_mut<u8>", linkageName: "_ZN4core3ptr24slice_from_raw_parts_mut17ha3e4fadd5446249cE", scope: !45, file: !562, line: 727, type: !711, scopeLine: 727, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{!651, !289, !9}
!713 = !{!708, !714}
!714 = !DILocalVariable(name: "len", scope: !709, file: !646, line: 295, type: !9, align: 8)
!715 = !DILocation(line: 295, column: 13, scope: !709, inlinedAt: !716)
!716 = !DILocation(line: 295, column: 13, scope: !645)
!717 = !DILocation(line: 295, column: 79, scope: !645)
!718 = !DILocalVariable(name: "self", scope: !719, file: !646, line: 295, type: !289, align: 8)
!719 = !DILexicalBlockFile(scope: !720, file: !646, discriminator: 0)
!720 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$4cast17hde28230253ee19baE", scope: !691, file: !681, line: 45, type: !721, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !582, retainedNodes: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{!329, !289}
!723 = !{!718}
!724 = !DILocation(line: 295, column: 13, scope: !719, inlinedAt: !725)
!725 = !DILocation(line: 728, column: 24, scope: !710, inlinedAt: !716)
!726 = !DILocalVariable(name: "data_address", scope: !727, file: !646, line: 295, type: !329, align: 8)
!727 = !DILexicalBlockFile(scope: !728, file: !646, discriminator: 0)
!728 = distinct !DISubprogram(name: "from_raw_parts_mut<[u8]>", linkageName: "_ZN4core3ptr8metadata18from_raw_parts_mut17h56bd1c6bd84c489bE", scope: !590, file: !589, line: 127, type: !729, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{!651, !329, !9}
!731 = !{!726, !732}
!732 = !DILocalVariable(name: "metadata", scope: !727, file: !646, line: 295, type: !9, align: 8)
!733 = !DILocation(line: 295, column: 13, scope: !727, inlinedAt: !734)
!734 = !DILocation(line: 728, column: 5, scope: !710, inlinedAt: !716)
!735 = !DILocation(line: 297, column: 6, scope: !645)
!736 = distinct !DISubprogram(name: "get<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$3get17hcac955a39670c74cE", scope: !647, file: !646, line: 258, type: !737, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !752)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !655, !529}
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[u8]>", scope: !20, file: !2, size: 128, align: 64, elements: !740, templateParams: !27, identifier: "a10dd6c8cbc031c66bcb157397a8ab34")
!740 = !{!741}
!741 = !DICompositeType(tag: DW_TAG_variant_part, scope: !739, file: !2, size: 128, align: 64, elements: !742, templateParams: !27, identifier: "f5a6694eae942d8dfdfecb1108411145", discriminator: !751)
!742 = !{!743, !747}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !741, file: !2, baseType: !744, size: 128, align: 64, extraData: i64 0)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !739, file: !2, size: 128, align: 64, elements: !27, templateParams: !745, identifier: "f917b5f3e834899fdc042dd32762d34c")
!745 = !{!746}
!746 = !DITemplateTypeParameter(name: "T", type: !529)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !741, file: !2, baseType: !748, size: 128, align: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !739, file: !2, size: 128, align: 64, elements: !749, templateParams: !745, identifier: "ec71ed770ec76ed84081bfa9fc187739")
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !748, file: !2, baseType: !529, size: 128, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, scope: !739, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagArtificial)
!752 = !{!753, !754}
!753 = !DILocalVariable(name: "self", arg: 1, scope: !736, file: !646, line: 258, type: !655)
!754 = !DILocalVariable(name: "slice", arg: 2, scope: !736, file: !646, line: 258, type: !529)
!755 = !DILocation(line: 258, column: 12, scope: !736)
!756 = !DILocation(line: 258, column: 18, scope: !736)
!757 = !DILocation(line: 259, column: 12, scope: !736)
!758 = !DILocation(line: 259, column: 37, scope: !736)
!759 = !{i8 0, i8 2}
!760 = !DILocation(line: 263, column: 29, scope: !736)
!761 = !DILocation(line: 260, column: 13, scope: !736)
!762 = !DILocation(line: 259, column: 9, scope: !736)
!763 = !DILocation(line: 265, column: 6, scope: !736)
!764 = !DILocation(line: 263, column: 22, scope: !736)
!765 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h49eca17de111d561E", scope: !647, file: !646, line: 311, type: !766, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !54, retainedNodes: !772)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !655, !768, !508}
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !769, templateParams: !27, identifier: "188333407bebfa65121ceca786627665")
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !768, file: !2, baseType: !205, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !768, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!772 = !{!773, !774}
!773 = !DILocalVariable(name: "self", arg: 1, scope: !765, file: !646, line: 311, type: !655)
!774 = !DILocalVariable(name: "slice", arg: 2, scope: !765, file: !646, line: 311, type: !768)
!775 = !DILocation(line: 311, column: 18, scope: !765)
!776 = !DILocation(line: 311, column: 24, scope: !765)
!777 = !DILocation(line: 312, column: 12, scope: !765)
!778 = !DILocation(line: 314, column: 19, scope: !765)
!779 = !DILocation(line: 313, column: 13, scope: !765)
!780 = !DILocation(line: 318, column: 24, scope: !765)
!781 = !DILocation(line: 315, column: 13, scope: !765)
!782 = !DILocation(line: 319, column: 6, scope: !765)
!783 = distinct !DISubprogram(name: "decode<(), proc_macro::bridge::client::Span>", linkageName: "_ZN107_$LT$proc_macro..bridge..ExpnGlobals$LT$Span$GT$$u20$as$u20$proc_macro..bridge..rpc..DecodeMut$LT$S$GT$$GT$6decode17h8296fd1bf7e4ce1dE", scope: !785, file: !784, line: 55, type: !786, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !802, retainedNodes: !799)
!784 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/proc_macro/src/bridge/rpc.rs", directory: "", checksumkind: CSK_MD5, checksum: "1b8c74438fc3d919e1a0fa4aa0d68687")
!785 = !DINamespace(name: "{impl#111}", scope: !240)
!786 = !DISubroutineType(types: !787)
!787 = !{!788, !635, !319}
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExpnGlobals<proc_macro::bridge::client::Span>", scope: !240, file: !2, size: 96, align: 32, elements: !789, templateParams: !797, identifier: "7205b8b1d4fb5fe219093a5b3a12a7ba")
!789 = !{!790, !795, !796}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "def_site", scope: !788, file: !2, baseType: !791, size: 32, align: 32)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !239, file: !2, size: 32, align: 32, elements: !792, templateParams: !27, identifier: "8960f0fb59aa19baf9f69b5743da8a6")
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !791, file: !2, baseType: !351, size: 32, align: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !791, file: !2, baseType: !326, align: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "call_site", scope: !788, file: !2, baseType: !791, size: 32, align: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mixed_site", scope: !788, file: !2, baseType: !791, size: 32, align: 32, offset: 64)
!797 = !{!798}
!798 = !DITemplateTypeParameter(name: "Span", type: !791)
!799 = !{!800, !801}
!800 = !DILocalVariable(name: "r", arg: 1, scope: !783, file: !784, line: 55, type: !635)
!801 = !DILocalVariable(name: "s", arg: 2, scope: !783, file: !784, line: 55, type: !319)
!802 = !{!623, !798}
!803 = !DILocation(line: 55, column: 23, scope: !783)
!804 = !DILocation(line: 55, column: 43, scope: !783)
!805 = !DILocation(line: 57, column: 31, scope: !783)
!806 = !DILocation(line: 58, column: 17, scope: !783)
!807 = !DILocation(line: 56, column: 17, scope: !783)
!808 = !DILocation(line: 59, column: 14, scope: !783)
!809 = !DILocation(line: 55, column: 13, scope: !783)
!810 = distinct !DISubprogram(name: "encode<(), &str>", linkageName: "_ZN10proc_macro6bridge100_$LT$impl$u20$proc_macro..bridge..rpc..Encode$LT$S$GT$$u20$for$u20$core..option..Option$LT$T$GT$$GT$6encode17h0ce7338230398f4dE", scope: !811, file: !784, line: 64, type: !812, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !833, retainedNodes: !827)
!811 = !DINamespace(name: "{impl#61}", scope: !240)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !814, !615, !319}
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !20, file: !2, size: 128, align: 64, elements: !815, templateParams: !27, identifier: "f0dceda904e27e7388d0262de24b6976")
!815 = !{!816}
!816 = !DICompositeType(tag: DW_TAG_variant_part, scope: !814, file: !2, size: 128, align: 64, elements: !817, templateParams: !27, identifier: "d9a20f3bc7236076b658193a0ee41dce", discriminator: !826)
!817 = !{!818, !822}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !816, file: !2, baseType: !819, size: 128, align: 64, extraData: i64 0)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !814, file: !2, size: 128, align: 64, elements: !27, templateParams: !820, identifier: "8b8f8f73f03135e6d73de6ca26c771a5")
!820 = !{!821}
!821 = !DITemplateTypeParameter(name: "T", type: !202)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !816, file: !2, baseType: !823, size: 128, align: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !814, file: !2, size: 128, align: 64, elements: !824, templateParams: !820, identifier: "5f24cd570c5cc19be11f0051a0b188da")
!824 = !{!825}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !823, file: !2, baseType: !202, size: 128, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, scope: !814, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagArtificial)
!827 = !{!828, !829, !830, !831}
!828 = !DILocalVariable(name: "self", arg: 1, scope: !810, file: !784, line: 64, type: !814)
!829 = !DILocalVariable(name: "w", arg: 2, scope: !810, file: !784, line: 64, type: !615)
!830 = !DILocalVariable(name: "s", arg: 3, scope: !810, file: !784, line: 64, type: !319)
!831 = !DILocalVariable(name: "t", scope: !832, file: !784, line: 75, type: !202, align: 8)
!832 = distinct !DILexicalBlock(scope: !810, file: !784, line: 75, column: 23)
!833 = !{!623, !821}
!834 = !DILocation(line: 64, column: 23, scope: !810)
!835 = !DILocation(line: 64, column: 29, scope: !810)
!836 = !DILocation(line: 64, column: 45, scope: !810)
!837 = !DILocation(line: 74, column: 23, scope: !810)
!838 = !DILocation(line: 74, column: 17, scope: !810)
!839 = !DILocation(line: 76, column: 25, scope: !810)
!840 = !DILocation(line: 75, column: 42, scope: !810)
!841 = !DILocation(line: 75, column: 42, scope: !832)
!842 = !DILocation(line: 76, column: 25, scope: !832)
!843 = !DILocation(line: 78, column: 21, scope: !810)
!844 = !DILocation(line: 77, column: 27, scope: !832)
!845 = !DILocation(line: 64, column: 13, scope: !810)
!846 = !DILocation(line: 80, column: 14, scope: !810)
!847 = !DILocation(line: 75, column: 55, scope: !810)
!848 = distinct !DISubprogram(name: "encode<(), proc_macro::bridge::client::TokenStream>", linkageName: "_ZN10proc_macro6bridge100_$LT$impl$u20$proc_macro..bridge..rpc..Encode$LT$S$GT$$u20$for$u20$core..option..Option$LT$T$GT$$GT$6encode17haa31a8d681da04b6E", scope: !811, file: !784, line: 64, type: !849, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !857, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !340, !615, !319}
!851 = !{!852, !853, !854, !855}
!852 = !DILocalVariable(name: "self", arg: 1, scope: !848, file: !784, line: 64, type: !340)
!853 = !DILocalVariable(name: "w", arg: 2, scope: !848, file: !784, line: 64, type: !615)
!854 = !DILocalVariable(name: "s", arg: 3, scope: !848, file: !784, line: 64, type: !319)
!855 = !DILocalVariable(name: "t", scope: !856, file: !784, line: 75, type: !348, align: 4)
!856 = distinct !DILexicalBlock(scope: !848, file: !784, line: 75, column: 23)
!857 = !{!623, !347}
!858 = !DILocation(line: 64, column: 23, scope: !848)
!859 = !DILocation(line: 64, column: 29, scope: !848)
!860 = !DILocation(line: 64, column: 45, scope: !848)
!861 = !DILocation(line: 75, column: 42, scope: !856)
!862 = !DILocation(line: 74, column: 23, scope: !848)
!863 = !DILocation(line: 74, column: 17, scope: !848)
!864 = !DILocation(line: 76, column: 25, scope: !848)
!865 = !DILocation(line: 75, column: 42, scope: !848)
!866 = !DILocation(line: 76, column: 25, scope: !856)
!867 = !DILocation(line: 78, column: 21, scope: !848)
!868 = !DILocation(line: 77, column: 27, scope: !856)
!869 = !DILocation(line: 64, column: 13, scope: !848)
!870 = !DILocation(line: 80, column: 14, scope: !848)
!871 = !DILocation(line: 75, column: 55, scope: !848)
!872 = distinct !DISubprogram(name: "encode<(), (), proc_macro::bridge::rpc::PanicMessage>", linkageName: "_ZN10proc_macro6bridge104_$LT$impl$u20$proc_macro..bridge..rpc..Encode$LT$S$GT$$u20$for$u20$core..result..Result$LT$T$C$E$GT$$GT$6encode17h3118e371acb46529E", scope: !873, file: !784, line: 64, type: !874, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !916, retainedNodes: !908)
!873 = !DINamespace(name: "{impl#65}", scope: !240)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !876, !615, !319}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), proc_macro::bridge::rpc::PanicMessage>", scope: !877, file: !2, size: 256, align: 64, elements: !878, templateParams: !27, identifier: "9ccfc9648ef81705a5ec66a9c1389782")
!877 = !DINamespace(name: "result", scope: !21)
!878 = !{!879}
!879 = !DICompositeType(tag: DW_TAG_variant_part, scope: !876, file: !2, size: 256, align: 64, elements: !880, templateParams: !27, identifier: "66dfbabdccd4c3a996173a06de12008b", discriminator: !907)
!880 = !{!881, !903}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !879, file: !2, baseType: !882, size: 256, align: 64, extraData: i64 3)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !876, file: !2, size: 256, align: 64, elements: !883, templateParams: !885, identifier: "f41abf871d4424b9ce8927a7619bfe49")
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !882, file: !2, baseType: !7, align: 8)
!885 = !{!115, !886}
!886 = !DITemplateTypeParameter(name: "E", type: !887)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicMessage", scope: !888, file: !2, size: 256, align: 64, elements: !889, templateParams: !27, identifier: "5a4b103add782fff8c5ebb9114cd0bcd")
!888 = !DINamespace(name: "rpc", scope: !240)
!889 = !{!890}
!890 = !DICompositeType(tag: DW_TAG_variant_part, scope: !887, file: !2, size: 256, align: 64, elements: !891, templateParams: !27, identifier: "7e213e776ece2cc097433395bc9cce1c", discriminator: !902)
!891 = !{!892, !896, !900}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "StaticStr", scope: !890, file: !2, baseType: !893, size: 256, align: 64, extraData: i64 0)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "StaticStr", scope: !887, file: !2, size: 256, align: 64, elements: !894, templateParams: !27, identifier: "b47eeba1e64cb478f9929a43c96ce616")
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !893, file: !2, baseType: !202, size: 128, align: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "String", scope: !890, file: !2, baseType: !897, size: 256, align: 64, extraData: i64 1)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !887, file: !2, size: 256, align: 64, elements: !898, templateParams: !27, identifier: "6f8ac1b35a4e234d454ee2d7c66ccbaa")
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !897, file: !2, baseType: !30, size: 192, align: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Unknown", scope: !890, file: !2, baseType: !901, size: 256, align: 64, extraData: i64 2)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unknown", scope: !887, file: !2, size: 256, align: 64, elements: !27, identifier: "e2d1aacb0868f1bce00e19879cc87870")
!902 = !DIDerivedType(tag: DW_TAG_member, scope: !887, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagArtificial)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !879, file: !2, baseType: !904, size: 256, align: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !876, file: !2, size: 256, align: 64, elements: !905, templateParams: !885, identifier: "8c1cea5208c7ff7aa6ce9d528a722205")
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !904, file: !2, baseType: !887, size: 256, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, scope: !876, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagArtificial)
!908 = !{!909, !910, !911, !912, !914}
!909 = !DILocalVariable(name: "self", arg: 1, scope: !872, file: !784, line: 64, type: !876)
!910 = !DILocalVariable(name: "w", arg: 2, scope: !872, file: !784, line: 64, type: !615)
!911 = !DILocalVariable(name: "s", arg: 3, scope: !872, file: !784, line: 64, type: !319)
!912 = !DILocalVariable(name: "t", scope: !913, file: !784, line: 75, type: !7, align: 1)
!913 = distinct !DILexicalBlock(scope: !872, file: !784, line: 75, column: 23)
!914 = !DILocalVariable(name: "e", scope: !915, file: !784, line: 75, type: !887, align: 8)
!915 = distinct !DILexicalBlock(scope: !872, file: !784, line: 75, column: 23)
!916 = !{!623, !115, !886}
!917 = !DILocation(line: 64, column: 23, scope: !872)
!918 = !DILocation(line: 64, column: 29, scope: !872)
!919 = !DILocation(line: 64, column: 45, scope: !872)
!920 = !DILocation(line: 75, column: 42, scope: !913)
!921 = !DILocation(line: 75, column: 42, scope: !915)
!922 = !DILocation(line: 74, column: 23, scope: !872)
!923 = !{i64 0, i64 4}
!924 = !DILocation(line: 74, column: 17, scope: !872)
!925 = !DILocation(line: 75, column: 42, scope: !872)
!926 = !DILocation(line: 76, column: 25, scope: !913)
!927 = !DILocation(line: 76, column: 25, scope: !915)
!928 = !DILocation(line: 78, column: 21, scope: !872)
!929 = !DILocation(line: 77, column: 27, scope: !915)
!930 = !DILocation(line: 64, column: 13, scope: !872)
!931 = !DILocation(line: 80, column: 14, scope: !872)
!932 = !DILocation(line: 77, column: 27, scope: !913)
!933 = distinct !DISubprogram(name: "encode<(), core::option::Option<proc_macro::bridge::client::TokenStream>, ()>", linkageName: "_ZN10proc_macro6bridge104_$LT$impl$u20$proc_macro..bridge..rpc..Encode$LT$S$GT$$u20$for$u20$core..result..Result$LT$T$C$E$GT$$GT$6encode17h8ab643544b667b03E", scope: !873, file: !784, line: 64, type: !934, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !960, retainedNodes: !952)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !936, !615, !319}
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::option::Option<proc_macro::bridge::client::TokenStream>, ()>", scope: !877, file: !2, size: 64, align: 32, elements: !937, templateParams: !27, identifier: "4c0496071425592c74394aa139fb049d")
!937 = !{!938}
!938 = !DICompositeType(tag: DW_TAG_variant_part, scope: !936, file: !2, size: 64, align: 32, elements: !939, templateParams: !27, identifier: "90c3c0e5e910ea815b8fbe70a17ec24", discriminator: !951)
!939 = !{!940, !947}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !938, file: !2, baseType: !941, size: 64, align: 32, extraData: i64 0)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !936, file: !2, size: 64, align: 32, elements: !942, templateParams: !944, identifier: "77d21a1a66ee69506957779543d8a305")
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !941, file: !2, baseType: !340, size: 32, align: 32, offset: 32)
!944 = !{!945, !946}
!945 = !DITemplateTypeParameter(name: "T", type: !340)
!946 = !DITemplateTypeParameter(name: "E", type: !7)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !938, file: !2, baseType: !948, size: 64, align: 32, extraData: i64 1)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !936, file: !2, size: 64, align: 32, elements: !949, templateParams: !944, identifier: "15a0d50a0dd0144e979bc4ed550ed752")
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !948, file: !2, baseType: !7, align: 8, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, scope: !936, file: !2, baseType: !356, size: 32, align: 32, flags: DIFlagArtificial)
!952 = !{!953, !954, !955, !956, !958}
!953 = !DILocalVariable(name: "self", arg: 1, scope: !933, file: !784, line: 64, type: !936)
!954 = !DILocalVariable(name: "w", arg: 2, scope: !933, file: !784, line: 64, type: !615)
!955 = !DILocalVariable(name: "s", arg: 3, scope: !933, file: !784, line: 64, type: !319)
!956 = !DILocalVariable(name: "t", scope: !957, file: !784, line: 75, type: !340, align: 4)
!957 = distinct !DILexicalBlock(scope: !933, file: !784, line: 75, column: 23)
!958 = !DILocalVariable(name: "e", scope: !959, file: !784, line: 75, type: !7, align: 1)
!959 = distinct !DILexicalBlock(scope: !933, file: !784, line: 75, column: 23)
!960 = !{!623, !945, !946}
!961 = !DILocation(line: 64, column: 23, scope: !933)
!962 = !DILocation(line: 64, column: 29, scope: !933)
!963 = !DILocation(line: 64, column: 45, scope: !933)
!964 = !DILocation(line: 75, column: 42, scope: !957)
!965 = !DILocation(line: 75, column: 42, scope: !959)
!966 = !DILocation(line: 74, column: 23, scope: !933)
!967 = !{i32 0, i32 2}
!968 = !DILocation(line: 74, column: 17, scope: !933)
!969 = !DILocation(line: 75, column: 42, scope: !933)
!970 = !DILocation(line: 76, column: 25, scope: !957)
!971 = !DILocation(line: 76, column: 25, scope: !959)
!972 = !DILocation(line: 78, column: 21, scope: !933)
!973 = !DILocation(line: 77, column: 27, scope: !959)
!974 = !DILocation(line: 64, column: 13, scope: !933)
!975 = !DILocation(line: 80, column: 14, scope: !933)
!976 = !DILocation(line: 77, column: 27, scope: !957)
!977 = distinct !DISubprogram(name: "new<proc_macro::bridge::client::BridgeStateL>", linkageName: "_ZN10proc_macro6bridge11scoped_cell19ScopedCell$LT$T$GT$3new17hfe6f4b7449893b9bE", scope: !979, file: !978, line: 38, type: !1014, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !1009, retainedNodes: !1016)
!978 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/proc_macro/src/bridge/scoped_cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "79706c78ecbebd2ad71b350ab7f276ec")
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScopedCell<proc_macro::bridge::client::BridgeStateL>", scope: !980, file: !2, size: 640, align: 64, elements: !981, templateParams: !1009, identifier: "a8dfdabe3ae0a26610712bae0cf85020")
!980 = !DINamespace(name: "scoped_cell", scope: !240)
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !979, file: !2, baseType: !983, size: 640, align: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<proc_macro::bridge::client::BridgeState>", scope: !271, file: !2, size: 640, align: 64, elements: !984, templateParams: !1007, identifier: "4fb39712a7540bcc8797bcb28d9a543")
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !983, file: !2, baseType: !986, size: 640, align: 64)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<proc_macro::bridge::client::BridgeState>", scope: !271, file: !2, size: 640, align: 64, elements: !987, templateParams: !1007, identifier: "c065211ed7ecae80b93558113fbb9662")
!987 = !{!988}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !986, file: !2, baseType: !989, size: 640, align: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "BridgeState", scope: !239, file: !2, size: 640, align: 64, elements: !990, templateParams: !27, identifier: "5b0811a97d3e80f2b778edd152aab6b")
!990 = !{!991}
!991 = !DICompositeType(tag: DW_TAG_variant_part, scope: !989, file: !2, size: 640, align: 64, elements: !992, templateParams: !27, identifier: "d2254adf930e2b551c47804cbc574e6e", discriminator: !1006)
!992 = !{!993, !995, !1004}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "NotConnected", scope: !991, file: !2, baseType: !994, size: 640, align: 64, extraData: i64 0)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotConnected", scope: !989, file: !2, size: 640, align: 64, elements: !27, identifier: "23883382dd10bcc0ceb3bf66a1379525")
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Connected", scope: !991, file: !2, baseType: !996, size: 640, align: 64, extraData: i64 1)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "Connected", scope: !989, file: !2, size: 640, align: 64, elements: !997, templateParams: !27, identifier: "ad72939c631b0079842008e1d3a2b0cc")
!997 = !{!998}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !996, file: !2, baseType: !999, size: 576, align: 64, offset: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bridge", scope: !239, file: !2, size: 576, align: 64, elements: !1000, templateParams: !27, identifier: "eb45a4a5b7714d6b86c0af748664179a")
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "cached_buffer", scope: !999, file: !2, baseType: !285, size: 320, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !999, file: !2, baseType: !304, size: 128, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !999, file: !2, baseType: !788, size: 96, align: 32, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "InUse", scope: !991, file: !2, baseType: !1005, size: 640, align: 64, extraData: i64 2)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "InUse", scope: !989, file: !2, size: 640, align: 64, elements: !27, identifier: "3d52bbcc9d452fcc4dccbd63766b1b50")
!1006 = !DIDerivedType(tag: DW_TAG_member, scope: !989, file: !2, baseType: !71, size: 64, align: 64, flags: DIFlagArtificial)
!1007 = !{!1008}
!1008 = !DITemplateTypeParameter(name: "T", type: !989)
!1009 = !{!1010}
!1010 = !DITemplateTypeParameter(name: "T", type: !1011)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "BridgeStateL", scope: !239, file: !2, align: 8, elements: !1012, templateParams: !27, identifier: "84ba2ed37e57edfdf1d800fc6f598233")
!1012 = !{!1013}
!1013 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1011, file: !2, align: 8, elements: !27, identifier: "859397a962c66557c6a5893d7a383da1")
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!979, !989}
!1016 = !{!1017}
!1017 = !DILocalVariable(name: "value", arg: 1, scope: !977, file: !978, line: 38, type: !989)
!1018 = !DILocation(line: 38, column: 22, scope: !977)
!1019 = !DILocalVariable(name: "value", scope: !1020, file: !978, line: 39, type: !989, align: 8)
!1020 = !DILexicalBlockFile(scope: !1021, file: !978, discriminator: 0)
!1021 = distinct !DISubprogram(name: "new<proc_macro::bridge::client::BridgeState>", linkageName: "_ZN4core4cell13Cell$LT$T$GT$3new17h7165f4eced99e0aeE", scope: !983, file: !1022, line: 345, type: !1023, scopeLine: 345, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, templateParams: !1007, retainedNodes: !1025)
!1022 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "81027bd0ceaa41fbc0bc4e7a3fa9f759")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!983, !989}
!1025 = !{!1019}
!1026 = !DILocation(line: 39, column: 20, scope: !1020, inlinedAt: !1027)
!1027 = !DILocation(line: 39, column: 20, scope: !977)
