; ModuleID = 'fos5lmfy7nep218'
source_filename = "fos5lmfy7nep218"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"f128_internal::f128_t::f128" = type { [16 x i8] }
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_define.rs:12:1: 15:2]" = type {}
%"[closure@src/test_define.rs:18:1: 22:2]" = type {}
%"[closure@src/test_define.rs:25:1: 29:2]" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }
%"test::types::TestName" = type { i8, [39 x i8] }
%"test::options::ShouldPanic" = type { i64, [2 x i64] }
%"test::types::TestFn" = type { i64, [2 x i64] }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [6 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "rust_fns", scope: !36, file: !38, line: 41, type: !39, isLocal: false, isDefinition: true, align: 64)
!36 = !DINamespace(name: "define", scope: !37)
!37 = !DINamespace(name: "macros_tests", scope: null)
!38 = !DIFile(filename: "src/define.rs", directory: "/home/calvin/git/c2rust/tests/macros", checksumkind: CSK_MD5, checksum: "629b51635b8f5aa68d1087f1812f24b7")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "fn_ptrs", scope: !36, file: !2, size: 192, align: 64, elements: !40, templateParams: !23, identifier: "b0faaaed2da6a881d69dbeb3e034dd3c")
!40 = !{!41, !50, !69}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !39, file: !2, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !44, file: !2, baseType: !46, size: 8, align: 8, flags: DIFlagEnumClass, elements: !47)
!44 = !DINamespace(name: "ffi", scope: !45)
!45 = !DINamespace(name: "core", scope: null)
!46 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!47 = !{!48, !49}
!48 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fn1", scope: !39, file: !2, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn() -> i32>", scope: !52, file: !2, size: 64, align: 64, elements: !53, templateParams: !23, identifier: "eeb53efbf21581d63020b6e0ff8cdb0")
!52 = !DINamespace(name: "option", scope: !45)
!53 = !{!54}
!54 = !DICompositeType(tag: DW_TAG_variant_part, scope: !51, file: !2, size: 64, align: 64, elements: !55, templateParams: !23, identifier: "f940ccca1fdfc5bad2c919babd7dfccf", discriminator: !67)
!55 = !{!56, !63}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !54, file: !2, baseType: !57, size: 64, align: 64, extraData: i64 0)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !51, file: !2, size: 64, align: 64, elements: !23, templateParams: !58, identifier: "cdbef4ef5c358293ec43fda3cffe5b56")
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn() -> i32", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DISubroutineType(types: !62)
!62 = !{!33}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !54, file: !2, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !51, file: !2, size: 64, align: 64, elements: !65, templateParams: !58, identifier: "db130c8c444a2b69a1aff6846c5e99ed")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !2, baseType: !60, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, scope: !51, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagArtificial)
!68 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fn2", scope: !39, file: !2, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(i32) -> i32>", scope: !52, file: !2, size: 64, align: 64, elements: !71, templateParams: !23, identifier: "9399e3c7a046050be1a25c2f86faa0a9")
!71 = !{!72}
!72 = !DICompositeType(tag: DW_TAG_variant_part, scope: !70, file: !2, size: 64, align: 64, elements: !73, templateParams: !23, identifier: "41d405e6a675dc61193c3c55c0f7ca9e", discriminator: !85)
!73 = !{!74, !81}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !72, file: !2, baseType: !75, size: 64, align: 64, extraData: i64 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !70, file: !2, size: 64, align: 64, elements: !23, templateParams: !76, identifier: "b659d10ae967d273a637e48588994c4f")
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(i32) -> i32", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DISubroutineType(types: !80)
!80 = !{!33, !33}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !72, file: !2, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !70, file: !2, size: 64, align: 64, elements: !83, templateParams: !76, identifier: "7a912f6ce04a0553fd034dcf993020a2")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !82, file: !2, baseType: !78, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, scope: !70, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagArtificial)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "rust_p", scope: !36, file: !38, line: 58, type: !88, isLocal: false, isDefinition: true, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut macros_tests::define::fn_ptrs", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !{i32 7, !"PIC Level", i32 2}
!90 = !{i32 7, !"PIE Level", i32 2}
!91 = !{i32 2, !"RtLibUseGOT", i32 1}
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !95, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !96, globals: !112)
!95 = !DIFile(filename: "src/lib.rs/@/fos5lmfy7nep218", directory: "/home/calvin/git/c2rust/tests/macros")
!96 = !{!97, !106, !43}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !98, file: !2, baseType: !46, size: 8, align: 8, flags: DIFlagEnumClass, elements: !101)
!98 = !DINamespace(name: "v1", scope: !99)
!99 = !DINamespace(name: "rt", scope: !100)
!100 = !DINamespace(name: "fmt", scope: !45)
!101 = !{!102, !103, !104, !105}
!102 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !107, file: !2, baseType: !46, size: 8, align: 8, flags: DIFlagEnumClass, elements: !108)
!107 = !DINamespace(name: "panicking", scope: !45)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!112 = !{!0, !24, !34, !86}
!113 = distinct !DISubprogram(name: "add", linkageName: "_ZN13f128_internal9f128_impl79_$LT$impl$u20$core..ops..arith..Add$u20$for$u20$f128_internal..f128_t..f128$GT$3add17h8ca6eb4d293d4c93E", scope: !115, file: !114, line: 720, type: !118, scopeLine: 720, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !127)
!114 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/f128_internal-0.2.2/src/f128_impl.rs", directory: "", checksumkind: CSK_MD5, checksum: "9d51e45b18c076d7be80b3cbce7922a2")
!115 = !DINamespace(name: "{impl#11}", scope: !116)
!116 = !DINamespace(name: "f128_impl", scope: !117)
!117 = !DINamespace(name: "f128_internal", scope: null)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !120, !120}
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "f128", scope: !121, file: !2, size: 128, align: 8, elements: !122, templateParams: !23, identifier: "28631f457d6ea86b5cdf0afd2e10880f")
!121 = !DINamespace(name: "f128_t", scope: !117)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !124, size: 128, align: 8)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 16, lowerBound: 0)
!127 = !{!128, !129}
!128 = !DILocalVariable(name: "self", arg: 1, scope: !113, file: !114, line: 720, type: !120)
!129 = !DILocalVariable(name: "other", arg: 2, scope: !113, file: !114, line: 720, type: !120)
!130 = !DILocation(line: 720, column: 12, scope: !113)
!131 = !DILocation(line: 720, column: 18, scope: !113)
!132 = !DILocation(line: 721, column: 32, scope: !113)
!133 = !DILocation(line: 721, column: 38, scope: !113)
!134 = !DILocation(line: 721, column: 18, scope: !113)
!135 = !DILocation(line: 722, column: 6, scope: !113)
!136 = distinct !DISubprogram(name: "from", linkageName: "_ZN13f128_internal9f128_impl88_$LT$impl$u20$core..convert..From$LT$f64$GT$$u20$for$u20$f128_internal..f128_t..f128$GT$4from17h1b03b51756144487E", scope: !137, file: !114, line: 839, type: !138, scopeLine: 839, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !141)
!137 = !DINamespace(name: "{impl#193}", scope: !116)
!138 = !DISubroutineType(types: !139)
!139 = !{!120, !140}
!140 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!141 = !{!142}
!142 = !DILocalVariable(name: "small", arg: 1, scope: !136, file: !114, line: 839, type: !140)
!143 = !DILocation(line: 839, column: 21, scope: !136)
!144 = !DILocation(line: 840, column: 54, scope: !136)
!145 = !DILocation(line: 840, column: 48, scope: !136)
!146 = !DILocation(line: 840, column: 26, scope: !136)
!147 = !DILocation(line: 841, column: 14, scope: !136)
!148 = distinct !DISubprogram(name: "from", linkageName: "_ZN13f128_internal9f128_impl88_$LT$impl$u20$core..convert..From$LT$i32$GT$$u20$for$u20$f128_internal..f128_t..f128$GT$4from17he09c8ac57ea86975E", scope: !149, file: !114, line: 839, type: !150, scopeLine: 839, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !152)
!149 = !DINamespace(name: "{impl#173}", scope: !116)
!150 = !DISubroutineType(types: !151)
!151 = !{!120, !33}
!152 = !{!153}
!153 = !DILocalVariable(name: "small", arg: 1, scope: !148, file: !114, line: 839, type: !33)
!154 = !DILocation(line: 839, column: 21, scope: !148)
!155 = !DILocation(line: 840, column: 54, scope: !148)
!156 = !DILocation(line: 840, column: 48, scope: !148)
!157 = !DILocation(line: 840, column: 26, scope: !148)
!158 = !DILocation(line: 841, column: 14, scope: !148)
!159 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hd02804915470ea8bE", scope: !161, file: !160, line: 118, type: !163, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !169, retainedNodes: !165)
!160 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!161 = !DINamespace(name: "backtrace", scope: !162)
!162 = !DINamespace(name: "sys_common", scope: !17)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !20}
!165 = !{!166, !167}
!166 = !DILocalVariable(name: "f", arg: 1, scope: !159, file: !160, line: 118, type: !20)
!167 = !DILocalVariable(name: "result", scope: !168, file: !160, line: 122, type: !7, align: 1)
!168 = distinct !DILexicalBlock(scope: !159, file: !160, line: 122, column: 5)
!169 = !{!170, !171}
!170 = !DITemplateTypeParameter(name: "F", type: !20)
!171 = !DITemplateTypeParameter(name: "T", type: !7)
!172 = !DILocation(line: 122, column: 9, scope: !168)
!173 = !DILocation(line: 118, column: 43, scope: !159)
!174 = !DILocalVariable(name: "dummy", scope: !175, file: !160, line: 125, type: !7, align: 1)
!175 = !DILexicalBlockFile(scope: !176, file: !160, discriminator: 0)
!176 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h3a68ac76bf55b09fE", scope: !178, file: !177, line: 225, type: !179, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !182, retainedNodes: !181)
!177 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!178 = !DINamespace(name: "hint", scope: !45)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !7}
!181 = !{!174}
!182 = !{!171}
!183 = !DILocation(line: 125, column: 5, scope: !175, inlinedAt: !184)
!184 = !DILocation(line: 125, column: 5, scope: !168)
!185 = !DILocation(line: 122, column: 18, scope: !159)
!186 = !{i32 3345184}
!187 = !DILocation(line: 128, column: 2, scope: !159)
!188 = !DILocation(line: 128, column: 1, scope: !159)
!189 = !DILocation(line: 118, column: 1, scope: !159)
!190 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h1f234e65117dd1fcE", scope: !16, file: !191, line: 139, type: !192, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !182, retainedNodes: !197)
!191 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !20, !194, !195}
!194 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !196, size: 64, align: 64, dwarfAddressSpace: 0)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !{!198, !199, !200, !201}
!198 = !DILocalVariable(name: "main", arg: 1, scope: !190, file: !191, line: 140, type: !20)
!199 = !DILocalVariable(name: "argc", arg: 2, scope: !190, file: !191, line: 141, type: !194)
!200 = !DILocalVariable(name: "argv", arg: 3, scope: !190, file: !191, line: 142, type: !195)
!201 = !DILocalVariable(name: "v", scope: !202, file: !191, line: 144, type: !194, align: 8)
!202 = distinct !DILexicalBlock(scope: !190, file: !191, line: 144, column: 5)
!203 = !DILocation(line: 140, column: 5, scope: !190)
!204 = !DILocation(line: 141, column: 5, scope: !190)
!205 = !DILocation(line: 142, column: 5, scope: !190)
!206 = !DILocation(line: 145, column: 10, scope: !190)
!207 = !DILocation(line: 145, column: 9, scope: !190)
!208 = !DILocation(line: 144, column: 17, scope: !190)
!209 = !DILocation(line: 144, column: 12, scope: !190)
!210 = !DILocation(line: 144, column: 12, scope: !202)
!211 = !DILocation(line: 150, column: 2, scope: !190)
!212 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hc3aa2ece51c5514fE", scope: !15, file: !191, line: 145, type: !213, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !182, retainedNodes: !216)
!213 = !DISubroutineType(types: !214)
!214 = !{!33, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !{!217}
!217 = !DILocalVariable(name: "main", scope: !212, file: !191, line: 140, type: !20, align: 8)
!218 = !{i64 8}
!219 = !DILocation(line: 140, column: 5, scope: !212)
!220 = !DILocalVariable(name: "self", scope: !221, file: !191, line: 145, type: !224, align: 1)
!221 = !DILexicalBlockFile(scope: !222, file: !191, discriminator: 0)
!222 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hb6f92c96e4a22bbdE", scope: !224, file: !223, line: 1808, type: !235, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !237)
!223 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !225, file: !2, size: 8, align: 8, elements: !226, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!225 = !DINamespace(name: "process", scope: !17)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !224, file: !2, baseType: !228, size: 8, align: 8)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !229, file: !2, size: 8, align: 8, elements: !233, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!229 = !DINamespace(name: "process_common", scope: !230)
!230 = !DINamespace(name: "process", scope: !231)
!231 = !DINamespace(name: "unix", scope: !232)
!232 = !DINamespace(name: "sys", scope: !17)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !228, file: !2, baseType: !46, size: 8, align: 8)
!235 = !DISubroutineType(types: !236)
!236 = !{!33, !224}
!237 = !{!220}
!238 = !DILocation(line: 145, column: 18, scope: !221, inlinedAt: !239)
!239 = !DILocation(line: 145, column: 18, scope: !212)
!240 = !DILocation(line: 145, column: 77, scope: !212)
!241 = !DILocalVariable(name: "self", scope: !242, file: !191, line: 145, type: !247, align: 8)
!242 = !DILexicalBlockFile(scope: !243, file: !191, discriminator: 0)
!243 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h0867deebc0153ea4E", scope: !228, file: !244, line: 485, type: !245, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !248)
!244 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!245 = !DISubroutineType(types: !246)
!246 = !{!33, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !{!241}
!249 = !DILocation(line: 145, column: 18, scope: !242, inlinedAt: !250)
!250 = !DILocation(line: 1809, column: 9, scope: !222, inlinedAt: !239)
!251 = !DILocation(line: 145, column: 17, scope: !212)
!252 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h1b2985ae1d42cd15E", scope: !254, file: !253, line: 2361, type: !255, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !312, retainedNodes: !309)
!253 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!254 = !DINamespace(name: "{impl#59}", scope: !100)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !274, !275}
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !258, file: !2, size: 8, align: 8, elements: !259, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!258 = !DINamespace(name: "result", scope: !45)
!259 = !{!260}
!260 = !DICompositeType(tag: DW_TAG_variant_part, scope: !257, file: !2, size: 8, align: 8, elements: !261, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !273)
!261 = !{!262, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !260, file: !2, baseType: !263, size: 8, align: 8, extraData: i64 0)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !257, file: !2, size: 8, align: 8, elements: !264, templateParams: !266, identifier: "cea751326735c343faf647063a65ad14")
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !263, file: !2, baseType: !7, align: 8, offset: 8)
!266 = !{!171, !267}
!267 = !DITemplateTypeParameter(name: "E", type: !268)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !100, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !260, file: !2, baseType: !270, size: 8, align: 8, extraData: i64 1)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !257, file: !2, size: 8, align: 8, elements: !271, templateParams: !266, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !270, file: !2, baseType: !268, align: 8, offset: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !2, baseType: !46, size: 8, align: 8, flags: DIFlagArtificial)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !276, size: 64, align: 64, dwarfAddressSpace: 0)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !100, file: !2, size: 512, align: 64, elements: !277, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!277 = !{!278, !280, !282, !283, !297, !298}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !2, baseType: !279, size: 32, align: 32, offset: 384)
!279 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !276, file: !2, baseType: !281, size: 32, align: 32, offset: 416)
!281 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !276, file: !2, baseType: !97, size: 8, align: 8, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !276, file: !2, baseType: !284, size: 128, align: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !52, file: !2, size: 128, align: 64, elements: !285, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_variant_part, scope: !284, file: !2, size: 128, align: 64, elements: !287, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !296)
!287 = !{!288, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !286, file: !2, baseType: !289, size: 128, align: 64, extraData: i64 0)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !284, file: !2, size: 128, align: 64, elements: !23, templateParams: !290, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!290 = !{!291}
!291 = !DITemplateTypeParameter(name: "T", type: !9)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !286, file: !2, baseType: !293, size: 128, align: 64, extraData: i64 1)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !284, file: !2, size: 128, align: 64, elements: !294, templateParams: !290, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !293, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !284, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagArtificial)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !276, file: !2, baseType: !284, size: 128, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !2, baseType: !299, size: 128, align: 64, offset: 256)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !300, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!300 = !{!301, !304}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !299, file: !2, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !299, file: !2, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !306, size: 64, align: 64, dwarfAddressSpace: 0)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 3, lowerBound: 0)
!309 = !{!310, !311}
!310 = !DILocalVariable(name: "self", arg: 1, scope: !252, file: !253, line: 2361, type: !274)
!311 = !DILocalVariable(name: "f", arg: 2, scope: !252, file: !253, line: 2361, type: !275)
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "T", type: !33)
!314 = !DILocation(line: 2361, column: 20, scope: !252)
!315 = !DILocation(line: 2361, column: 27, scope: !252)
!316 = !DILocation(line: 2361, column: 71, scope: !252)
!317 = !{i64 4}
!318 = !DILocation(line: 2361, column: 62, scope: !252)
!319 = !DILocation(line: 2361, column: 84, scope: !252)
!320 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hc7b307dfa00a3267E", scope: !322, file: !321, line: 185, type: !324, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !326)
!321 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!322 = !DINamespace(name: "{impl#80}", scope: !323)
!323 = !DINamespace(name: "num", scope: !100)
!324 = !DISubroutineType(types: !325)
!325 = !{!257, !32, !275}
!326 = !{!327, !328}
!327 = !DILocalVariable(name: "self", arg: 1, scope: !320, file: !321, line: 185, type: !32)
!328 = !DILocalVariable(name: "f", arg: 2, scope: !320, file: !321, line: 185, type: !275)
!329 = !DILocation(line: 185, column: 20, scope: !320)
!330 = !DILocation(line: 185, column: 27, scope: !320)
!331 = !DILocation(line: 186, column: 20, scope: !320)
!332 = !DILocation(line: 188, column: 27, scope: !320)
!333 = !DILocation(line: 187, column: 21, scope: !320)
!334 = !DILocation(line: 186, column: 17, scope: !320)
!335 = !DILocation(line: 193, column: 14, scope: !320)
!336 = !{i8 0, i8 2}
!337 = !DILocation(line: 191, column: 21, scope: !320)
!338 = !DILocation(line: 189, column: 21, scope: !320)
!339 = !DILocation(line: 188, column: 24, scope: !320)
!340 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h766deee48aed3ec8E", scope: !341, file: !253, line: 390, type: !415, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !417)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !100, file: !2, size: 384, align: 64, elements: !342, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!342 = !{!343, !354, !399}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !341, file: !2, baseType: !344, size: 128, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !345, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!345 = !{!346, !353}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !344, file: !2, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64, dwarfAddressSpace: 0)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !349, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !348, file: !2, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !348, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !344, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !341, file: !2, baseType: !355, size: 128, align: 64, offset: 128)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !52, file: !2, size: 128, align: 64, elements: !356, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!356 = !{!357}
!357 = !DICompositeType(tag: DW_TAG_variant_part, scope: !355, file: !2, size: 128, align: 64, elements: !358, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !398)
!358 = !{!359, !394}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !357, file: !2, baseType: !360, size: 128, align: 64, extraData: i64 0)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !355, file: !2, size: 128, align: 64, elements: !23, templateParams: !361, identifier: "742dbe7e160661d8ca36fcfff2574850")
!361 = !{!362}
!362 = !DITemplateTypeParameter(name: "T", type: !363)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !364, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!364 = !{!365, !393}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !363, file: !2, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64, dwarfAddressSpace: 0)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !98, file: !2, size: 448, align: 64, elements: !368, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !367, file: !2, baseType: !9, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !367, file: !2, baseType: !371, size: 384, align: 64, offset: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !98, file: !2, size: 384, align: 64, elements: !372, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!372 = !{!373, !374, !375, !376, !392}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !371, file: !2, baseType: !281, size: 32, align: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !371, file: !2, baseType: !97, size: 8, align: 8, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !371, file: !2, baseType: !279, size: 32, align: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !371, file: !2, baseType: !377, size: 128, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !98, file: !2, size: 128, align: 64, elements: !378, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!378 = !{!379}
!379 = !DICompositeType(tag: DW_TAG_variant_part, scope: !377, file: !2, size: 128, align: 64, elements: !380, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !391)
!380 = !{!381, !385, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !379, file: !2, baseType: !382, size: 128, align: 64, extraData: i64 0)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !377, file: !2, size: 128, align: 64, elements: !383, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !382, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !379, file: !2, baseType: !386, size: 128, align: 64, extraData: i64 1)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !377, file: !2, size: 128, align: 64, elements: !387, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !386, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !379, file: !2, baseType: !390, size: 128, align: 64, extraData: i64 2)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !377, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!391 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagArtificial)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !371, file: !2, baseType: !377, size: 128, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !363, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !357, file: !2, baseType: !395, size: 128, align: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !355, file: !2, size: 128, align: 64, elements: !396, templateParams: !361, identifier: "17f2fc106094349c7673abca4839c97a")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !395, file: !2, baseType: !363, size: 128, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !355, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagArtificial)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !341, file: !2, baseType: !400, size: 128, align: 64, offset: 256)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !401, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!401 = !{!402, !414}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !400, file: !2, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !100, file: !2, size: 128, align: 64, elements: !405, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!405 = !{!406, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !404, file: !2, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !408, size: 64, align: 64, dwarfAddressSpace: 0)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !409, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!409 = !DINamespace(name: "{extern#0}", scope: !100)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !404, file: !2, baseType: !411, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !412, size: 64, align: 64, dwarfAddressSpace: 0)
!412 = !DISubroutineType(types: !413)
!413 = !{!257, !407, !275}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!341, !344, !400}
!417 = !{!418, !419}
!418 = !DILocalVariable(name: "pieces", arg: 1, scope: !340, file: !253, line: 390, type: !344)
!419 = !DILocalVariable(name: "args", arg: 2, scope: !340, file: !253, line: 390, type: !400)
!420 = !DILocation(line: 390, column: 25, scope: !340)
!421 = !DILocation(line: 390, column: 53, scope: !340)
!422 = !DILocation(line: 391, column: 12, scope: !340)
!423 = !DILocation(line: 391, column: 56, scope: !340)
!424 = !DILocation(line: 391, column: 41, scope: !340)
!425 = !DILocation(line: 394, column: 34, scope: !340)
!426 = !DILocation(line: 394, column: 9, scope: !340)
!427 = !DILocation(line: 395, column: 6, scope: !340)
!428 = !DILocation(line: 392, column: 13, scope: !340)
!429 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hdb800423a1f13b49E", scope: !431, file: !430, line: 248, type: !434, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !440, retainedNodes: !437)
!430 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!431 = !DINamespace(name: "FnOnce", scope: !432)
!432 = !DINamespace(name: "function", scope: !433)
!433 = !DINamespace(name: "ops", scope: !45)
!434 = !DISubroutineType(types: !435)
!435 = !{!33, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !{!438, !439}
!438 = !DILocalVariable(arg: 1, scope: !429, file: !430, line: 248, type: !436)
!439 = !DILocalVariable(arg: 2, scope: !429, file: !430, line: 248, type: !7)
!440 = !{!441, !442}
!441 = !DITemplateTypeParameter(name: "Self", type: !14)
!442 = !DITemplateTypeParameter(name: "Args", type: !7)
!443 = !DILocation(line: 248, column: 5, scope: !429)
!444 = distinct !DISubprogram(name: "call_once<macros_tests::test_define::test_define::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h09052217a25a845dE", scope: !431, file: !430, line: 248, type: !445, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !453, retainedNodes: !450)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !447}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !448, file: !2, align: 8, elements: !23, identifier: "2e6f1d3d30bea983f8269c569334b5af")
!448 = !DINamespace(name: "test_define", scope: !449)
!449 = !DINamespace(name: "test_define", scope: !37)
!450 = !{!451, !452}
!451 = !DILocalVariable(arg: 1, scope: !444, file: !430, line: 248, type: !447)
!452 = !DILocalVariable(arg: 2, scope: !444, file: !430, line: 248, type: !7)
!453 = !{!454, !442}
!454 = !DITemplateTypeParameter(name: "Self", type: !447)
!455 = !DILocation(line: 248, column: 5, scope: !444)
!456 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h7f6b9895a32488f5E", scope: !431, file: !430, line: 248, type: !163, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !460, retainedNodes: !457)
!457 = !{!458, !459}
!458 = !DILocalVariable(arg: 1, scope: !456, file: !430, line: 248, type: !20)
!459 = !DILocalVariable(arg: 2, scope: !456, file: !430, line: 248, type: !7)
!460 = !{!461, !442}
!461 = !DITemplateTypeParameter(name: "Self", type: !20)
!462 = !DILocation(line: 248, column: 5, scope: !456)
!463 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hb74bb0dd5c1b1560E", scope: !431, file: !430, line: 248, type: !464, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !440, retainedNodes: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{!33, !14}
!466 = !{!467, !468}
!467 = !DILocalVariable(arg: 1, scope: !463, file: !430, line: 248, type: !14)
!468 = !DILocalVariable(arg: 2, scope: !463, file: !430, line: 248, type: !7)
!469 = !DILocation(line: 248, column: 5, scope: !463)
!470 = distinct !DISubprogram(name: "call_once<macros_tests::test_define::test_zstd_define::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hc2d78555fe211349E", scope: !431, file: !430, line: 248, type: !471, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !478, retainedNodes: !475)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !473}
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !474, file: !2, align: 8, elements: !23, identifier: "2d1c8e1c2ca7019e39567094504b8a29")
!474 = !DINamespace(name: "test_zstd_define", scope: !449)
!475 = !{!476, !477}
!476 = !DILocalVariable(arg: 1, scope: !470, file: !430, line: 248, type: !473)
!477 = !DILocalVariable(arg: 2, scope: !470, file: !430, line: 248, type: !7)
!478 = !{!479, !442}
!479 = !DITemplateTypeParameter(name: "Self", type: !473)
!480 = !DILocation(line: 248, column: 5, scope: !470)
!481 = distinct !DISubprogram(name: "call_once<macros_tests::test_define::test_macro_stmt_expr::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hc89044fcf1ac9c1aE", scope: !431, file: !430, line: 248, type: !482, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !489, retainedNodes: !486)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !484}
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !485, file: !2, align: 8, elements: !23, identifier: "6684a2180b71f4553ed40b5ed30498db")
!485 = !DINamespace(name: "test_macro_stmt_expr", scope: !449)
!486 = !{!487, !488}
!487 = !DILocalVariable(arg: 1, scope: !481, file: !430, line: 248, type: !484)
!488 = !DILocalVariable(arg: 2, scope: !481, file: !430, line: 248, type: !7)
!489 = !{!490, !442}
!490 = !DITemplateTypeParameter(name: "Self", type: !484)
!491 = !DILocation(line: 248, column: 5, scope: !481)
!492 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17he87e15c781c8a981E", scope: !494, file: !493, line: 487, type: !495, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !500, retainedNodes: !498)
!493 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!494 = !DINamespace(name: "ptr", scope: !45)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!498 = !{!499}
!499 = !DILocalVariable(arg: 1, scope: !492, file: !493, line: 487, type: !497)
!500 = !{!501}
!501 = !DITemplateTypeParameter(name: "T", type: !32)
!502 = !DILocation(line: 487, column: 1, scope: !492)
!503 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h8e5edb51b362fc52E", scope: !494, file: !493, line: 487, type: !504, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !508, retainedNodes: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !436}
!506 = !{!507}
!507 = !DILocalVariable(arg: 1, scope: !503, file: !493, line: 487, type: !436)
!508 = !{!509}
!509 = !DITemplateTypeParameter(name: "T", type: !14)
!510 = !DILocation(line: 487, column: 1, scope: !503)
!511 = distinct !DISubprogram(name: "assert_failed<i32, i32>", linkageName: "_ZN4core9panicking13assert_failed17hbb73671594ddc204E", scope: !107, file: !512, line: 171, type: !513, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !541, retainedNodes: !536)
!512 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "89dbfc153a7177bd0202715dd5809289")
!513 = !DISubroutineType(types: !514)
!514 = !{null, !106, !32, !32, !515, !528}
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Arguments>", scope: !52, file: !2, size: 384, align: 64, elements: !516, templateParams: !23, identifier: "91782c25c0cb4075178b67ca76527846")
!516 = !{!517}
!517 = !DICompositeType(tag: DW_TAG_variant_part, scope: !515, file: !2, size: 384, align: 64, elements: !518, templateParams: !23, identifier: "d3d8c93b36d851336035bb39c7913979", discriminator: !527)
!518 = !{!519, !523}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !517, file: !2, baseType: !520, size: 384, align: 64, extraData: i64 0)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !515, file: !2, size: 384, align: 64, elements: !23, templateParams: !521, identifier: "94094742b636673213b46bf0a5389cae")
!521 = !{!522}
!522 = !DITemplateTypeParameter(name: "T", type: !341)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !517, file: !2, baseType: !524, size: 384, align: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !515, file: !2, size: 384, align: 64, elements: !525, templateParams: !521, identifier: "424137f74f76139e10918065dfb817dc")
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !524, file: !2, baseType: !341, size: 384, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, scope: !515, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagArtificial)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !529, size: 64, align: 64, dwarfAddressSpace: 0)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !530, file: !2, size: 192, align: 64, elements: !532, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!530 = !DINamespace(name: "location", scope: !531)
!531 = !DINamespace(name: "panic", scope: !45)
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !529, file: !2, baseType: !348, size: 128, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !529, file: !2, baseType: !279, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !529, file: !2, baseType: !279, size: 32, align: 32, offset: 160)
!536 = !{!537, !538, !539, !540}
!537 = !DILocalVariable(name: "kind", arg: 1, scope: !511, file: !512, line: 172, type: !106)
!538 = !DILocalVariable(name: "left", arg: 2, scope: !511, file: !512, line: 173, type: !32)
!539 = !DILocalVariable(name: "right", arg: 3, scope: !511, file: !512, line: 174, type: !32)
!540 = !DILocalVariable(name: "args", arg: 4, scope: !511, file: !512, line: 175, type: !515)
!541 = !{!313, !542}
!542 = !DITemplateTypeParameter(name: "U", type: !33)
!543 = !DILocation(line: 172, column: 5, scope: !511)
!544 = !DILocation(line: 173, column: 5, scope: !511)
!545 = !DILocation(line: 174, column: 5, scope: !511)
!546 = !DILocation(line: 175, column: 5, scope: !511)
!547 = !DILocation(line: 181, column: 31, scope: !511)
!548 = !DILocation(line: 181, column: 38, scope: !511)
!549 = !DILocation(line: 181, column: 46, scope: !511)
!550 = !DILocation(line: 181, column: 5, scope: !511)
!551 = distinct !DISubprogram(name: "assert_test_result<()>", linkageName: "_ZN4test18assert_test_result17he7794b6b15c949f4E", scope: !553, file: !552, line: 182, type: !179, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !182, retainedNodes: !554)
!552 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/test/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "762a73d08c70c6e433bc6b670465b31f")
!553 = !DINamespace(name: "test", scope: null)
!554 = !{!555, !556, !558, !562, !563}
!555 = !DILocalVariable(name: "result", arg: 1, scope: !551, file: !552, line: 182, type: !7)
!556 = !DILocalVariable(name: "code", scope: !557, file: !552, line: 183, type: !33, align: 4)
!557 = distinct !DILexicalBlock(scope: !551, file: !552, line: 183, column: 5)
!558 = !DILocalVariable(name: "left_val", scope: !559, file: !552, line: 184, type: !32, align: 8)
!559 = !DILexicalBlockFile(scope: !560, file: !552, discriminator: 0)
!560 = distinct !DILexicalBlock(scope: !557, file: !561, line: 52, column: 13)
!561 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/macros/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "92818cc67b0fce20f16574f7676a5426")
!562 = !DILocalVariable(name: "right_val", scope: !559, file: !552, line: 184, type: !32, align: 8)
!563 = !DILocalVariable(name: "kind", scope: !564, file: !552, line: 184, type: !106, align: 1)
!564 = !DILexicalBlockFile(scope: !565, file: !552, discriminator: 0)
!565 = distinct !DILexicalBlock(scope: !560, file: !561, line: 54, column: 21)
!566 = !DILocation(line: 182, column: 43, scope: !551)
!567 = !DILocation(line: 183, column: 9, scope: !557)
!568 = !DILocalVariable(name: "self", scope: !569, file: !552, line: 183, type: !224, align: 1)
!569 = !DILexicalBlockFile(scope: !570, file: !552, discriminator: 0)
!570 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217hb6f92c96e4a22bbdE", scope: !224, file: !223, line: 1808, type: !235, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !571)
!571 = !{!568}
!572 = !DILocation(line: 183, column: 16, scope: !569, inlinedAt: !573)
!573 = !DILocation(line: 183, column: 16, scope: !551)
!574 = !DILocalVariable(name: "self", scope: !575, file: !552, line: 183, type: !247, align: 8)
!575 = !DILexicalBlockFile(scope: !576, file: !552, discriminator: 0)
!576 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h0867deebc0153ea4E", scope: !228, file: !244, line: 485, type: !245, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !94, templateParams: !23, retainedNodes: !577)
!577 = !{!574}
!578 = !DILocation(line: 183, column: 16, scope: !575, inlinedAt: !579)
