; ModuleID = 'num_traits.ecb74699-cgu.0'
source_filename = "num_traits.ecb74699-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::iter::adapters::zip::Zip<core::slice::iter::Iter<u8>, core::slice::iter::Iter<u8>>" = type { { i8*, i8* }, { i8*, i8* }, i64, i64, i64 }
%"core::iter::adapters::zip::Zip<core::str::iter::Bytes, core::str::iter::Bytes>" = type { { i8*, i8* }, { i8*, i8* }, i64, i64, i64 }
%"core::option::Option<(u8, u8)>" = type { i8, [2 x i8] }
%"core::ops::control_flow::ControlFlow<(), core::convert::Infallible>::Break" = type { {} }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"[closure@<core::ops::range::Range<usize> as core::slice::index::SliceIndex<[u8]>>::get_unchecked::{closure#0}]" = type { i64*, i64*, { [0 x i8]*, i64 }* }
%"core::iter::adapters::enumerate::Enumerate<core::str::iter::Chars>" = type { { i8*, i8* }, i64 }
%"core::option::Option<core::convert::Infallible>::None" = type {}
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"core::option::Option<(u8, u8)>::Some" = type { [1 x i8], { i8, i8 } }
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"[closure@core::f32::<impl f32>::to_bits::{closure#0}]" = type {}
%"[closure@core::f64::<impl f64>::to_bits::{closure#0}]" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&num_traits::FloatErrorKind as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&num_traits::FloatErrorKind as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !19, identifier: "70bf8d883a1c138322c9704540a4c102")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&num_traits::FloatErrorKind", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FloatErrorKind", scope: !14, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagEnumClass, elements: !16)
!14 = !DINamespace(name: "num_traits", scope: null)
!15 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "Invalid", value: 1, isUnsigned: true)
!19 = !{}
!20 = !{i32 7, !"PIC Level", i32 2}
!21 = !{i32 2, !"RtLibUseGOT", i32 1}
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !25, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, globals: !54)
!25 = !DIFile(filename: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/num-traits-0.2.19/src/lib.rs/@/num_traits.ecb74699-cgu.0", directory: "/home/calvin/.cargo/registry/src/github.com-1ecc6299db9ec823/num-traits-0.2.19")
!26 = !{!13, !27, !37, !44, !47}
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !28, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagEnumClass, elements: !32)
!28 = !DINamespace(name: "v1", scope: !29)
!29 = !DINamespace(name: "rt", scope: !30)
!30 = !DINamespace(name: "fmt", scope: !31)
!31 = !DINamespace(name: "core", scope: null)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !38, file: !2, baseType: !39, size: 8, align: 8, flags: DIFlagEnumClass, elements: !40)
!38 = !DINamespace(name: "cmp", scope: !31)
!39 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "Less", value: 255)
!42 = !DIEnumerator(name: "Equal", value: 0)
!43 = !DIEnumerator(name: "Greater", value: 1)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FloatErrorKind", scope: !45, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagEnumClass, elements: !16)
!45 = !DINamespace(name: "dec2flt", scope: !46)
!46 = !DINamespace(name: "num", scope: !31)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !48, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagEnumClass, elements: !49)
!48 = !DINamespace(name: "error", scope: !46)
!49 = !{!17, !50, !51, !52, !53}
!50 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!53 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!54 = !{!0}
!55 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, core::slice::iter::Iter<u8>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h4a8492ba729d29abE", scope: !57, file: !56, line: 83, type: !61, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !110, retainedNodes: !113)
!56 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "278264c097e5b80e82aa3f4661da37c1")
!57 = !DINamespace(name: "{impl#1}", scope: !58)
!58 = !DINamespace(name: "zip", scope: !59)
!59 = !DINamespace(name: "adapters", scope: !60)
!60 = !DINamespace(name: "iter", scope: !31)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !83}
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&u8, &u8)>", scope: !64, file: !2, size: 128, align: 64, elements: !65, templateParams: !19, identifier: "ad6e84816eb6fff539ae576791e8c520")
!64 = !DINamespace(name: "option", scope: !31)
!65 = !{!66}
!66 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 128, align: 64, elements: !67, templateParams: !19, identifier: "3ce87df09173c0bd44049ae286d855ad", discriminator: !81)
!67 = !{!68, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !66, file: !2, baseType: !69, size: 128, align: 64, extraData: i64 0)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !63, file: !2, size: 128, align: 64, elements: !19, templateParams: !70, identifier: "a5f1e68fe5b599317f1407451d36afd")
!70 = !{!71}
!71 = !DITemplateTypeParameter(name: "T", type: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&u8, &u8)", file: !2, size: 128, align: 64, elements: !73, templateParams: !19, identifier: "d9d0d3562494710435cdc4083134674")
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !72, file: !2, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !72, file: !2, baseType: !75, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !66, file: !2, baseType: !78, size: 128, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !63, file: !2, size: 128, align: 64, elements: !79, templateParams: !70, identifier: "b943f1678c0b87ae88f2542a67061e35")
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !78, file: !2, baseType: !72, size: 128, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!82 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::zip::Zip<core::slice::iter::Iter<u8>, core::slice::iter::Iter<u8>>", baseType: !84, size: 64, align: 64, dwarfAddressSpace: 0)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::Iter<u8>, core::slice::iter::Iter<u8>>", scope: !58, file: !2, size: 448, align: 64, elements: !85, templateParams: !110, identifier: "c6a83170d2c7100a90ce5fe072606414")
!85 = !{!86, !106, !107, !108, !109}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !84, file: !2, baseType: !87, size: 128, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !88, file: !2, size: 128, align: 64, elements: !90, templateParams: !98, identifier: "604c1441eac6ad793aa852936f7a8030")
!88 = !DINamespace(name: "iter", scope: !89)
!89 = !DINamespace(name: "slice", scope: !31)
!90 = !{!91, !100, !101}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !87, file: !2, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !93, file: !2, size: 64, align: 64, elements: !95, templateParams: !98, identifier: "3160283ea80cecf6149fff38a2e996de")
!93 = !DINamespace(name: "non_null", scope: !94)
!94 = !DINamespace(name: "ptr", scope: !31)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !92, file: !2, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "T", type: !15)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !87, file: !2, baseType: !97, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !87, file: !2, baseType: !102, align: 8)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !103, file: !2, align: 8, elements: !19, templateParams: !104, identifier: "4e2102ee614de7ec94ba265c486b9c89")
!103 = !DINamespace(name: "marker", scope: !31)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !75)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !84, file: !2, baseType: !87, size: 128, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !84, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!110 = !{!111, !112}
!111 = !DITemplateTypeParameter(name: "A", type: !87)
!112 = !DITemplateTypeParameter(name: "B", type: !87)
!113 = !{!114}
!114 = !DILocalVariable(name: "self", arg: 1, scope: !55, file: !56, line: 83, type: !83)
!115 = !DILocation(line: 83, column: 13, scope: !55)
!116 = !DILocation(line: 84, column: 9, scope: !55)
!117 = !DILocation(line: 85, column: 6, scope: !55)
!118 = distinct !DISubprogram(name: "next<core::str::iter::Bytes, core::str::iter::Bytes>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h837551cd9ed82fb3E", scope: !57, file: !56, line: 83, type: !119, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !157, retainedNodes: !160)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !138}
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(u8, u8)>", scope: !64, file: !2, size: 24, align: 8, elements: !122, templateParams: !19, identifier: "318b7a1925676221cdd49d977d23b6be")
!122 = !{!123}
!123 = !DICompositeType(tag: DW_TAG_variant_part, scope: !121, file: !2, size: 24, align: 8, elements: !124, templateParams: !19, identifier: "e14fa2aa2bc86d29effb2ccb28dd92d", discriminator: !137)
!124 = !{!125, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !123, file: !2, baseType: !126, size: 24, align: 8, extraData: i64 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !121, file: !2, size: 24, align: 8, elements: !19, templateParams: !127, identifier: "56a529f1539b92dbbe58357a6b73981")
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "T", type: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, u8)", file: !2, size: 16, align: 8, elements: !130, templateParams: !19, identifier: "37f9e0df58fae0ef3ba6ea240aab1e26")
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !129, file: !2, baseType: !15, size: 8, align: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !129, file: !2, baseType: !15, size: 8, align: 8, offset: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !123, file: !2, baseType: !134, size: 24, align: 8, extraData: i64 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !121, file: !2, size: 24, align: 8, elements: !135, templateParams: !127, identifier: "9919a39cec15d683c0dd4d85bda8467e")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !129, size: 16, align: 8, offset: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagArtificial)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::zip::Zip<core::str::iter::Bytes, core::str::iter::Bytes>", baseType: !139, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::str::iter::Bytes, core::str::iter::Bytes>", scope: !58, file: !2, size: 448, align: 64, elements: !140, templateParams: !157, identifier: "baf7333330248bb344d5f890700d153b")
!140 = !{!141, !153, !154, !155, !156}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !139, file: !2, baseType: !142, size: 128, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bytes", scope: !143, file: !2, size: 128, align: 64, elements: !145, templateParams: !19, identifier: "a924c030ad6941c5216fab9688f9c1c9")
!143 = !DINamespace(name: "iter", scope: !144)
!144 = !DINamespace(name: "str", scope: !31)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !142, file: !2, baseType: !147, size: 128, align: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<u8>>", scope: !148, file: !2, size: 128, align: 64, elements: !149, templateParams: !151, identifier: "f783fc9831e032da2a1b411094ea669f")
!148 = !DINamespace(name: "copied", scope: !59)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !147, file: !2, baseType: !87, size: 128, align: 64)
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "I", type: !87)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !139, file: !2, baseType: !142, size: 128, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !139, file: !2, baseType: !9, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !139, file: !2, baseType: !9, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "a_len", scope: !139, file: !2, baseType: !9, size: 64, align: 64, offset: 384)
!157 = !{!158, !159}
!158 = !DITemplateTypeParameter(name: "A", type: !142)
!159 = !DITemplateTypeParameter(name: "B", type: !142)
!160 = !{!161}
!161 = !DILocalVariable(name: "self", arg: 1, scope: !118, file: !56, line: 83, type: !138)
!162 = !DILocation(line: 83, column: 13, scope: !118)
!163 = !DILocation(line: 84, column: 9, scope: !118)
!164 = !DILocation(line: 85, column: 6, scope: !118)
!165 = distinct !DISubprogram(name: "__iterator_get_unchecked<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$24__iterator_get_unchecked17h19dc1639f28d90b1E", scope: !167, file: !166, line: 84, type: !168, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !174, retainedNodes: !171)
!166 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "efac9608a3239d124e33fc1a46be8bca")
!167 = !DINamespace(name: "{impl#1}", scope: !148)
!168 = !DISubroutineType(types: !169)
!169 = !{!15, !170, !9}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !147, size: 64, align: 64, dwarfAddressSpace: 0)
!171 = !{!172, !173}
!172 = !DILocalVariable(name: "self", arg: 1, scope: !165, file: !166, line: 84, type: !170)
!173 = !DILocalVariable(name: "idx", arg: 2, scope: !165, file: !166, line: 84, type: !9)
!174 = !{!152, !99}
!175 = !DILocation(line: 84, column: 40, scope: !165)
!176 = !DILocation(line: 84, column: 51, scope: !165)
!177 = !DILocation(line: 90, column: 37, scope: !165)
!178 = !DILocalVariable(name: "it", scope: !179, file: !166, line: 90, type: !183, align: 8)
!179 = !DILexicalBlockFile(scope: !180, file: !166, discriminator: 0)
!180 = distinct !DISubprogram(name: "try_get_unchecked<core::slice::iter::Iter<u8>>", linkageName: "_ZN4core4iter8adapters3zip17try_get_unchecked17h325bd43f6a82ee73E", scope: !58, file: !56, line: 557, type: !181, scopeLine: 557, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !151, retainedNodes: !184)
!181 = !DISubroutineType(types: !182)
!182 = !{!75, !183, !9}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::slice::iter::Iter<u8>", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!184 = !{!178, !185}
!185 = !DILocalVariable(name: "idx", scope: !179, file: !166, line: 90, type: !9, align: 8)
!186 = !DILocation(line: 90, column: 19, scope: !179, inlinedAt: !187)
!187 = !DILocation(line: 90, column: 19, scope: !165)
!188 = !DILocation(line: 90, column: 51, scope: !165)
!189 = !DILocation(line: 90, column: 9, scope: !165)
!190 = !DILocation(line: 91, column: 6, scope: !165)
!191 = distinct !DISubprogram(name: "size_hint<core::slice::iter::Iter<u8>, u8>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h9ed59b6c5a0a8a4aE", scope: !167, file: !166, line: 47, type: !192, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !174, retainedNodes: !212)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !211}
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !195, templateParams: !19, identifier: "f906b68f221a6503b6525b65c4ce4669")
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !2, baseType: !9, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !194, file: !2, baseType: !198, size: 128, align: 64, offset: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !64, file: !2, size: 128, align: 64, elements: !199, templateParams: !19, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!199 = !{!200}
!200 = !DICompositeType(tag: DW_TAG_variant_part, scope: !198, file: !2, size: 128, align: 64, elements: !201, templateParams: !19, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !210)
!201 = !{!202, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !200, file: !2, baseType: !203, size: 128, align: 64, extraData: i64 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !198, file: !2, size: 128, align: 64, elements: !19, templateParams: !204, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "T", type: !9)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !200, file: !2, baseType: !207, size: 128, align: 64, extraData: i64 1)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !198, file: !2, size: 128, align: 64, elements: !208, templateParams: !204, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !207, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !2, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::copied::Copied<core::slice::iter::Iter<u8>>", baseType: !147, size: 64, align: 64, dwarfAddressSpace: 0)
!212 = !{!213}
!213 = !DILocalVariable(name: "self", arg: 1, scope: !191, file: !166, line: 47, type: !211)
!214 = !DILocation(line: 47, column: 18, scope: !191)
!215 = !DILocation(line: 48, column: 9, scope: !191)
!216 = !DILocation(line: 49, column: 6, scope: !191)
!217 = distinct !DISubprogram(name: "from_residual<(), ()>", linkageName: "_ZN104_$LT$core..ops..control_flow..ControlFlow$LT$B$C$C$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h1e66e656f3c187b8E", scope: !219, file: !218, line: 119, type: !222, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !232, retainedNodes: !258)
!218 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/control_flow.rs", directory: "", checksumkind: CSK_MD5, checksum: "f9597a58930c0b329415d1c88aa0ccc8")
!219 = !DINamespace(name: "{impl#1}", scope: !220)
!220 = !DINamespace(name: "control_flow", scope: !221)
!221 = !DINamespace(name: "ops", scope: !31)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !240}
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), ()>", scope: !220, file: !2, size: 8, align: 8, elements: !225, templateParams: !19, identifier: "b9608799534fb3d94cea67b203699726")
!225 = !{!226}
!226 = !DICompositeType(tag: DW_TAG_variant_part, scope: !224, file: !2, size: 8, align: 8, elements: !227, templateParams: !19, identifier: "3455bc8ad70bf6d2c815cb3b82c5013b", discriminator: !239)
!227 = !{!228, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !226, file: !2, baseType: !229, size: 8, align: 8, extraData: i64 0)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !224, file: !2, size: 8, align: 8, elements: !230, templateParams: !232, identifier: "4d3a420f61bfb95bb55203c048a32d")
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !229, file: !2, baseType: !7, align: 8, offset: 8)
!232 = !{!233, !234}
!233 = !DITemplateTypeParameter(name: "B", type: !7)
!234 = !DITemplateTypeParameter(name: "C", type: !7)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !226, file: !2, baseType: !236, size: 8, align: 8, extraData: i64 1)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !224, file: !2, size: 8, align: 8, elements: !237, templateParams: !232, identifier: "29daff6f123047962c84cd150d55e04e")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !236, file: !2, baseType: !7, align: 8, offset: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagArtificial)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<(), core::convert::Infallible>", scope: !220, file: !2, align: 8, elements: !241, templateParams: !19, identifier: "c2e041f84497b19af2c87d65889ac16")
!241 = !{!242}
!242 = !DICompositeType(tag: DW_TAG_variant_part, scope: !240, file: !2, align: 8, elements: !243, templateParams: !19, identifier: "44a3ea7c44d1f6f3e67df79579007fe3")
!243 = !{!244, !254}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !242, file: !2, baseType: !245, align: 8)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !240, file: !2, align: 8, elements: !246, templateParams: !252, identifier: "2a9917875522c49dd10de08cb32038db")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !2, baseType: !248, align: 8)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !249, file: !2, align: 8, elements: !250, templateParams: !19, identifier: "54da939063c7c2baf203c9f582cd0995")
!249 = !DINamespace(name: "convert", scope: !31)
!250 = !{!251}
!251 = !DICompositeType(tag: DW_TAG_variant_part, scope: !248, file: !2, align: 8, elements: !19, identifier: "8a046f69014feadb4a5e941e4277afe9")
!252 = !{!233, !253}
!253 = !DITemplateTypeParameter(name: "C", type: !248)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !242, file: !2, baseType: !255, align: 8)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !240, file: !2, align: 8, elements: !256, templateParams: !252, identifier: "98b9597d4b5da3066bbf2dacc27c74bd")
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !255, file: !2, baseType: !7, align: 8)
!258 = !{!259, !260}
!259 = !DILocalVariable(name: "residual", arg: 1, scope: !217, file: !218, line: 119, type: !240)
!260 = !DILocalVariable(name: "b", scope: !261, file: !218, line: 121, type: !7, align: 1)
!261 = distinct !DILexicalBlock(scope: !217, file: !218, line: 121, column: 13)
!262 = !DILocation(line: 119, column: 22, scope: !217)
!263 = !DILocation(line: 121, column: 32, scope: !261)
!264 = !DILocation(line: 121, column: 38, scope: !261)
!265 = !DILocation(line: 123, column: 6, scope: !217)
!266 = !{i8 0, i8 2}
!267 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h027adc00ed696f09E", scope: !269, file: !268, line: 278, type: !271, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !285)
!268 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!269 = !DINamespace(name: "{impl#3}", scope: !270)
!270 = !DINamespace(name: "index", scope: !89)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !278, !273}
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !274, templateParams: !19, identifier: "7b54d414f2f329e57c9aa3e4ca07f4")
!274 = !{!275, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !273, file: !2, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !273, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !279, file: !2, size: 128, align: 64, elements: !280, templateParams: !283, identifier: "855eb37746b15049ea4556b174e97dd7")
!279 = !DINamespace(name: "range", scope: !221)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !278, file: !2, baseType: !9, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !278, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "Idx", type: !9)
!285 = !{!286, !287, !288}
!286 = !DILocalVariable(name: "self", arg: 1, scope: !267, file: !268, line: 278, type: !278)
!287 = !DILocalVariable(name: "slice", arg: 2, scope: !267, file: !268, line: 278, type: !273)
!288 = !DILocalVariable(name: "runtime", scope: !289, file: !268, line: 285, type: !292, align: 8)
!289 = !DILexicalBlockFile(scope: !290, file: !268, discriminator: 0)
!290 = distinct !DILexicalBlock(scope: !267, file: !291, line: 2336, column: 13)
!291 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "f96ba730d7cf23ae45fdc72e7caf5f1b")
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !293, file: !2, size: 192, align: 64, elements: !294, templateParams: !19, identifier: "3899877b232b8d576af2a125fa395e55")
!293 = !DINamespace(name: "get_unchecked", scope: !269)
!294 = !{!295, !297, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__start", scope: !292, file: !2, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__end", scope: !292, file: !2, baseType: !296, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__slice", scope: !292, file: !2, baseType: !299, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const [u8]", baseType: !273, size: 64, align: 64, dwarfAddressSpace: 0)
!300 = !DILocation(line: 278, column: 29, scope: !267)
!301 = !DILocation(line: 278, column: 35, scope: !267)
!302 = !DILocation(line: 285, column: 13, scope: !289)
!303 = !DILocation(line: 286, column: 39, scope: !267)
!304 = !DILocalVariable(name: "self", scope: !305, file: !268, line: 286, type: !273, align: 8)
!305 = !DILexicalBlockFile(scope: !306, file: !268, discriminator: 0)
!306 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$6as_ptr17hf8efb5a105c8a645E", scope: !308, file: !307, line: 1385, type: !310, scopeLine: 1385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !312)
!307 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!308 = !DINamespace(name: "{impl#1}", scope: !309)
!309 = !DINamespace(name: "const_ptr", scope: !94)
!310 = !DISubroutineType(types: !311)
!311 = !{!97, !273}
!312 = !{!304}
!313 = !DILocation(line: 286, column: 39, scope: !305, inlinedAt: !303)
!314 = !DILocalVariable(name: "self", scope: !315, file: !268, line: 286, type: !97, align: 8)
!315 = !DILexicalBlockFile(scope: !316, file: !268, discriminator: 0)
!316 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hdeb7c1729690ff7fE", scope: !317, file: !307, line: 871, type: !318, scopeLine: 871, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !320)
!317 = !DINamespace(name: "{impl#0}", scope: !309)
!318 = !DISubroutineType(types: !319)
!319 = !{!97, !97, !9}
!320 = !{!314, !321}
!321 = !DILocalVariable(name: "count", scope: !315, file: !268, line: 286, type: !9, align: 8)
!322 = !DILocation(line: 286, column: 39, scope: !315, inlinedAt: !303)
!323 = !DILocation(line: 286, column: 58, scope: !267)
!324 = !DILocalVariable(name: "self", scope: !325, file: !268, line: 286, type: !97, align: 8)
!325 = !DILexicalBlockFile(scope: !326, file: !268, discriminator: 0)
!326 = distinct !DISubprogram(name: "offset<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h8b35729b9a3365e8E", scope: !317, file: !307, line: 453, type: !327, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !330)
!327 = !DISubroutineType(types: !328)
!328 = !{!97, !97, !329}
!329 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!330 = !{!324, !331}
!331 = !DILocalVariable(name: "count", scope: !325, file: !268, line: 286, type: !329, align: 8)
!332 = !DILocation(line: 286, column: 39, scope: !325, inlinedAt: !333)
!333 = !DILocation(line: 876, column: 18, scope: !316, inlinedAt: !303)
!334 = !DILocalVariable(name: "data", scope: !335, file: !268, line: 286, type: !97, align: 8)
!335 = !DILexicalBlockFile(scope: !336, file: !268, discriminator: 0)
!336 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h4e0dd63690dcfc18E", scope: !94, file: !337, line: 695, type: !338, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !340)
!337 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!338 = !DISubroutineType(types: !339)
!339 = !{!273, !97, !9}
!340 = !{!334, !341}
!341 = !DILocalVariable(name: "len", scope: !335, file: !268, line: 286, type: !9, align: 8)
!342 = !DILocation(line: 286, column: 13, scope: !335, inlinedAt: !343)
!343 = !DILocation(line: 286, column: 13, scope: !267)
!344 = !DILocation(line: 286, column: 71, scope: !267)
!345 = !DILocalVariable(name: "self", scope: !346, file: !268, line: 286, type: !97, align: 8)
!346 = !DILexicalBlockFile(scope: !347, file: !268, discriminator: 0)
!347 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17h46b8598cf8ede31bE", scope: !317, file: !307, line: 46, type: !348, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !351, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!6, !97}
!350 = !{!345}
!351 = !{!99, !352}
!352 = !DITemplateTypeParameter(name: "U", type: !7)
!353 = !DILocation(line: 286, column: 13, scope: !346, inlinedAt: !354)
!354 = !DILocation(line: 696, column: 20, scope: !336, inlinedAt: !343)
!355 = !DILocalVariable(name: "data_address", scope: !356, file: !268, line: 286, type: !6, align: 8)
!356 = !DILexicalBlockFile(scope: !357, file: !268, discriminator: 0)
!357 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17h5216e18adf09ab15E", scope: !359, file: !358, line: 110, type: !360, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !362)
!358 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "59565ed3c34dee3e8f8928c29f8f7ce4")
!359 = !DINamespace(name: "metadata", scope: !94)
!360 = !DISubroutineType(types: !361)
!361 = !{!273, !6, !9}
!362 = !{!355, !363}
!363 = !DILocalVariable(name: "metadata", scope: !356, file: !268, line: 286, type: !9, align: 8)
!364 = !DILocation(line: 286, column: 13, scope: !356, inlinedAt: !365)
!365 = !DILocation(line: 696, column: 5, scope: !336, inlinedAt: !343)
!366 = !DILocation(line: 288, column: 6, scope: !267)
!367 = distinct !DISubprogram(name: "next<core::str::iter::Chars>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h8661d2a79e81aa4fE", scope: !369, file: !368, line: 45, type: !371, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !400, retainedNodes: !402)
!368 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/iter/adapters/enumerate.rs", directory: "", checksumkind: CSK_MD5, checksum: "f31ca9b0d4951eac7d9a8089e3599b62")
!369 = !DINamespace(name: "{impl#1}", scope: !370)
!370 = !DINamespace(name: "enumerate", scope: !59)
!371 = !DISubroutineType(types: !372)
!372 = !{!373, !392}
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, char)>", scope: !64, file: !2, size: 128, align: 64, elements: !374, templateParams: !19, identifier: "28521b5aedd26fdf1e261cada33bc9ce")
!374 = !{!375}
!375 = !DICompositeType(tag: DW_TAG_variant_part, scope: !373, file: !2, size: 128, align: 64, elements: !376, templateParams: !19, identifier: "6a1e62ea70f4d529357407ee7335d2b", discriminator: !390)
!376 = !{!377, !386}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !375, file: !2, baseType: !378, size: 128, align: 64, extraData: i64 1114112)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !373, file: !2, size: 128, align: 64, elements: !19, templateParams: !379, identifier: "e1903e1b3a7e8f4f17c5e2e6c7f94d8b")
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "T", type: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, char)", file: !2, size: 128, align: 64, elements: !382, templateParams: !19, identifier: "89785b0a14c18bab4f06ff5760e2591e")
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !381, file: !2, baseType: !9, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !381, file: !2, baseType: !385, size: 32, align: 32, offset: 64)
!385 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !375, file: !2, baseType: !387, size: 128, align: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !373, file: !2, size: 128, align: 64, elements: !388, templateParams: !379, identifier: "925825e8f4185badbee317033905d3e7")
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !387, file: !2, baseType: !381, size: 128, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, scope: !373, file: !2, baseType: !391, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!391 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::enumerate::Enumerate<core::str::iter::Chars>", baseType: !393, size: 64, align: 64, dwarfAddressSpace: 0)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::str::iter::Chars>", scope: !370, file: !2, size: 192, align: 64, elements: !394, templateParams: !400, identifier: "92c254cb3c0cfd318f40d41654f06ade")
!394 = !{!395, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !393, file: !2, baseType: !396, size: 128, align: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chars", scope: !143, file: !2, size: 128, align: 64, elements: !397, templateParams: !19, identifier: "bf4266910c22c2e7c5f8afbf04b94119")
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !396, file: !2, baseType: !87, size: 128, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !393, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!400 = !{!401}
!401 = !DITemplateTypeParameter(name: "I", type: !396)
!402 = !{!403, !404, !406, !420, !422}
!403 = !DILocalVariable(name: "self", arg: 1, scope: !367, file: !368, line: 45, type: !392)
!404 = !DILocalVariable(name: "a", scope: !405, file: !368, line: 46, type: !385, align: 4)
!405 = distinct !DILexicalBlock(scope: !367, file: !368, line: 46, column: 9)
!406 = !DILocalVariable(name: "residual", scope: !407, file: !368, line: 46, type: !408, align: 1)
!407 = distinct !DILexicalBlock(scope: !367, file: !368, line: 46, column: 33)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::convert::Infallible>", scope: !64, file: !2, align: 8, elements: !409, templateParams: !19, identifier: "d8a1490c995f47139381e35a5e6e5cdb")
!409 = !{!410}
!410 = !DICompositeType(tag: DW_TAG_variant_part, scope: !408, file: !2, align: 8, elements: !411, templateParams: !19, identifier: "9b62236bada376e41df23b6f70477fcc")
!411 = !{!412, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !410, file: !2, baseType: !413, align: 8)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !408, file: !2, align: 8, elements: !19, templateParams: !414, identifier: "6887a830e9518178209fc3c61f1ca37d")
!414 = !{!415}
!415 = !DITemplateTypeParameter(name: "T", type: !248)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !410, file: !2, baseType: !417, align: 8)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !408, file: !2, align: 8, elements: !418, templateParams: !414, identifier: "57c813c1928930715dbbb4312e4c0fa4")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !417, file: !2, baseType: !248, align: 8)
!420 = !DILocalVariable(name: "val", scope: !421, file: !368, line: 46, type: !385, align: 4)
!421 = distinct !DILexicalBlock(scope: !367, file: !368, line: 46, column: 17)
!422 = !DILocalVariable(name: "i", scope: !423, file: !368, line: 47, type: !9, align: 8)
!423 = distinct !DILexicalBlock(scope: !405, file: !368, line: 47, column: 9)
!424 = !DILocation(line: 45, column: 13, scope: !367)
!425 = !DILocalVariable(name: "self", scope: !426, file: !368, line: 46, type: !448, align: 4)
!426 = !DILexicalBlockFile(scope: !427, file: !368, discriminator: 0)
!427 = distinct !DISubprogram(name: "branch<char>", linkageName: "_ZN75_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17h934df6cd5ceddcc0E", scope: !429, file: !428, line: 2290, type: !430, scopeLine: 2290, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !454, retainedNodes: !461)
!428 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "86a5483c3993f03690545387e943de77")
!429 = !DINamespace(name: "{impl#35}", scope: !64)
!430 = !DISubroutineType(types: !431)
!431 = !{!432, !448}
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::option::Option<core::convert::Infallible>, char>", scope: !220, file: !2, size: 32, align: 32, elements: !433, templateParams: !19, identifier: "a213f93449b85c85af57ecb62f4ec3b8")
!433 = !{!434}
!434 = !DICompositeType(tag: DW_TAG_variant_part, scope: !432, file: !2, size: 32, align: 32, elements: !435, templateParams: !19, identifier: "edc8532839635b8ae344033bbd9b7765", discriminator: !447)
!435 = !{!436, !443}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !434, file: !2, baseType: !437, size: 32, align: 32)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !432, file: !2, size: 32, align: 32, elements: !438, templateParams: !440, identifier: "936171a15d71a2bf3685d825e60b0b32")
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !437, file: !2, baseType: !385, size: 32, align: 32)
!440 = !{!441, !442}
!441 = !DITemplateTypeParameter(name: "B", type: !408)
!442 = !DITemplateTypeParameter(name: "C", type: !385)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !434, file: !2, baseType: !444, size: 32, align: 32, extraData: i64 1114112)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !432, file: !2, size: 32, align: 32, elements: !445, templateParams: !440, identifier: "9b221873f630a9338d87752792fc5d34")
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !444, file: !2, baseType: !408, align: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, scope: !432, file: !2, baseType: !391, size: 32, align: 32, flags: DIFlagArtificial)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<char>", scope: !64, file: !2, size: 32, align: 32, elements: !449, templateParams: !19, identifier: "182842703d13227530d78ce56a0c403e")
!449 = !{!450}
!450 = !DICompositeType(tag: DW_TAG_variant_part, scope: !448, file: !2, size: 32, align: 32, elements: !451, templateParams: !19, identifier: "a003d793d4429b686ac87860dc5c04de", discriminator: !460)
!451 = !{!452, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !450, file: !2, baseType: !453, size: 32, align: 32, extraData: i64 1114112)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !448, file: !2, size: 32, align: 32, elements: !19, templateParams: !454, identifier: "3f6dc1f1907f9d5961a7508f51084ff9")
!454 = !{!455}
!455 = !DITemplateTypeParameter(name: "T", type: !385)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !450, file: !2, baseType: !457, size: 32, align: 32)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !448, file: !2, size: 32, align: 32, elements: !458, templateParams: !454, identifier: "8e96e38967905576ed8699e66885c8c4")
!458 = !{!459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !457, file: !2, baseType: !385, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, scope: !448, file: !2, baseType: !391, size: 32, align: 32, flags: DIFlagArtificial)
!461 = !{!425, !462}
!462 = !DILocalVariable(name: "v", scope: !463, file: !368, line: 46, type: !385, align: 4)
!463 = !DILexicalBlockFile(scope: !464, file: !368, discriminator: 0)
!464 = distinct !DILexicalBlock(scope: !427, file: !428, line: 2292, column: 13)
!465 = !DILocation(line: 46, column: 17, scope: !426, inlinedAt: !466)
!466 = !DILocation(line: 46, column: 17, scope: !367)
!467 = !DILocation(line: 46, column: 33, scope: !407)
!468 = !DILocalVariable(name: "residual", scope: !469, file: !368, line: 46, type: !408, align: 1)
!469 = !DILexicalBlockFile(scope: !470, file: !368, discriminator: 0)
!470 = distinct !DISubprogram(name: "from_residual<(usize, char)>", linkageName: "_ZN84_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..FromResidual$GT$13from_residual17h8a45e523bf4b438aE", scope: !471, file: !428, line: 2302, type: !472, scopeLine: 2302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !379, retainedNodes: !474)
!471 = !DINamespace(name: "{impl#36}", scope: !64)
!472 = !DISubroutineType(types: !473)
!473 = !{!373, !408}
!474 = !{!468}
!475 = !DILocation(line: 46, column: 17, scope: !469, inlinedAt: !476)
!476 = !DILocation(line: 46, column: 17, scope: !407)
!477 = !{i32 0, i32 1114113}
!478 = !{i32 0, i32 1114112}
!479 = !DILocation(line: 46, column: 17, scope: !463, inlinedAt: !466)
!480 = !DILocation(line: 46, column: 17, scope: !421)
!481 = !DILocation(line: 46, column: 13, scope: !405)
!482 = !DILocation(line: 47, column: 17, scope: !405)
!483 = !DILocation(line: 47, column: 13, scope: !423)
!484 = !DILocation(line: 48, column: 9, scope: !423)
!485 = !DILocation(line: 50, column: 6, scope: !367)
!486 = !DILocation(line: 49, column: 14, scope: !423)
!487 = !DILocation(line: 49, column: 9, scope: !423)
!488 = !DILocation(line: 50, column: 5, scope: !367)
!489 = !DILocation(line: 45, column: 5, scope: !367)
!490 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$5index17hb301fe5216e6dc3bE", scope: !491, file: !268, line: 388, type: !492, scopeLine: 388, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !513)
!491 = !DINamespace(name: "{impl#5}", scope: !270)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !498, !494, !501}
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !495, templateParams: !19, identifier: "7d49e60d2ca720f66806f7375f860e2")
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !494, file: !2, baseType: !276, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !494, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !279, file: !2, size: 64, align: 64, elements: !499, templateParams: !283, identifier: "a58758f4d6a6e1468075e24121943e64")
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !498, file: !2, baseType: !9, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !502, size: 64, align: 64, dwarfAddressSpace: 0)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !503, file: !2, size: 192, align: 64, elements: !505, templateParams: !19, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!503 = !DINamespace(name: "location", scope: !504)
!504 = !DINamespace(name: "panic", scope: !31)
!505 = !{!506, !511, !512}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !502, file: !2, baseType: !507, size: 128, align: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !508, templateParams: !19, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !507, file: !2, baseType: !276, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !507, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !502, file: !2, baseType: !391, size: 32, align: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !502, file: !2, baseType: !391, size: 32, align: 32, offset: 160)
!513 = !{!514, !515}
!514 = !DILocalVariable(name: "self", arg: 1, scope: !490, file: !268, line: 388, type: !498)
!515 = !DILocalVariable(name: "slice", arg: 2, scope: !490, file: !268, line: 388, type: !494)
!516 = !DILocation(line: 388, column: 14, scope: !490)
!517 = !DILocation(line: 388, column: 20, scope: !490)
!518 = !DILocation(line: 389, column: 12, scope: !490)
!519 = !DILocation(line: 393, column: 20, scope: !490)
!520 = !DILocalVariable(name: "self", scope: !521, file: !268, line: 393, type: !498, align: 8)
!521 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17hf8498f96276a5500E", scope: !491, file: !268, line: 376, type: !522, scopeLine: 376, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!273, !498, !273}
!524 = !{!520, !525}
!525 = !DILocalVariable(name: "slice", scope: !521, file: !268, line: 393, type: !273, align: 8)
!526 = !DILocation(line: 393, column: 20, scope: !521, inlinedAt: !519)
!527 = !DILocation(line: 393, column: 39, scope: !490)
!528 = !DILocalVariable(name: "self", scope: !529, file: !268, line: 393, type: !273, align: 8)
!529 = !DILexicalBlockFile(scope: !530, file: !268, discriminator: 0)
!530 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$3len17h41b6b1eb103e841eE", scope: !308, file: !307, line: 1365, type: !531, scopeLine: 1365, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !533)
!531 = !DISubroutineType(types: !532)
!532 = !{!9, !273}
!533 = !{!528}
!534 = !DILocation(line: 393, column: 20, scope: !529, inlinedAt: !535)
!535 = !DILocation(line: 378, column: 31, scope: !521, inlinedAt: !519)
!536 = !DILocalVariable(name: "ptr", scope: !537, file: !268, line: 393, type: !273, align: 8)
!537 = !DILexicalBlockFile(scope: !538, file: !268, discriminator: 0)
!538 = distinct !DISubprogram(name: "metadata<[u8]>", linkageName: "_ZN4core3ptr8metadata8metadata17hd0191cae52bdc169E", scope: !359, file: !358, line: 93, type: !531, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !98, retainedNodes: !539)
!539 = !{!536}
!540 = !DILocation(line: 393, column: 20, scope: !537, inlinedAt: !541)
!541 = !DILocation(line: 1366, column: 9, scope: !530, inlinedAt: !535)
!542 = !DILocation(line: 390, column: 13, scope: !490)
!543 = !DILocation(line: 394, column: 6, scope: !490)
!544 = distinct !DISubprogram(name: "new<core::str::iter::Bytes, core::str::iter::Bytes>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17h217811916799bea8E", scope: !545, file: !56, line: 262, type: !546, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !157, retainedNodes: !548)
!545 = !DINamespace(name: "{impl#5}", scope: !58)
!546 = !DISubroutineType(types: !547)
!547 = !{!139, !142, !142}
!548 = !{!549, !550, !551, !553}
!549 = !DILocalVariable(name: "a", arg: 1, scope: !544, file: !56, line: 262, type: !142)
!550 = !DILocalVariable(name: "b", arg: 2, scope: !544, file: !56, line: 262, type: !142)
!551 = !DILocalVariable(name: "a_len", scope: !552, file: !56, line: 263, type: !9, align: 8)
!552 = distinct !DILexicalBlock(scope: !544, file: !56, line: 263, column: 9)
!553 = !DILocalVariable(name: "len", scope: !554, file: !56, line: 264, type: !9, align: 8)
!554 = distinct !DILexicalBlock(scope: !552, file: !56, line: 264, column: 9)
!555 = !DILocation(line: 262, column: 12, scope: !544)
!556 = !DILocation(line: 262, column: 18, scope: !544)
!557 = !DILocation(line: 263, column: 21, scope: !544)
!558 = !DILocation(line: 266, column: 5, scope: !544)
!559 = !DILocation(line: 263, column: 13, scope: !552)
!560 = !DILocation(line: 264, column: 28, scope: !552)
!561 = !DILocalVariable(name: "v1", scope: !562, file: !56, line: 264, type: !9, align: 8)
!562 = !DILexicalBlockFile(scope: !563, file: !56, discriminator: 0)
!563 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3min17h502a406208017ef1E", scope: !38, file: !564, line: 1214, type: !565, scopeLine: 1214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !204, retainedNodes: !567)
!564 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "381f61764ec5ac4111e955260ff27c96")
!565 = !DISubroutineType(types: !566)
!566 = !{!9, !9, !9}
!567 = !{!561, !568}
!568 = !DILocalVariable(name: "v2", scope: !562, file: !56, line: 264, type: !9, align: 8)
!569 = !DILocation(line: 264, column: 19, scope: !562, inlinedAt: !570)
!570 = !DILocation(line: 264, column: 19, scope: !552)
!571 = !DILocation(line: 264, column: 35, scope: !552)
!572 = !DILocation(line: 264, column: 13, scope: !554)
!573 = !DILocation(line: 265, column: 15, scope: !554)
!574 = !DILocation(line: 265, column: 18, scope: !554)
!575 = !DILocation(line: 265, column: 9, scope: !554)
!576 = !DILocation(line: 266, column: 6, scope: !544)
!577 = !DILocation(line: 262, column: 5, scope: !544)
!578 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u8>, core::slice::iter::Iter<u8>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17h737ceea019c6f944E", scope: !545, file: !56, line: 262, type: !579, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !110, retainedNodes: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{!84, !87, !87}
!581 = !{!582, !583, !584, !586}
!582 = !DILocalVariable(name: "a", arg: 1, scope: !578, file: !56, line: 262, type: !87)
!583 = !DILocalVariable(name: "b", arg: 2, scope: !578, file: !56, line: 262, type: !87)
!584 = !DILocalVariable(name: "a_len", scope: !585, file: !56, line: 263, type: !9, align: 8)
!585 = distinct !DILexicalBlock(scope: !578, file: !56, line: 263, column: 9)
!586 = !DILocalVariable(name: "len", scope: !587, file: !56, line: 264, type: !9, align: 8)
!587 = distinct !DILexicalBlock(scope: !585, file: !56, line: 264, column: 9)
!588 = !DILocation(line: 262, column: 12, scope: !578)
!589 = !DILocation(line: 262, column: 18, scope: !578)
!590 = !DILocation(line: 263, column: 21, scope: !578)
!591 = !DILocation(line: 266, column: 5, scope: !578)
!592 = !DILocation(line: 263, column: 13, scope: !585)
!593 = !DILocation(line: 264, column: 28, scope: !585)
!594 = !DILocalVariable(name: "v1", scope: !595, file: !56, line: 264, type: !9, align: 8)
!595 = !DILexicalBlockFile(scope: !596, file: !56, discriminator: 0)
!596 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3min17h502a406208017ef1E", scope: !38, file: !564, line: 1214, type: !565, scopeLine: 1214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !204, retainedNodes: !597)
!597 = !{!594, !598}
!598 = !DILocalVariable(name: "v2", scope: !595, file: !56, line: 264, type: !9, align: 8)
!599 = !DILocation(line: 264, column: 19, scope: !595, inlinedAt: !600)
!600 = !DILocation(line: 264, column: 19, scope: !585)
!601 = !DILocation(line: 264, column: 35, scope: !585)
!602 = !DILocation(line: 264, column: 13, scope: !587)
!603 = !DILocation(line: 265, column: 15, scope: !587)
!604 = !DILocation(line: 265, column: 18, scope: !587)
!605 = !DILocation(line: 265, column: 9, scope: !587)
!606 = !DILocation(line: 266, column: 6, scope: !578)
!607 = !DILocation(line: 262, column: 5, scope: !578)
!608 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u8>, core::slice::iter::Iter<u8>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17h21390a2de8906e8eE", scope: !545, file: !56, line: 269, type: !61, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !110, retainedNodes: !609)
!609 = !{!610, !611, !613}
!610 = !DILocalVariable(name: "self", arg: 1, scope: !608, file: !56, line: 269, type: !83)
!611 = !DILocalVariable(name: "i", scope: !612, file: !56, line: 271, type: !9, align: 8)
!612 = distinct !DILexicalBlock(scope: !608, file: !56, line: 271, column: 13)
!613 = !DILocalVariable(name: "i", scope: !614, file: !56, line: 280, type: !9, align: 8)
!614 = distinct !DILexicalBlock(scope: !608, file: !56, line: 280, column: 13)
!615 = !DILocation(line: 269, column: 13, scope: !608)
!616 = !DILocation(line: 270, column: 12, scope: !608)
!617 = !DILocation(line: 270, column: 25, scope: !608)
!618 = !DILocation(line: 279, column: 19, scope: !608)
!619 = !DILocation(line: 271, column: 21, scope: !608)
!620 = !DILocation(line: 271, column: 17, scope: !612)
!621 = !DILocation(line: 274, column: 13, scope: !612)
!622 = !DILocation(line: 277, column: 23, scope: !612)
!623 = !DILocation(line: 277, column: 59, scope: !612)
!624 = !DILocation(line: 277, column: 93, scope: !612)
!625 = !DILocation(line: 277, column: 22, scope: !612)
!626 = !DILocation(line: 277, column: 17, scope: !612)
!627 = !{i64 1}
!628 = !DILocation(line: 270, column: 9, scope: !608)
!629 = !DILocation(line: 269, column: 5, scope: !608)
!630 = !DILocation(line: 293, column: 6, scope: !608)
!631 = !DILocation(line: 279, column: 46, scope: !608)
!632 = !DILocation(line: 279, column: 59, scope: !608)
!633 = !DILocation(line: 291, column: 13, scope: !608)
!634 = !DILocation(line: 279, column: 16, scope: !608)
!635 = !DILocation(line: 280, column: 21, scope: !608)
!636 = !DILocation(line: 280, column: 17, scope: !614)
!637 = !DILocation(line: 282, column: 13, scope: !614)
!638 = !DILocation(line: 283, column: 13, scope: !614)
!639 = !DILocation(line: 287, column: 17, scope: !614)
!640 = !DILocation(line: 287, column: 51, scope: !614)
!641 = !DILocation(line: 289, column: 13, scope: !614)
!642 = distinct !DISubprogram(name: "next<core::str::iter::Bytes, core::str::iter::Bytes>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17h2465c73547f4a034E", scope: !545, file: !56, line: 269, type: !119, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !157, retainedNodes: !643)
!643 = !{!644, !645, !647}
!644 = !DILocalVariable(name: "self", arg: 1, scope: !642, file: !56, line: 269, type: !138)
!645 = !DILocalVariable(name: "i", scope: !646, file: !56, line: 271, type: !9, align: 8)
!646 = distinct !DILexicalBlock(scope: !642, file: !56, line: 271, column: 13)
!647 = !DILocalVariable(name: "i", scope: !648, file: !56, line: 280, type: !9, align: 8)
!648 = distinct !DILexicalBlock(scope: !642, file: !56, line: 280, column: 13)
!649 = !DILocation(line: 269, column: 13, scope: !642)
!650 = !DILocation(line: 270, column: 12, scope: !642)
!651 = !DILocation(line: 270, column: 25, scope: !642)
!652 = !DILocation(line: 279, column: 19, scope: !642)
!653 = !DILocation(line: 271, column: 21, scope: !642)
!654 = !DILocation(line: 271, column: 17, scope: !646)
!655 = !DILocation(line: 274, column: 13, scope: !646)
!656 = !DILocation(line: 277, column: 23, scope: !646)
!657 = !DILocation(line: 277, column: 59, scope: !646)
!658 = !DILocation(line: 277, column: 93, scope: !646)
!659 = !DILocation(line: 277, column: 22, scope: !646)
!660 = !DILocation(line: 277, column: 17, scope: !646)
!661 = !DILocation(line: 270, column: 9, scope: !642)
!662 = !DILocation(line: 269, column: 5, scope: !642)
!663 = !DILocation(line: 293, column: 6, scope: !642)
!664 = !DILocation(line: 279, column: 46, scope: !642)
!665 = !DILocation(line: 279, column: 59, scope: !642)
!666 = !DILocation(line: 291, column: 13, scope: !642)
!667 = !DILocation(line: 279, column: 16, scope: !642)
!668 = !DILocation(line: 280, column: 21, scope: !642)
!669 = !DILocation(line: 280, column: 17, scope: !648)
!670 = !DILocation(line: 282, column: 13, scope: !648)
!671 = !DILocation(line: 283, column: 13, scope: !648)
!672 = !DILocation(line: 287, column: 17, scope: !648)
!673 = !DILocation(line: 287, column: 51, scope: !648)
!674 = !DILocation(line: 289, column: 13, scope: !648)
!675 = distinct !DISubprogram(name: "powi", linkageName: "_ZN3std3f3221_$LT$impl$u20$f32$GT$4powi17hb7e08f9d89fee4c8E", scope: !677, file: !676, line: 319, type: !680, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !684)
!676 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/f32.rs", directory: "", checksumkind: CSK_MD5, checksum: "8354f9c2d3aede3197eba7e9a5600f72")
!677 = !DINamespace(name: "{impl#0}", scope: !678)
!678 = !DINamespace(name: "f32", scope: !679)
!679 = !DINamespace(name: "std", scope: null)
!680 = !DISubroutineType(types: !681)
!681 = !{!682, !682, !683}
!682 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!683 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!684 = !{!685, !686}
!685 = !DILocalVariable(name: "self", arg: 1, scope: !675, file: !676, line: 319, type: !682)
!686 = !DILocalVariable(name: "n", arg: 2, scope: !675, file: !676, line: 319, type: !683)
!687 = !DILocation(line: 319, column: 17, scope: !675)
!688 = !DILocation(line: 319, column: 23, scope: !675)
!689 = !DILocation(line: 320, column: 18, scope: !675)
!690 = !DILocation(line: 321, column: 6, scope: !675)
!691 = distinct !DISubprogram(name: "powi", linkageName: "_ZN3std3f6421_$LT$impl$u20$f64$GT$4powi17h7a90dd3638f61957E", scope: !693, file: !692, line: 319, type: !695, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !698)
!692 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/f64.rs", directory: "", checksumkind: CSK_MD5, checksum: "1ebe4a0e4797d7073808ccec50216f91")
!693 = !DINamespace(name: "{impl#0}", scope: !694)
!694 = !DINamespace(name: "f64", scope: !679)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !697, !683}
!697 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!698 = !{!699, !700}
!699 = !DILocalVariable(name: "self", arg: 1, scope: !691, file: !692, line: 319, type: !697)
!700 = !DILocalVariable(name: "n", arg: 2, scope: !691, file: !692, line: 319, type: !683)
!701 = !DILocation(line: 319, column: 17, scope: !691)
!702 = !DILocation(line: 319, column: 23, scope: !691)
!703 = !DILocation(line: 320, column: 18, scope: !691)
!704 = !DILocation(line: 321, column: 6, scope: !691)
!705 = distinct !DISubprogram(name: "fmt<num_traits::FloatErrorKind>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h8581425018b943f1E", scope: !707, file: !706, line: 2361, type: !708, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !751, retainedNodes: !748)
!706 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!707 = !DINamespace(name: "{impl#59}", scope: !30)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !728, !729}
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !711, file: !2, size: 8, align: 8, elements: !712, templateParams: !19, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!711 = !DINamespace(name: "result", scope: !31)
!712 = !{!713}
!713 = !DICompositeType(tag: DW_TAG_variant_part, scope: !710, file: !2, size: 8, align: 8, elements: !714, templateParams: !19, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !727)
!714 = !{!715, !723}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !713, file: !2, baseType: !716, size: 8, align: 8, extraData: i64 0)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !710, file: !2, size: 8, align: 8, elements: !717, templateParams: !719, identifier: "cea751326735c343faf647063a65ad14")
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !716, file: !2, baseType: !7, align: 8, offset: 8)
!719 = !{!720, !721}
!720 = !DITemplateTypeParameter(name: "T", type: !7)
!721 = !DITemplateTypeParameter(name: "E", type: !722)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !30, file: !2, align: 8, elements: !19, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !713, file: !2, baseType: !724, size: 8, align: 8, extraData: i64 1)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !710, file: !2, size: 8, align: 8, elements: !725, templateParams: !719, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !724, file: !2, baseType: !722, align: 8, offset: 8)
!727 = !DIDerivedType(tag: DW_TAG_member, scope: !710, file: !2, baseType: !15, size: 8, align: 8, flags: DIFlagArtificial)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&num_traits::FloatErrorKind", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !730, size: 64, align: 64, dwarfAddressSpace: 0)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !30, file: !2, size: 512, align: 64, elements: !731, templateParams: !19, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!731 = !{!732, !733, !734, !735, !736, !737}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !730, file: !2, baseType: !391, size: 32, align: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !730, file: !2, baseType: !385, size: 32, align: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !730, file: !2, baseType: !27, size: 8, align: 8, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !730, file: !2, baseType: !198, size: 128, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !730, file: !2, baseType: !198, size: 128, align: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !730, file: !2, baseType: !738, size: 128, align: 64, offset: 256)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !739, templateParams: !19, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!739 = !{!740, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !738, file: !2, baseType: !741, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64, dwarfAddressSpace: 0)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !19, identifier: "abb712b259efc5e79bb67900edf24920")
!743 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !738, file: !2, baseType: !744, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !745, size: 64, align: 64, dwarfAddressSpace: 0)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 3, lowerBound: 0)
!748 = !{!749, !750}
!749 = !DILocalVariable(name: "self", arg: 1, scope: !705, file: !706, line: 2361, type: !728)
!750 = !DILocalVariable(name: "f", arg: 2, scope: !705, file: !706, line: 2361, type: !729)
!751 = !{!752}
!752 = !DITemplateTypeParameter(name: "T", type: !13)
!753 = !DILocation(line: 2361, column: 20, scope: !705)
!754 = !DILocation(line: 2361, column: 27, scope: !705)
!755 = !DILocation(line: 2361, column: 71, scope: !705)
!756 = !DILocation(line: 2361, column: 62, scope: !705)
!757 = !DILocation(line: 2361, column: 84, scope: !705)
!758 = distinct !DISubprogram(name: "div", linkageName: "_ZN45_$LT$f32$u20$as$u20$core..ops..arith..Div$GT$3div17h486d2693cf3cae96E", scope: !760, file: !759, line: 520, type: !762, scopeLine: 520, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !764)
!759 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/arith.rs", directory: "", checksumkind: CSK_MD5, checksum: "57699c352beef63103a9f45527b1cedb")
!760 = !DINamespace(name: "{impl#216}", scope: !761)
!761 = !DINamespace(name: "arith", scope: !221)
!762 = !DISubroutineType(types: !763)
!763 = !{!682, !682, !682}
!764 = !{!765, !766}
!765 = !DILocalVariable(name: "self", arg: 1, scope: !758, file: !759, line: 520, type: !682)
!766 = !DILocalVariable(name: "other", arg: 2, scope: !758, file: !759, line: 520, type: !682)
!767 = !DILocation(line: 520, column: 20, scope: !758)
!768 = !DILocation(line: 520, column: 26, scope: !758)
!769 = !DILocation(line: 520, column: 45, scope: !758)
!770 = !DILocation(line: 520, column: 59, scope: !758)
!771 = distinct !DISubprogram(name: "mul", linkageName: "_ZN45_$LT$f32$u20$as$u20$core..ops..arith..Mul$GT$3mul17h76b1e3c0dcee3a2eE", scope: !772, file: !759, line: 362, type: !762, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !773)
!772 = !DINamespace(name: "{impl#124}", scope: !761)
!773 = !{!774, !775}
!774 = !DILocalVariable(name: "self", arg: 1, scope: !771, file: !759, line: 362, type: !682)
!775 = !DILocalVariable(name: "other", arg: 2, scope: !771, file: !759, line: 362, type: !682)
!776 = !DILocation(line: 362, column: 20, scope: !771)
!777 = !DILocation(line: 362, column: 26, scope: !771)
!778 = !DILocation(line: 362, column: 45, scope: !771)
!779 = !DILocation(line: 362, column: 59, scope: !771)
!780 = distinct !DISubprogram(name: "neg", linkageName: "_ZN45_$LT$f32$u20$as$u20$core..ops..arith..Neg$GT$3neg17hf2d7af8905ae0e44E", scope: !781, file: !759, line: 712, type: !782, scopeLine: 712, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !784)
!781 = !DINamespace(name: "{impl#286}", scope: !761)
!782 = !DISubroutineType(types: !783)
!783 = !{!682, !682}
!784 = !{!785}
!785 = !DILocalVariable(name: "self", arg: 1, scope: !780, file: !759, line: 712, type: !682)
!786 = !DILocation(line: 712, column: 20, scope: !780)
!787 = !DILocation(line: 712, column: 34, scope: !780)
!788 = !DILocation(line: 712, column: 41, scope: !780)
!789 = distinct !DISubprogram(name: "div", linkageName: "_ZN45_$LT$f64$u20$as$u20$core..ops..arith..Div$GT$3div17h51eab12971dd6ab7E", scope: !790, file: !759, line: 520, type: !791, scopeLine: 520, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !793)
!790 = !DINamespace(name: "{impl#217}", scope: !761)
!791 = !DISubroutineType(types: !792)
!792 = !{!697, !697, !697}
!793 = !{!794, !795}
!794 = !DILocalVariable(name: "self", arg: 1, scope: !789, file: !759, line: 520, type: !697)
!795 = !DILocalVariable(name: "other", arg: 2, scope: !789, file: !759, line: 520, type: !697)
!796 = !DILocation(line: 520, column: 20, scope: !789)
!797 = !DILocation(line: 520, column: 26, scope: !789)
!798 = !DILocation(line: 520, column: 45, scope: !789)
!799 = !DILocation(line: 520, column: 59, scope: !789)
!800 = distinct !DISubprogram(name: "mul", linkageName: "_ZN45_$LT$f64$u20$as$u20$core..ops..arith..Mul$GT$3mul17h9b80d3a4e27ba66bE", scope: !801, file: !759, line: 362, type: !791, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !802)
!801 = !DINamespace(name: "{impl#125}", scope: !761)
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "self", arg: 1, scope: !800, file: !759, line: 362, type: !697)
!804 = !DILocalVariable(name: "other", arg: 2, scope: !800, file: !759, line: 362, type: !697)
!805 = !DILocation(line: 362, column: 20, scope: !800)
!806 = !DILocation(line: 362, column: 26, scope: !800)
!807 = !DILocation(line: 362, column: 45, scope: !800)
!808 = !DILocation(line: 362, column: 59, scope: !800)
!809 = distinct !DISubprogram(name: "neg", linkageName: "_ZN45_$LT$f64$u20$as$u20$core..ops..arith..Neg$GT$3neg17h2916e189c8f22844E", scope: !810, file: !759, line: 712, type: !811, scopeLine: 712, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !813)
!810 = !DINamespace(name: "{impl#287}", scope: !761)
!811 = !DISubroutineType(types: !812)
!812 = !{!697, !697}
!813 = !{!814}
!814 = !DILocalVariable(name: "self", arg: 1, scope: !809, file: !759, line: 712, type: !697)
!815 = !DILocation(line: 712, column: 20, scope: !809)
!816 = !DILocation(line: 712, column: 34, scope: !809)
!817 = !DILocation(line: 712, column: 41, scope: !809)
!818 = distinct !DISubprogram(name: "const_eval_select<(f32), fn(f32) -> u32, core::f32::{impl#0}::to_bits::{closure_env#0}, u32>", linkageName: "_ZN4core10intrinsics17const_eval_select17h6441fb96c40482f1E", scope: !819, file: !291, line: 2687, type: !820, scopeLine: 2687, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !836, retainedNodes: !832)
!819 = !DINamespace(name: "intrinsics", scope: !31)
!820 = !DISubroutineType(types: !821)
!821 = !{!391, !822, !825, !828}
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f32)", file: !2, size: 32, align: 32, elements: !823, templateParams: !19, identifier: "27758afe5dfa6afca4fb3c739674865e")
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !822, file: !2, baseType: !682, size: 32, align: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(f32) -> u32", baseType: !826, size: 64, align: 64, dwarfAddressSpace: 0)
!826 = !DISubroutineType(types: !827)
!827 = !{!391, !682}
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !829, file: !2, align: 8, elements: !19, identifier: "5d36ead150316cec42ce8337b8bbbd48")
!829 = !DINamespace(name: "to_bits", scope: !830)
!830 = !DINamespace(name: "{impl#0}", scope: !831)
!831 = !DINamespace(name: "f32", scope: !31)
!832 = !{!833, !834, !835}
!833 = !DILocalVariable(name: "arg", arg: 1, scope: !818, file: !291, line: 2688, type: !822)
!834 = !DILocalVariable(name: "_called_in_const", arg: 2, scope: !818, file: !291, line: 2689, type: !825)
!835 = !DILocalVariable(name: "called_at_rt", arg: 3, scope: !818, file: !291, line: 2690, type: !828)
!836 = !{!837, !838, !839, !840}
!837 = !DITemplateTypeParameter(name: "ARG", type: !822)
!838 = !DITemplateTypeParameter(name: "F", type: !825)
!839 = !DITemplateTypeParameter(name: "G", type: !828)
!840 = !DITemplateTypeParameter(name: "RET", type: !391)
!841 = !DILocation(line: 2688, column: 5, scope: !818)
!842 = !DILocation(line: 2689, column: 5, scope: !818)
!843 = !DILocation(line: 2690, column: 5, scope: !818)
!844 = !DILocation(line: 2696, column: 5, scope: !818)
!845 = !DILocation(line: 2697, column: 1, scope: !818)
!846 = !DILocation(line: 2687, column: 1, scope: !818)
!847 = !DILocation(line: 2697, column: 2, scope: !818)
!848 = distinct !DISubprogram(name: "const_eval_select<(f64), fn(f64) -> u64, core::f64::{impl#0}::to_bits::{closure_env#0}, u64>", linkageName: "_ZN4core10intrinsics17const_eval_select17ha6458f317d7f2ac2E", scope: !819, file: !291, line: 2687, type: !849, scopeLine: 2687, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !865, retainedNodes: !861)
!849 = !DISubroutineType(types: !850)
!850 = !{!82, !851, !854, !857}
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f64)", file: !2, size: 64, align: 64, elements: !852, templateParams: !19, identifier: "22e473b8b7f40d391a5b33657257437a")
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !851, file: !2, baseType: !697, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(f64) -> u64", baseType: !855, size: 64, align: 64, dwarfAddressSpace: 0)
!855 = !DISubroutineType(types: !856)
!856 = !{!82, !697}
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !858, file: !2, align: 8, elements: !19, identifier: "cd36e4a6cd755e48e5a81afd72b773d")
!858 = !DINamespace(name: "to_bits", scope: !859)
!859 = !DINamespace(name: "{impl#0}", scope: !860)
!860 = !DINamespace(name: "f64", scope: !31)
!861 = !{!862, !863, !864}
!862 = !DILocalVariable(name: "arg", arg: 1, scope: !848, file: !291, line: 2688, type: !851)
!863 = !DILocalVariable(name: "_called_in_const", arg: 2, scope: !848, file: !291, line: 2689, type: !854)
!864 = !DILocalVariable(name: "called_at_rt", arg: 3, scope: !848, file: !291, line: 2690, type: !857)
!865 = !{!866, !867, !868, !869}
!866 = !DITemplateTypeParameter(name: "ARG", type: !851)
!867 = !DITemplateTypeParameter(name: "F", type: !854)
!868 = !DITemplateTypeParameter(name: "G", type: !857)
!869 = !DITemplateTypeParameter(name: "RET", type: !82)
!870 = !DILocation(line: 2688, column: 5, scope: !848)
!871 = !DILocation(line: 2689, column: 5, scope: !848)
!872 = !DILocation(line: 2690, column: 5, scope: !848)
!873 = !DILocation(line: 2696, column: 5, scope: !848)
!874 = !DILocation(line: 2697, column: 1, scope: !848)
!875 = !DILocation(line: 2687, column: 1, scope: !848)
!876 = !DILocation(line: 2697, column: 2, scope: !848)
!877 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3Ord3min17hcb69de752336567cE", scope: !878, file: !564, line: 827, type: !565, scopeLine: 827, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !882, retainedNodes: !879)
!878 = !DINamespace(name: "Ord", scope: !38)
!879 = !{!880, !881}
!880 = !DILocalVariable(name: "self", arg: 1, scope: !877, file: !564, line: 827, type: !9)
!881 = !DILocalVariable(name: "other", arg: 2, scope: !877, file: !564, line: 827, type: !9)
!882 = !{!883}
!883 = !DITemplateTypeParameter(name: "Self", type: !9)
!884 = !DILocation(line: 827, column: 12, scope: !877)
!885 = !DILocation(line: 827, column: 18, scope: !877)
!886 = !DILocation(line: 835, column: 15, scope: !877)
!887 = !{i8 -1, i8 2}
!888 = !DILocation(line: 839, column: 5, scope: !877)
!889 = !DILocation(line: 835, column: 9, scope: !877)
!890 = !DILocation(line: 836, column: 49, scope: !877)
!891 = !DILocation(line: 837, column: 34, scope: !877)
!892 = !DILocation(line: 827, column: 5, scope: !877)
!893 = !DILocation(line: 839, column: 6, scope: !877)
!894 = distinct !DISubprogram(name: "cmp", linkageName: "_ZN4core3cmp5impls50_$LT$impl$u20$core..cmp..Ord$u20$for$u20$usize$GT$3cmp17heff2ceaf2d9ed1e3E", scope: !895, file: !564, line: 1436, type: !897, scopeLine: 1436, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !899)
!895 = !DINamespace(name: "{impl#55}", scope: !896)
!896 = !DINamespace(name: "impls", scope: !38)
!897 = !DISubroutineType(types: !898)
!898 = !{!37, !296, !296}
!899 = !{!900, !901}
!900 = !DILocalVariable(name: "self", arg: 1, scope: !894, file: !564, line: 1436, type: !296)
!901 = !DILocalVariable(name: "other", arg: 2, scope: !894, file: !564, line: 1436, type: !296)
!902 = !DILocation(line: 1436, column: 24, scope: !894)
!903 = !DILocation(line: 1436, column: 31, scope: !894)
!904 = !DILocation(line: 1439, column: 24, scope: !894)
!905 = !DILocation(line: 1439, column: 32, scope: !894)
!906 = !DILocation(line: 1440, column: 29, scope: !894)
!907 = !DILocation(line: 1440, column: 38, scope: !894)
!908 = !DILocation(line: 1439, column: 41, scope: !894)
!909 = !DILocation(line: 1439, column: 21, scope: !894)
!910 = !DILocation(line: 1442, column: 18, scope: !894)
!911 = !DILocation(line: 1441, column: 28, scope: !894)
!912 = !DILocation(line: 1440, column: 26, scope: !894)
!913 = !DILocation(line: 1440, column: 47, scope: !894)
!914 = distinct !DISubprogram(name: "eq", linkageName: "_ZN4core3cmp5impls59_$LT$impl$u20$core..cmp..PartialEq$u20$for$u20$$LP$$RP$$GT$2eq17hedefb1bc4fc3afaaE", scope: !915, file: !564, line: 1345, type: !916, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !920)
!915 = !DINamespace(name: "{impl#0}", scope: !896)
!916 = !DISubroutineType(types: !917)
!917 = !{!918, !919, !919}
!918 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!920 = !{!921, !922}
!921 = !DILocalVariable(name: "self", arg: 1, scope: !914, file: !564, line: 1345, type: !919)
!922 = !DILocalVariable(name: "_other", arg: 2, scope: !914, file: !564, line: 1345, type: !919)
!923 = !DILocation(line: 1345, column: 15, scope: !914)
!924 = !DILocation(line: 1345, column: 22, scope: !914)
!925 = !DILocation(line: 1347, column: 10, scope: !914)
!926 = distinct !DISubprogram(name: "to_bits", linkageName: "_ZN4core3f3221_$LT$impl$u20$f32$GT$7to_bits17hf9f914d93b7e51c5E", scope: !830, file: !927, line: 898, type: !826, scopeLine: 898, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !928)
!927 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/f32.rs", directory: "", checksumkind: CSK_MD5, checksum: "ccf44360ac9c21a495b8807c65ce68a7")
!928 = !{!929, !930}
!929 = !DILocalVariable(name: "self", arg: 1, scope: !926, file: !927, line: 898, type: !682)
!930 = !DILocalVariable(name: "rt_f32_to_u32", scope: !931, file: !927, line: 939, type: !828, align: 1)
!931 = distinct !DILexicalBlock(scope: !926, file: !927, line: 939, column: 9)
!932 = !DILocation(line: 898, column: 26, scope: !926)
!933 = !DILocation(line: 939, column: 13, scope: !931)
!934 = !DILocation(line: 941, column: 48, scope: !931)
!935 = !DILocation(line: 941, column: 18, scope: !931)
!936 = !DILocation(line: 942, column: 6, scope: !926)
!937 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN4core3f3221_$LT$impl$u20$f32$GT$7to_bits28_$u7b$$u7b$closure$u7d$$u7d$17h12ec8e0264003088E", scope: !829, file: !927, line: 939, type: !938, scopeLine: 939, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !941)
!938 = !DISubroutineType(types: !939)
!939 = !{!391, !940, !682}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::f32::{impl#0}::to_bits::{closure_env#0}", baseType: !828, size: 64, align: 64, dwarfAddressSpace: 0)
!941 = !{!942, !943}
!942 = !DILocalVariable(name: "rt", arg: 2, scope: !937, file: !927, line: 939, type: !682)
!943 = !DILocalVariable(arg: 1, scope: !937, file: !927, line: 939, type: !940)
!944 = !DILocation(line: 939, column: 29, scope: !937)
!945 = !DILocation(line: 939, column: 30, scope: !937)
!946 = !DILocation(line: 939, column: 43, scope: !937)
!947 = !DILocation(line: 939, column: 33, scope: !937)
!948 = distinct !DISubprogram(name: "to_bits", linkageName: "_ZN4core3f6421_$LT$impl$u20$f64$GT$7to_bits17h62495e472a5a58ecE", scope: !859, file: !949, line: 909, type: !855, scopeLine: 909, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !950)
!949 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/f64.rs", directory: "", checksumkind: CSK_MD5, checksum: "e2b52eb31f8d459cd2ccd4148f4457c9")
!950 = !{!951, !952}
!951 = !DILocalVariable(name: "self", arg: 1, scope: !948, file: !949, line: 909, type: !697)
!952 = !DILocalVariable(name: "rt_f64_to_u64", scope: !953, file: !949, line: 932, type: !857, align: 1)
!953 = distinct !DILexicalBlock(scope: !948, file: !949, line: 932, column: 9)
!954 = !DILocation(line: 909, column: 26, scope: !948)
!955 = !DILocation(line: 932, column: 13, scope: !953)
!956 = !DILocation(line: 934, column: 48, scope: !953)
!957 = !DILocation(line: 934, column: 18, scope: !953)
!958 = !DILocation(line: 935, column: 6, scope: !948)
!959 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN4core3f6421_$LT$impl$u20$f64$GT$7to_bits28_$u7b$$u7b$closure$u7d$$u7d$17hce21388d0321e24aE", scope: !858, file: !949, line: 932, type: !960, scopeLine: 932, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !963)
!960 = !DISubroutineType(types: !961)
!961 = !{!82, !962, !697}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::f64::{impl#0}::to_bits::{closure_env#0}", baseType: !857, size: 64, align: 64, dwarfAddressSpace: 0)
!963 = !{!964, !965}
!964 = !DILocalVariable(name: "rt", arg: 2, scope: !959, file: !949, line: 932, type: !697)
!965 = !DILocalVariable(arg: 1, scope: !959, file: !949, line: 932, type: !962)
!966 = !DILocation(line: 932, column: 29, scope: !959)
!967 = !DILocation(line: 932, column: 30, scope: !959)
!968 = !DILocation(line: 932, column: 43, scope: !959)
!969 = !DILocation(line: 932, column: 33, scope: !959)
!970 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h97872f408723ca1bE", scope: !971, file: !706, line: 390, type: !1040, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !1042)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !30, file: !2, size: 384, align: 64, elements: !972, templateParams: !19, identifier: "7e7034295abae01651800c8eb0e9b712")
!972 = !{!973, !979, !1024}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !971, file: !2, baseType: !974, size: 128, align: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !975, templateParams: !19, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!975 = !{!976, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !974, file: !2, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64, dwarfAddressSpace: 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !974, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !971, file: !2, baseType: !980, size: 128, align: 64, offset: 128)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !64, file: !2, size: 128, align: 64, elements: !981, templateParams: !19, identifier: "bb69cbb99024f47dbb54317ba8130317")
!981 = !{!982}
!982 = !DICompositeType(tag: DW_TAG_variant_part, scope: !980, file: !2, size: 128, align: 64, elements: !983, templateParams: !19, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !1023)
!983 = !{!984, !1019}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !982, file: !2, baseType: !985, size: 128, align: 64, extraData: i64 0)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !980, file: !2, size: 128, align: 64, elements: !19, templateParams: !986, identifier: "742dbe7e160661d8ca36fcfff2574850")
!986 = !{!987}
!987 = !DITemplateTypeParameter(name: "T", type: !988)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !989, templateParams: !19, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!989 = !{!990, !1018}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !988, file: !2, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64, dwarfAddressSpace: 0)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !28, file: !2, size: 448, align: 64, elements: !993, templateParams: !19, identifier: "fbba22b504f631aebebe5f9a731b4661")
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !992, file: !2, baseType: !9, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !992, file: !2, baseType: !996, size: 384, align: 64, offset: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !28, file: !2, size: 384, align: 64, elements: !997, templateParams: !19, identifier: "a89ae7a13a1def66296bab98052f520a")
!997 = !{!998, !999, !1000, !1001, !1017}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !996, file: !2, baseType: !385, size: 32, align: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !996, file: !2, baseType: !27, size: 8, align: 8, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !2, baseType: !391, size: 32, align: 32, offset: 288)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !996, file: !2, baseType: !1002, size: 128, align: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !28, file: !2, size: 128, align: 64, elements: !1003, templateParams: !19, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!1003 = !{!1004}
!1004 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1002, file: !2, size: 128, align: 64, elements: !1005, templateParams: !19, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !1016)
!1005 = !{!1006, !1010, !1014}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !1004, file: !2, baseType: !1007, size: 128, align: 64, extraData: i64 0)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !1002, file: !2, size: 128, align: 64, elements: !1008, templateParams: !19, identifier: "927d86c22d9994b767e51a58b20493")
!1008 = !{!1009}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1007, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !1004, file: !2, baseType: !1011, size: 128, align: 64, extraData: i64 1)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !1002, file: !2, size: 128, align: 64, elements: !1012, templateParams: !19, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1011, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !1004, file: !2, baseType: !1015, size: 128, align: 64, extraData: i64 2)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !1002, file: !2, size: 128, align: 64, elements: !19, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!1016 = !DIDerivedType(tag: DW_TAG_member, scope: !1002, file: !2, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !996, file: !2, baseType: !1002, size: 128, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !988, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !982, file: !2, baseType: !1020, size: 128, align: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !980, file: !2, size: 128, align: 64, elements: !1021, templateParams: !986, identifier: "17f2fc106094349c7673abca4839c97a")
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1020, file: !2, baseType: !988, size: 128, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, scope: !980, file: !2, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !971, file: !2, baseType: !1025, size: 128, align: 64, offset: 256)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !1026, templateParams: !19, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!1026 = !{!1027, !1039}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1025, file: !2, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64, dwarfAddressSpace: 0)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !30, file: !2, size: 128, align: 64, elements: !1030, templateParams: !19, identifier: "753c369e46bf484710f4d769a3fba395")
!1030 = !{!1031, !1035}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1029, file: !2, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !1033, size: 64, align: 64, dwarfAddressSpace: 0)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !1034, file: !2, align: 8, elements: !19, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!1034 = !DINamespace(name: "{extern#0}", scope: !30)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !1029, file: !2, baseType: !1036, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !1037, size: 64, align: 64, dwarfAddressSpace: 0)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!710, !1032, !729}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1025, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!971, !974, !1025}
!1042 = !{!1043, !1044}
!1043 = !DILocalVariable(name: "pieces", arg: 1, scope: !970, file: !706, line: 390, type: !974)
!1044 = !DILocalVariable(name: "args", arg: 2, scope: !970, file: !706, line: 390, type: !1025)
!1045 = !DILocation(line: 390, column: 25, scope: !970)
!1046 = !DILocation(line: 390, column: 53, scope: !970)
!1047 = !DILocation(line: 391, column: 12, scope: !970)
!1048 = !DILocation(line: 391, column: 56, scope: !970)
!1049 = !DILocation(line: 391, column: 41, scope: !970)
!1050 = !DILocation(line: 394, column: 34, scope: !970)
!1051 = !DILocation(line: 394, column: 9, scope: !970)
!1052 = !{i64 8}
!1053 = !DILocation(line: 395, column: 6, scope: !970)
!1054 = !DILocation(line: 392, column: 13, scope: !970)
!1055 = distinct !DISubprogram(name: "checked_mul", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$11checked_mul17h0a8d9e77c5cdaf25E", scope: !1057, file: !1056, line: 555, type: !1058, scopeLine: 555, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, templateParams: !19, retainedNodes: !1073)
!1056 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "510cfe98475d713af9de72a29146058c")
!1057 = !DINamespace(name: "{impl#9}", scope: !46)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !82, !82}
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !64, file: !2, size: 128, align: 64, elements: !1061, templateParams: !19, identifier: "16e153c2fe52db6a1dfc345930bd0217")
!1061 = !{!1062}
!1062 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1060, file: !2, size: 128, align: 64, elements: !1063, templateParams: !19, identifier: "b3956402942b10598bd4a19f6c646804", discriminator: !1072)
!1063 = !{!1064, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !1062, file: !2, baseType: !1065, size: 128, align: 64, extraData: i64 0)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !1060, file: !2, size: 128, align: 64, elements: !19, templateParams: !1066, identifier: "e1b9c0ac5f4b9eb1b4dff91b1fcb2bb3")
!1066 = !{!1067}
!1067 = !DITemplateTypeParameter(name: "T", type: !82)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !1062, file: !2, baseType: !1069, size: 128, align: 64, extraData: i64 1)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !1060, file: !2, size: 128, align: 64, elements: !1070, templateParams: !1066, identifier: "aa0e85c23318717771faa5f022ef9a7a")
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1069, file: !2, baseType: !82, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, scope: !1060, file: !2, baseType: !82, size: 64, align: 64, flags: DIFlagArtificial)
!1073 = !{!1074, !1075, !1076, !1078}
!1074 = !DILocalVariable(name: "self", arg: 1, scope: !1055, file: !1056, line: 555, type: !82)
!1075 = !DILocalVariable(name: "rhs", arg: 2, scope: !1055, file: !1056, line: 555, type: !82)
!1076 = !DILocalVariable(name: "a", scope: !1077, file: !1056, line: 556, type: !82, align: 8)
