; ModuleID = '2i8m55enknq4yj23'
source_filename = "2i8m55enknq4yj23"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"[closure@src/test_no_wrapping_neg.rs:12:1: 17:2]" = type {}
%"[closure@src/test_no_wrapping_neg.rs:20:1: 27:2]" = type {}
%"core::option::Option<core::fmt::Arguments>" = type { {}*, [5 x i64] }
%"core::fmt::Opaque" = type {}
%"core::option::Option<core::fmt::Arguments>::Some" = type { %"core::fmt::Arguments" }
%"test::types::TestDescAndFn" = type { %"test::types::TestDesc", %"test::types::TestFn" }
%"test::types::TestDesc" = type { %"test::types::TestName", { i8*, i64 }, %"test::options::ShouldPanic", i8, i8, i8, i8, [4 x i8] }
%"test::types::TestName" = type { i8, [39 x i8] }
%"test::options::ShouldPanic" = type { i64, [2 x i64] }
%"test::types::TestFn" = type { i64, [2 x i64] }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [6 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "dee041a15dfe076460e1ead4b963607c")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "eb9421142c7534b89a47eb687fc5227b")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&f32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "167dd032769a3561d40fd3e6fbb4e28f")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<&f64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "6b62788b1bf0b7aff81411b24fc1f74")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f64", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !52, templateParams: !23, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!54 = !{i32 7, !"PIC Level", i32 2}
!55 = !{i32 7, !"PIE Level", i32 2}
!56 = !{i32 2, !"RtLibUseGOT", i32 1}
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !60, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !79)
!60 = !DIFile(filename: "src/lib.rs/@/2i8m55enknq4yj23", directory: "/home/calvin/git/c2rust/tests/floats")
!61 = !{!62, !73}
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !63, file: !2, baseType: !67, size: 8, align: 8, flags: DIFlagEnumClass, elements: !68)
!63 = !DINamespace(name: "v1", scope: !64)
!64 = !DINamespace(name: "rt", scope: !65)
!65 = !DINamespace(name: "fmt", scope: !66)
!66 = !DINamespace(name: "core", scope: null)
!67 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !74, file: !2, baseType: !67, size: 8, align: 8, flags: DIFlagEnumClass, elements: !75)
!74 = !DINamespace(name: "panicking", scope: !66)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!79 = !{!0, !24, !34, !44}
!80 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h8910afefbea19e54E", scope: !82, file: !81, line: 118, type: !84, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !90, retainedNodes: !86)
!81 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!82 = !DINamespace(name: "backtrace", scope: !83)
!83 = !DINamespace(name: "sys_common", scope: !17)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !20}
!86 = !{!87, !88}
!87 = !DILocalVariable(name: "f", arg: 1, scope: !80, file: !81, line: 118, type: !20)
!88 = !DILocalVariable(name: "result", scope: !89, file: !81, line: 122, type: !7, align: 1)
!89 = distinct !DILexicalBlock(scope: !80, file: !81, line: 122, column: 5)
!90 = !{!91, !92}
!91 = !DITemplateTypeParameter(name: "F", type: !20)
!92 = !DITemplateTypeParameter(name: "T", type: !7)
!93 = !DILocation(line: 122, column: 9, scope: !89)
!94 = !DILocation(line: 118, column: 43, scope: !80)
!95 = !DILocalVariable(name: "dummy", scope: !96, file: !81, line: 125, type: !7, align: 1)
!96 = !DILexicalBlockFile(scope: !97, file: !81, discriminator: 0)
!97 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h39034b4a393379fdE", scope: !99, file: !98, line: 225, type: !100, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !103, retainedNodes: !102)
!98 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "b50bd4586a98539d3cdc821cfaa5e2e7")
!99 = !DINamespace(name: "hint", scope: !66)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !7}
!102 = !{!95}
!103 = !{!92}
!104 = !DILocation(line: 125, column: 5, scope: !96, inlinedAt: !105)
!105 = !DILocation(line: 125, column: 5, scope: !89)
!106 = !DILocation(line: 122, column: 18, scope: !80)
!107 = !{i32 3343278}
!108 = !DILocation(line: 128, column: 2, scope: !80)
!109 = !DILocation(line: 128, column: 1, scope: !80)
!110 = !DILocation(line: 118, column: 1, scope: !80)
!111 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h40988b67d1ea3c5aE", scope: !16, file: !112, line: 139, type: !113, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !103, retainedNodes: !118)
!112 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !20, !115, !116}
!115 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !{!119, !120, !121, !122}
!119 = !DILocalVariable(name: "main", arg: 1, scope: !111, file: !112, line: 140, type: !20)
!120 = !DILocalVariable(name: "argc", arg: 2, scope: !111, file: !112, line: 141, type: !115)
!121 = !DILocalVariable(name: "argv", arg: 3, scope: !111, file: !112, line: 142, type: !116)
!122 = !DILocalVariable(name: "v", scope: !123, file: !112, line: 144, type: !115, align: 8)
!123 = distinct !DILexicalBlock(scope: !111, file: !112, line: 144, column: 5)
!124 = !DILocation(line: 140, column: 5, scope: !111)
!125 = !DILocation(line: 141, column: 5, scope: !111)
!126 = !DILocation(line: 142, column: 5, scope: !111)
!127 = !DILocation(line: 145, column: 10, scope: !111)
!128 = !DILocation(line: 145, column: 9, scope: !111)
!129 = !DILocation(line: 144, column: 17, scope: !111)
!130 = !DILocation(line: 144, column: 12, scope: !111)
!131 = !DILocation(line: 144, column: 12, scope: !123)
!132 = !DILocation(line: 150, column: 2, scope: !111)
!133 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h3e21f5ef5e45bc4cE", scope: !15, file: !112, line: 145, type: !134, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !103, retainedNodes: !137)
!134 = !DISubroutineType(types: !135)
!135 = !{!53, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !{!138}
!138 = !DILocalVariable(name: "main", scope: !133, file: !112, line: 140, type: !20, align: 8)
!139 = !{i64 8}
!140 = !DILocation(line: 140, column: 5, scope: !133)
!141 = !DILocalVariable(name: "self", scope: !142, file: !112, line: 145, type: !145, align: 1)
!142 = !DILexicalBlockFile(scope: !143, file: !112, discriminator: 0)
!143 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h50c070af5684c664E", scope: !145, file: !144, line: 1808, type: !156, scopeLine: 1808, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !23, retainedNodes: !158)
!144 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "78747cd94138b7f073ffd16b64787cb4")
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !146, file: !2, size: 8, align: 8, elements: !147, templateParams: !23, identifier: "65270507d071436c1dbdf6fde69e5261")
!146 = !DINamespace(name: "process", scope: !17)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !145, file: !2, baseType: !149, size: 8, align: 8)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !150, file: !2, size: 8, align: 8, elements: !154, templateParams: !23, identifier: "faca173619846f0e95e842844eb5af74")
!150 = !DINamespace(name: "process_common", scope: !151)
!151 = !DINamespace(name: "process", scope: !152)
!152 = !DINamespace(name: "unix", scope: !153)
!153 = !DINamespace(name: "sys", scope: !17)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !149, file: !2, baseType: !67, size: 8, align: 8)
!156 = !DISubroutineType(types: !157)
!157 = !{!53, !145}
!158 = !{!141}
!159 = !DILocation(line: 145, column: 18, scope: !142, inlinedAt: !160)
!160 = !DILocation(line: 145, column: 18, scope: !133)
!161 = !DILocation(line: 145, column: 77, scope: !133)
!162 = !DILocalVariable(name: "self", scope: !163, file: !112, line: 145, type: !168, align: 8)
!163 = !DILexicalBlockFile(scope: !164, file: !112, discriminator: 0)
!164 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217ha8959f29e205438aE", scope: !149, file: !165, line: 485, type: !166, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !23, retainedNodes: !169)
!165 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0172c472c69d772c784713c132680582")
!166 = !DISubroutineType(types: !167)
!167 = !{!53, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!169 = !{!162}
!170 = !DILocation(line: 145, column: 18, scope: !163, inlinedAt: !171)
!171 = !DILocation(line: 1809, column: 9, scope: !143, inlinedAt: !160)
!172 = !DILocation(line: 145, column: 17, scope: !133)
!173 = distinct !DISubprogram(name: "fmt<f32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h46df99dd7e367cc8E", scope: !175, file: !174, line: 2361, type: !176, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !235, retainedNodes: !232)
!174 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "18dcc19de419985ae78d2bd8ed07e5dc")
!175 = !DINamespace(name: "{impl#59}", scope: !65)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !195, !196}
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !179, file: !2, size: 8, align: 8, elements: !180, templateParams: !23, identifier: "d239d58a8e95223cd52e3ad2c36d40d7")
!179 = !DINamespace(name: "result", scope: !66)
!180 = !{!181}
!181 = !DICompositeType(tag: DW_TAG_variant_part, scope: !178, file: !2, size: 8, align: 8, elements: !182, templateParams: !23, identifier: "1fa2591b965a13cd50e38802b1727ca", discriminator: !194)
!182 = !{!183, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !181, file: !2, baseType: !184, size: 8, align: 8, extraData: i64 0)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !178, file: !2, size: 8, align: 8, elements: !185, templateParams: !187, identifier: "cea751326735c343faf647063a65ad14")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !184, file: !2, baseType: !7, align: 8, offset: 8)
!187 = !{!92, !188}
!188 = !DITemplateTypeParameter(name: "E", type: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !65, file: !2, align: 8, elements: !23, identifier: "87e319c059f1d372f32b0a49f33ec3cc")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !181, file: !2, baseType: !191, size: 8, align: 8, extraData: i64 1)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !178, file: !2, size: 8, align: 8, elements: !192, templateParams: !187, identifier: "6c6eb84ed910506586b60ba90dbaa2c")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !2, baseType: !189, align: 8, offset: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !178, file: !2, baseType: !67, size: 8, align: 8, flags: DIFlagArtificial)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !65, file: !2, size: 512, align: 64, elements: !198, templateParams: !23, identifier: "6e9ffaec9b89ebb810272bb66e7b2042")
!198 = !{!199, !201, !203, !204, !220, !221}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !2, baseType: !200, size: 32, align: 32, offset: 384)
!200 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !197, file: !2, baseType: !202, size: 32, align: 32, offset: 416)
!202 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !197, file: !2, baseType: !62, size: 8, align: 8, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !197, file: !2, baseType: !205, size: 128, align: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !206, file: !2, size: 128, align: 64, elements: !207, templateParams: !23, identifier: "5190463b0687da274ab794ccaf9d1fd8")
!206 = !DINamespace(name: "option", scope: !66)
!207 = !{!208}
!208 = !DICompositeType(tag: DW_TAG_variant_part, scope: !205, file: !2, size: 128, align: 64, elements: !209, templateParams: !23, identifier: "db59d501e5f76645f4edce4cdbfeb328", discriminator: !218)
!209 = !{!210, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !208, file: !2, baseType: !211, size: 128, align: 64, extraData: i64 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !205, file: !2, size: 128, align: 64, elements: !23, templateParams: !212, identifier: "a1c5f3dead8f24ccdada7bc2feedd145")
!212 = !{!213}
!213 = !DITemplateTypeParameter(name: "T", type: !9)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !208, file: !2, baseType: !215, size: 128, align: 64, extraData: i64 1)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !205, file: !2, size: 128, align: 64, elements: !216, templateParams: !212, identifier: "3ad875242c049b8143d7577f4eb10d1a")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !2, baseType: !219, size: 64, align: 64, flags: DIFlagArtificial)
!219 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !197, file: !2, baseType: !205, size: 128, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !197, file: !2, baseType: !222, size: 128, align: 64, offset: 256)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !223, templateParams: !23, identifier: "3d4f80cd5361aaff4f795dd09efb8db1")
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !222, file: !2, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "abb712b259efc5e79bb67900edf24920")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !222, file: !2, baseType: !228, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !229, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 3, lowerBound: 0)
!232 = !{!233, !234}
!233 = !DILocalVariable(name: "self", arg: 1, scope: !173, file: !174, line: 2361, type: !195)
!234 = !DILocalVariable(name: "f", arg: 2, scope: !173, file: !174, line: 2361, type: !196)
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !33)
!237 = !DILocation(line: 2361, column: 20, scope: !173)
!238 = !DILocation(line: 2361, column: 27, scope: !173)
!239 = !DILocation(line: 2361, column: 71, scope: !173)
!240 = !{i64 4}
!241 = !DILocation(line: 2361, column: 62, scope: !173)
!242 = !DILocation(line: 2361, column: 84, scope: !173)
!243 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hb809e280384f7770E", scope: !175, file: !174, line: 2361, type: !244, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !250, retainedNodes: !247)
!244 = !DISubroutineType(types: !245)
!245 = !{!178, !246, !196}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!247 = !{!248, !249}
!248 = !DILocalVariable(name: "self", arg: 1, scope: !243, file: !174, line: 2361, type: !246)
!249 = !DILocalVariable(name: "f", arg: 2, scope: !243, file: !174, line: 2361, type: !196)
!250 = !{!251}
!251 = !DITemplateTypeParameter(name: "T", type: !53)
!252 = !DILocation(line: 2361, column: 20, scope: !243)
!253 = !DILocation(line: 2361, column: 27, scope: !243)
!254 = !DILocation(line: 2361, column: 71, scope: !243)
!255 = !DILocation(line: 2361, column: 62, scope: !243)
!256 = !DILocation(line: 2361, column: 84, scope: !243)
!257 = distinct !DISubprogram(name: "fmt<f64>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17he15a7eb420ca342fE", scope: !175, file: !174, line: 2361, type: !258, scopeLine: 2361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !264, retainedNodes: !261)
!258 = !DISubroutineType(types: !259)
!259 = !{!178, !260, !196}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&f64", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!261 = !{!262, !263}
!262 = !DILocalVariable(name: "self", arg: 1, scope: !257, file: !174, line: 2361, type: !260)
!263 = !DILocalVariable(name: "f", arg: 2, scope: !257, file: !174, line: 2361, type: !196)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !43)
!266 = !DILocation(line: 2361, column: 20, scope: !257)
!267 = !DILocation(line: 2361, column: 27, scope: !257)
!268 = !DILocation(line: 2361, column: 71, scope: !257)
!269 = !DILocation(line: 2361, column: 62, scope: !257)
!270 = !DILocation(line: 2361, column: 84, scope: !257)
!271 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17h70512b6ea5df9da3E", scope: !273, file: !272, line: 185, type: !275, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !23, retainedNodes: !277)
!272 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "6661e46781fcd4293e0f5caf32f3d8ca")
!273 = !DINamespace(name: "{impl#80}", scope: !274)
!274 = !DINamespace(name: "num", scope: !65)
!275 = !DISubroutineType(types: !276)
!276 = !{!178, !52, !196}
!277 = !{!278, !279}
!278 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !272, line: 185, type: !52)
!279 = !DILocalVariable(name: "f", arg: 2, scope: !271, file: !272, line: 185, type: !196)
!280 = !DILocation(line: 185, column: 20, scope: !271)
!281 = !DILocation(line: 185, column: 27, scope: !271)
!282 = !DILocation(line: 186, column: 20, scope: !271)
!283 = !DILocation(line: 188, column: 27, scope: !271)
!284 = !DILocation(line: 187, column: 21, scope: !271)
!285 = !DILocation(line: 186, column: 17, scope: !271)
!286 = !DILocation(line: 193, column: 14, scope: !271)
!287 = !{i8 0, i8 2}
!288 = !DILocation(line: 191, column: 21, scope: !271)
!289 = !DILocation(line: 189, column: 21, scope: !271)
!290 = !DILocation(line: 188, column: 24, scope: !271)
!291 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h8c796b1ff7ca8125E", scope: !292, file: !174, line: 390, type: !366, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !23, retainedNodes: !368)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !65, file: !2, size: 384, align: 64, elements: !293, templateParams: !23, identifier: "7e7034295abae01651800c8eb0e9b712")
!293 = !{!294, !305, !350}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !292, file: !2, baseType: !295, size: 128, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !296, templateParams: !23, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!296 = !{!297, !304}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !295, file: !2, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64, dwarfAddressSpace: 0)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !300, templateParams: !23, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!300 = !{!301, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !299, file: !2, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !299, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !295, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !292, file: !2, baseType: !306, size: 128, align: 64, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !206, file: !2, size: 128, align: 64, elements: !307, templateParams: !23, identifier: "bb69cbb99024f47dbb54317ba8130317")
!307 = !{!308}
!308 = !DICompositeType(tag: DW_TAG_variant_part, scope: !306, file: !2, size: 128, align: 64, elements: !309, templateParams: !23, identifier: "ce02297fe7dbf35f547cc88f131a39b4", discriminator: !349)
!309 = !{!310, !345}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !308, file: !2, baseType: !311, size: 128, align: 64, extraData: i64 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !306, file: !2, size: 128, align: 64, elements: !23, templateParams: !312, identifier: "742dbe7e160661d8ca36fcfff2574850")
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "T", type: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !315, templateParams: !23, identifier: "5ac19a4b2fedc0a38075c82d3d698a2e")
!315 = !{!316, !344}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !314, file: !2, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !63, file: !2, size: 448, align: 64, elements: !319, templateParams: !23, identifier: "fbba22b504f631aebebe5f9a731b4661")
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !318, file: !2, baseType: !9, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !318, file: !2, baseType: !322, size: 384, align: 64, offset: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !63, file: !2, size: 384, align: 64, elements: !323, templateParams: !23, identifier: "a89ae7a13a1def66296bab98052f520a")
!323 = !{!324, !325, !326, !327, !343}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !322, file: !2, baseType: !202, size: 32, align: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !322, file: !2, baseType: !62, size: 8, align: 8, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !322, file: !2, baseType: !200, size: 32, align: 32, offset: 288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !322, file: !2, baseType: !328, size: 128, align: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !63, file: !2, size: 128, align: 64, elements: !329, templateParams: !23, identifier: "41c6e2a1db95b605a371a090678c1fd8")
!329 = !{!330}
!330 = !DICompositeType(tag: DW_TAG_variant_part, scope: !328, file: !2, size: 128, align: 64, elements: !331, templateParams: !23, identifier: "eff7cdccebc4ba23639a28669cbce86", discriminator: !342)
!331 = !{!332, !336, !340}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !330, file: !2, baseType: !333, size: 128, align: 64, extraData: i64 0)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !328, file: !2, size: 128, align: 64, elements: !334, templateParams: !23, identifier: "927d86c22d9994b767e51a58b20493")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !330, file: !2, baseType: !337, size: 128, align: 64, extraData: i64 1)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !328, file: !2, size: 128, align: 64, elements: !338, templateParams: !23, identifier: "ce4b8bb3a4200a86c4c06a7570d8ee71")
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !337, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !330, file: !2, baseType: !341, size: 128, align: 64, extraData: i64 2)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !328, file: !2, size: 128, align: 64, elements: !23, identifier: "b155566b9bd0239ef48aa3b8bcdef75b")
!342 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !2, baseType: !219, size: 64, align: 64, flags: DIFlagArtificial)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !322, file: !2, baseType: !328, size: 128, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !314, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !308, file: !2, baseType: !346, size: 128, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !306, file: !2, size: 128, align: 64, elements: !347, templateParams: !312, identifier: "17f2fc106094349c7673abca4839c97a")
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !346, file: !2, baseType: !314, size: 128, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !306, file: !2, baseType: !219, size: 64, align: 64, flags: DIFlagArtificial)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !292, file: !2, baseType: !351, size: 128, align: 64, offset: 256)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !352, templateParams: !23, identifier: "c78588d5439c4eaa18fbaab99f079cbf")
!352 = !{!353, !365}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !351, file: !2, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !65, file: !2, size: 128, align: 64, elements: !356, templateParams: !23, identifier: "753c369e46bf484710f4d769a3fba395")
!356 = !{!357, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !355, file: !2, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !359, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !360, file: !2, align: 8, elements: !23, identifier: "83e8d27b51d2e55ae9422e57e00c6cd7")
!360 = !DINamespace(name: "{extern#0}", scope: !65)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !355, file: !2, baseType: !362, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !363, size: 64, align: 64, dwarfAddressSpace: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{!178, !358, !196}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !351, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!292, !295, !351}
!368 = !{!369, !370}
!369 = !DILocalVariable(name: "pieces", arg: 1, scope: !291, file: !174, line: 390, type: !295)
!370 = !DILocalVariable(name: "args", arg: 2, scope: !291, file: !174, line: 390, type: !351)
!371 = !DILocation(line: 390, column: 25, scope: !291)
!372 = !DILocation(line: 390, column: 53, scope: !291)
!373 = !DILocation(line: 391, column: 12, scope: !291)
!374 = !DILocation(line: 391, column: 56, scope: !291)
!375 = !DILocation(line: 391, column: 41, scope: !291)
!376 = !DILocation(line: 394, column: 34, scope: !291)
!377 = !DILocation(line: 394, column: 9, scope: !291)
!378 = !DILocation(line: 395, column: 6, scope: !291)
!379 = !DILocation(line: 392, column: 13, scope: !291)
!380 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h0e8715799b06d8f6E", scope: !382, file: !381, line: 248, type: !385, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !391, retainedNodes: !388)
!381 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "3100065230267ed2a3b8753c70d752a6")
!382 = !DINamespace(name: "FnOnce", scope: !383)
!383 = !DINamespace(name: "function", scope: !384)
!384 = !DINamespace(name: "ops", scope: !66)
!385 = !DISubroutineType(types: !386)
!386 = !{!53, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !{!389, !390}
!389 = !DILocalVariable(arg: 1, scope: !380, file: !381, line: 248, type: !387)
!390 = !DILocalVariable(arg: 2, scope: !380, file: !381, line: 248, type: !7)
!391 = !{!392, !393}
!392 = !DITemplateTypeParameter(name: "Self", type: !14)
!393 = !DITemplateTypeParameter(name: "Args", type: !7)
!394 = !DILocation(line: 248, column: 5, scope: !380)
!395 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h05fb0aad6f22b397E", scope: !382, file: !381, line: 248, type: !396, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !391, retainedNodes: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!53, !14}
!398 = !{!399, !400}
!399 = !DILocalVariable(arg: 1, scope: !395, file: !381, line: 248, type: !14)
!400 = !DILocalVariable(arg: 2, scope: !395, file: !381, line: 248, type: !7)
!401 = !DILocation(line: 248, column: 5, scope: !395)
!402 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h3e2d053bd5da8275E", scope: !382, file: !381, line: 248, type: !84, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !406, retainedNodes: !403)
!403 = !{!404, !405}
!404 = !DILocalVariable(arg: 1, scope: !402, file: !381, line: 248, type: !20)
!405 = !DILocalVariable(arg: 2, scope: !402, file: !381, line: 248, type: !7)
!406 = !{!407, !393}
!407 = !DITemplateTypeParameter(name: "Self", type: !20)
!408 = !DILocation(line: 248, column: 5, scope: !402)
!409 = distinct !DISubprogram(name: "call_once<float_tests::test_no_wrapping_neg::test_buffer::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h59ec3242dbbb9c91E", scope: !382, file: !381, line: 248, type: !410, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !419, retainedNodes: !416)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !413, file: !2, align: 8, elements: !23, identifier: "5f47e68734f9cf71b897b0f52744273")
!413 = !DINamespace(name: "test_buffer", scope: !414)
!414 = !DINamespace(name: "test_no_wrapping_neg", scope: !415)
!415 = !DINamespace(name: "float_tests", scope: null)
!416 = !{!417, !418}
!417 = !DILocalVariable(arg: 1, scope: !409, file: !381, line: 248, type: !412)
!418 = !DILocalVariable(arg: 2, scope: !409, file: !381, line: 248, type: !7)
!419 = !{!420, !393}
!420 = !DITemplateTypeParameter(name: "Self", type: !412)
!421 = !DILocation(line: 248, column: 5, scope: !409)
!422 = distinct !DISubprogram(name: "call_once<float_tests::test_no_wrapping_neg::test_inc_dec_op::{closure_env#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hd0bc83f50e170107E", scope: !382, file: !381, line: 248, type: !423, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !430, retainedNodes: !427)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !426, file: !2, align: 8, elements: !23, identifier: "806b98ed6d357a0fe39f90e45d3d9d02")
!426 = !DINamespace(name: "test_inc_dec_op", scope: !414)
!427 = !{!428, !429}
!428 = !DILocalVariable(arg: 1, scope: !422, file: !381, line: 248, type: !425)
!429 = !DILocalVariable(arg: 2, scope: !422, file: !381, line: 248, type: !7)
!430 = !{!431, !393}
!431 = !DITemplateTypeParameter(name: "Self", type: !425)
!432 = !DILocation(line: 248, column: 5, scope: !422)
!433 = distinct !DISubprogram(name: "drop_in_place<&f32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f32$GT$17hbab01de34ee61b55E", scope: !435, file: !434, line: 487, type: !436, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !441, retainedNodes: !439)
!434 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "13c32d970b0b4dd38131a1908223a155")
!435 = !DINamespace(name: "ptr", scope: !66)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f32", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!439 = !{!440}
!440 = !DILocalVariable(arg: 1, scope: !433, file: !434, line: 487, type: !438)
!441 = !{!442}
!442 = !DITemplateTypeParameter(name: "T", type: !32)
!443 = !DILocation(line: 487, column: 1, scope: !433)
!444 = distinct !DISubprogram(name: "drop_in_place<&f64>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$f64$GT$17h1033ef9e4a6ad0eeE", scope: !435, file: !434, line: 487, type: !445, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !450, retainedNodes: !448)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &f64", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !{!449}
!449 = !DILocalVariable(arg: 1, scope: !444, file: !434, line: 487, type: !447)
!450 = !{!451}
!451 = !DITemplateTypeParameter(name: "T", type: !42)
!452 = !DILocation(line: 487, column: 1, scope: !444)
!453 = distinct !DISubprogram(name: "drop_in_place<&i32>", linkageName: "_ZN4core3ptr28drop_in_place$LT$$RF$i32$GT$17h9b66b01483193065E", scope: !435, file: !434, line: 487, type: !454, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !459, retainedNodes: !457)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut &i32", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!457 = !{!458}
!458 = !DILocalVariable(arg: 1, scope: !453, file: !434, line: 487, type: !456)
!459 = !{!460}
!460 = !DITemplateTypeParameter(name: "T", type: !52)
!461 = !DILocation(line: 487, column: 1, scope: !453)
!462 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17hc188aef68e8f1aeaE", scope: !435, file: !434, line: 487, type: !463, scopeLine: 487, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !467, retainedNodes: !465)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !387}
!465 = !{!466}
!466 = !DILocalVariable(arg: 1, scope: !462, file: !434, line: 487, type: !387)
!467 = !{!468}
!468 = !DITemplateTypeParameter(name: "T", type: !14)
!469 = !DILocation(line: 487, column: 1, scope: !462)
!470 = distinct !DISubprogram(name: "assert_failed<f32, f32>", linkageName: "_ZN4core9panicking13assert_failed17h2baef5482492ead4E", scope: !74, file: !471, line: 171, type: !472, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !500, retainedNodes: !495)
!471 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "89dbfc153a7177bd0202715dd5809289")
!472 = !DISubroutineType(types: !473)
!473 = !{null, !73, !32, !32, !474, !487}
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Arguments>", scope: !206, file: !2, size: 384, align: 64, elements: !475, templateParams: !23, identifier: "91782c25c0cb4075178b67ca76527846")
!475 = !{!476}
!476 = !DICompositeType(tag: DW_TAG_variant_part, scope: !474, file: !2, size: 384, align: 64, elements: !477, templateParams: !23, identifier: "d3d8c93b36d851336035bb39c7913979", discriminator: !486)
!477 = !{!478, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !476, file: !2, baseType: !479, size: 384, align: 64, extraData: i64 0)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !474, file: !2, size: 384, align: 64, elements: !23, templateParams: !480, identifier: "94094742b636673213b46bf0a5389cae")
!480 = !{!481}
!481 = !DITemplateTypeParameter(name: "T", type: !292)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !476, file: !2, baseType: !483, size: 384, align: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !474, file: !2, size: 384, align: 64, elements: !484, templateParams: !480, identifier: "424137f74f76139e10918065dfb817dc")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !483, file: !2, baseType: !292, size: 384, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, scope: !474, file: !2, baseType: !219, size: 64, align: 64, flags: DIFlagArtificial)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !488, size: 64, align: 64, dwarfAddressSpace: 0)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !489, file: !2, size: 192, align: 64, elements: !491, templateParams: !23, identifier: "ef576a844c237f54e9e75bf7bba044c0")
!489 = !DINamespace(name: "location", scope: !490)
!490 = !DINamespace(name: "panic", scope: !66)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !488, file: !2, baseType: !299, size: 128, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !488, file: !2, baseType: !200, size: 32, align: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !488, file: !2, baseType: !200, size: 32, align: 32, offset: 160)
!495 = !{!496, !497, !498, !499}
!496 = !DILocalVariable(name: "kind", arg: 1, scope: !470, file: !471, line: 172, type: !73)
!497 = !DILocalVariable(name: "left", arg: 2, scope: !470, file: !471, line: 173, type: !32)
!498 = !DILocalVariable(name: "right", arg: 3, scope: !470, file: !471, line: 174, type: !32)
!499 = !DILocalVariable(name: "args", arg: 4, scope: !470, file: !471, line: 175, type: !474)
!500 = !{!236, !501}
!501 = !DITemplateTypeParameter(name: "U", type: !33)
!502 = !DILocation(line: 172, column: 5, scope: !470)
!503 = !DILocation(line: 173, column: 5, scope: !470)
!504 = !DILocation(line: 174, column: 5, scope: !470)
!505 = !DILocation(line: 175, column: 5, scope: !470)
!506 = !DILocation(line: 181, column: 31, scope: !470)
!507 = !DILocation(line: 181, column: 38, scope: !470)
!508 = !DILocation(line: 181, column: 46, scope: !470)
!509 = !DILocation(line: 181, column: 5, scope: !470)
!510 = distinct !DISubprogram(name: "assert_failed<f64, f64>", linkageName: "_ZN4core9panicking13assert_failed17h7f9992d64090582dE", scope: !74, file: !471, line: 171, type: !511, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !518, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !73, !42, !42, !474, !487}
!513 = !{!514, !515, !516, !517}
!514 = !DILocalVariable(name: "kind", arg: 1, scope: !510, file: !471, line: 172, type: !73)
!515 = !DILocalVariable(name: "left", arg: 2, scope: !510, file: !471, line: 173, type: !42)
!516 = !DILocalVariable(name: "right", arg: 3, scope: !510, file: !471, line: 174, type: !42)
!517 = !DILocalVariable(name: "args", arg: 4, scope: !510, file: !471, line: 175, type: !474)
!518 = !{!265, !519}
!519 = !DITemplateTypeParameter(name: "U", type: !43)
!520 = !DILocation(line: 172, column: 5, scope: !510)
!521 = !DILocation(line: 173, column: 5, scope: !510)
!522 = !DILocation(line: 174, column: 5, scope: !510)
!523 = !DILocation(line: 175, column: 5, scope: !510)
!524 = !DILocation(line: 181, column: 31, scope: !510)
!525 = !DILocation(line: 181, column: 38, scope: !510)
!526 = !DILocation(line: 181, column: 46, scope: !510)
!527 = !DILocation(line: 181, column: 5, scope: !510)
!528 = distinct !DISubprogram(name: "assert_failed<i32, i32>", linkageName: "_ZN4core9panicking13assert_failed17hfaca0687c50c208aE", scope: !74, file: !471, line: 171, type: !529, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, templateParams: !536, retainedNodes: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !73, !52, !52, !474, !487}
!531 = !{!532, !533, !534, !535}
!532 = !DILocalVariable(name: "kind", arg: 1, scope: !528, file: !471, line: 172, type: !73)
!533 = !DILocalVariable(name: "left", arg: 2, scope: !528, file: !471, line: 173, type: !52)
!534 = !DILocalVariable(name: "right", arg: 3, scope: !528, file: !471, line: 174, type: !52)
!535 = !DILocalVariable(name: "args", arg: 4, scope: !528, file: !471, line: 175, type: !474)
!536 = !{!251, !537}
!537 = !DITemplateTypeParameter(name: "U", type: !53)
!538 = !DILocation(line: 172, column: 5, scope: !528)
!539 = !DILocation(line: 173, column: 5, scope: !528)
!540 = !DILocation(line: 174, column: 5, scope: !528)
!541 = !DILocation(line: 175, column: 5, scope: !528)
!542 = !DILocation(line: 181, column: 31, scope: !528)
!543 = !DILocation(line: 181, column: 38, scope: !528)
!544 = !DILocation(line: 181, column: 46, scope: !528)
!545 = !DILocation(line: 181, column: 5, scope: !528)
