; ModuleID = 'zf7m485wsz09ju'
source_filename = "zf7m485wsz09ju"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"[closure@<core::ops::range::Range<usize> as core::slice::index::SliceIndex<[u8]>>::get_unchecked::{closure#0}]" = type { i64*, i64*, { [0 x i8]*, i64 }* }
%"[closure@<core::ops::range::Range<usize> as core::slice::index::SliceIndex<[u8]>>::get_unchecked_mut::{closure#0}]" = type { i64*, i64*, { [0 x i8]*, i64 }* }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"alloc::vec::Vec<&str>" = type { { i64*, i64 }, i64 }
%"core::str::iter::Lines" = type { %"core::iter::adapters::map::Map<core::str::iter::SplitTerminator<char>, core::str::LinesAnyMap>" }
%"core::iter::adapters::map::Map<core::str::iter::SplitTerminator<char>, core::str::LinesAnyMap>" = type { %"core::str::LinesAnyMap", %"core::str::iter::SplitTerminator<char>" }
%"core::str::LinesAnyMap" = type {}
%"core::str::iter::SplitTerminator<char>" = type { %"core::str::iter::SplitInternal<char>" }
%"core::str::iter::SplitInternal<char>" = type { i64, i64, %"core::str::pattern::CharSearcher", i8, i8, [6 x i8] }
%"core::str::pattern::CharSearcher" = type { { [0 x i8]*, i64 }, i64, i64, i64, i32, [4 x i8] }
%"alloc::alloc::Global" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !28, identifier: "39b12d778bd52a7ad80ffd39082eabff")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, elements: !19, templateParams: !161, identifier: "1a6cdcdd4c943ddeb72924b6cc984e2a")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !29}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, elements: !26, templateParams: !28, identifier: "643f4ead39f5538e308a9115d26120b8")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "sys", scope: !18)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8)
!28 = !{}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !31, file: !2, size: 64, align: 64, elements: !33, templateParams: !28, identifier: "c7eb0b1781b547f7e08c561bec01ff32")
!31 = !DINamespace(name: "result", scope: !32)
!32 = !DINamespace(name: "core", scope: null)
!33 = !{!34}
!34 = !DICompositeType(tag: DW_TAG_variant_part, scope: !30, file: !2, size: 64, align: 64, elements: !35, templateParams: !28, identifier: "1f891dc836e2f2e1e0bef4f104fa5614", discriminator: !159)
!35 = !{!36, !155}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !34, file: !2, baseType: !37, size: 64, align: 64, extraData: i64 0)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !30, file: !2, size: 64, align: 64, elements: !38, templateParams: !40, identifier: "a4f638f11f3ea760de81f708fc6e1fd")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !7, align: 8)
!40 = !{!41, !42}
!41 = !DITemplateTypeParameter(name: "T", type: !7)
!42 = !DITemplateTypeParameter(name: "E", type: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !44, file: !2, size: 64, align: 64, elements: !45, templateParams: !28, identifier: "35ef22def08c837ae3878504674e366b")
!44 = !DINamespace(name: "error", scope: !17)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !43, file: !2, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !48, file: !2, size: 64, align: 64, elements: !49, templateParams: !28, identifier: "6570f3d28135329fbed4cb7a1951e32d")
!48 = !DINamespace(name: "repr_bitpacked", scope: !44)
!49 = !{!50, !57}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !47, file: !2, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !52, file: !2, size: 64, align: 64, elements: !54, templateParams: !56, identifier: "b858013ea474e1eef5ccba3870fe353d")
!52 = !DINamespace(name: "non_null", scope: !53)
!53 = !DINamespace(name: "ptr", scope: !32)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !51, file: !2, baseType: !6, size: 64, align: 64)
!56 = !{!41}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !47, file: !2, baseType: !58, align: 8)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !60, identifier: "1d073321bd67e7be57d2b831b78eb78b")
!59 = !DINamespace(name: "marker", scope: !32)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "T", type: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !44, file: !2, size: 128, align: 64, elements: !63, templateParams: !28, identifier: "64bf9ab43a422ff7882cc64d405e6db4")
!63 = !{!64}
!64 = !DICompositeType(tag: DW_TAG_variant_part, scope: !62, file: !2, size: 128, align: 64, elements: !65, templateParams: !28, identifier: "32d46417816a4970232155829bec3de0", discriminator: !154)
!65 = !{!66, !132, !136, !150}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !64, file: !2, baseType: !67, size: 128, align: 64, extraData: i64 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !62, file: !2, size: 128, align: 64, elements: !68, templateParams: !71, identifier: "51312ccd08399ffb43fb895d8a6353de")
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !67, file: !2, baseType: !70, size: 32, align: 32, offset: 32)
!70 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "C", type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !44, file: !2, size: 192, align: 64, elements: !75, templateParams: !28, identifier: "387ae58cacb5ae1d4fddf7f57315f38d")
!75 = !{!76, !121}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !74, file: !2, baseType: !77, size: 8, align: 8, offset: 128)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !44, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !79)
!78 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!80 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!98 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!99 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!100 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!102 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!103 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!104 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!105 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!106 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!107 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!108 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!109 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!110 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!111 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!112 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!113 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!114 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!115 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!116 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!117 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!118 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!119 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!120 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !74, file: !2, baseType: !122, size: 128, align: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !123, templateParams: !28, identifier: "49e1ff5efd573d092283dcd4348771ac")
!123 = !{!124, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !122, file: !2, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !28, identifier: "d998709730b54ebefffe35f2808c071f")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !122, file: !2, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 3, lowerBound: 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !64, file: !2, baseType: !133, size: 128, align: 64, extraData: i64 1)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !62, file: !2, size: 128, align: 64, elements: !134, templateParams: !71, identifier: "d6fdaf6afb7f06ba830e20c3b7cdf96a")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !2, baseType: !77, size: 8, align: 8, offset: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !64, file: !2, baseType: !137, size: 128, align: 64, extraData: i64 2)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !62, file: !2, size: 128, align: 64, elements: !138, templateParams: !71, identifier: "6cf4fba8ceca59eba147622df4399a69")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !2, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !44, file: !2, size: 192, align: 64, elements: !142, templateParams: !28, identifier: "7efc891383873a5dce28ace1bc51c9d2")
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !141, file: !2, baseType: !77, size: 8, align: 8, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !141, file: !2, baseType: !145, size: 128, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !146, templateParams: !28, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !145, file: !2, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !145, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !64, file: !2, baseType: !151, size: 128, align: 64, extraData: i64 3)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !62, file: !2, size: 128, align: 64, elements: !152, templateParams: !71, identifier: "591e506d10606579798142c7aef919f4")
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !151, file: !2, baseType: !73, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !62, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagArtificial)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !34, file: !2, baseType: !156, size: 64, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !30, file: !2, size: 64, align: 64, elements: !157, templateParams: !40, identifier: "9e5d2ed67b9bb407b415e43834c79d35")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !156, file: !2, baseType: !43, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !30, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!160 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!161 = !{!162}
!162 = !DITemplateTypeParameter(name: "T", type: !22)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !166, vtableHolder: !173, templateParams: !28, identifier: "dee041a15dfe076460e1ead4b963607c")
!166 = !{!167, !168, !169, !170, !171, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !165, file: !2, baseType: !6, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !165, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !165, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !165, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !165, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !165, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !174, file: !2, size: 64, align: 64, elements: !176, templateParams: !28, identifier: "eb9421142c7534b89a47eb687fc5227b")
!174 = !DINamespace(name: "lang_start", scope: !175)
!175 = !DINamespace(name: "rt", scope: !18)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !173, file: !2, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DISubroutineType(types: !180)
!180 = !{null}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#1}<statics_tests::test_thread_locals::test_thread_locals::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable}", scope: null, file: !2, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#1}<statics_tests::test_thread_locals::test_thread_locals::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !184, vtableHolder: !189, templateParams: !28, identifier: "343a19c11e7fdc8b10aa9825675bddac")
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !183, file: !2, baseType: !6, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !183, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !183, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}<statics_tests::test_thread_locals::test_thread_locals::{closure_env#0}, ()>", scope: !190, file: !2, size: 192, align: 64, elements: !193, templateParams: !28, identifier: "96036c88ee11aaa5f762dd7f032544d7")
!190 = !DINamespace(name: "spawn_unchecked_", scope: !191)
!191 = !DINamespace(name: "{impl#0}", scope: !192)
!192 = !DINamespace(name: "thread", scope: !18)
!193 = !{!194, !286, !376, !381}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "their_thread", scope: !189, file: !2, baseType: !195, size: 64, align: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !192, file: !2, size: 64, align: 64, elements: !196, templateParams: !28, identifier: "181d11db8a84642a3d9f2fdd068530a3")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !195, file: !2, baseType: !198, size: 64, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::Inner>>", scope: !199, file: !2, size: 64, align: 64, elements: !200, templateParams: !284, identifier: "e9ad1bd6432910d9a3eb8c1441038616")
!199 = !DINamespace(name: "pin", scope: !32)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !2, baseType: !202, size: 64, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !203, file: !2, size: 64, align: 64, elements: !205, templateParams: !278, identifier: "fa53fb10d452b801a2c9df37976b7c0f")
!203 = !DINamespace(name: "sync", scope: !204)
!204 = !DINamespace(name: "alloc", scope: null)
!205 = !{!206, !282}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !202, file: !2, baseType: !207, size: 64, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !52, file: !2, size: 64, align: 64, elements: !208, templateParams: !280, identifier: "ca467cef215b0b688cec8b37ff67e3eb")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !207, file: !2, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !211, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !203, file: !2, size: 384, align: 64, elements: !212, templateParams: !278, identifier: "af768f86552c1580b6bad22038e52e6b")
!212 = !{!213, !225, !226}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !211, file: !2, baseType: !214, size: 64, align: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !215, file: !2, size: 64, align: 64, elements: !217, templateParams: !28, identifier: "7ffec6c78d83ad83b9e8e18b9f044e78")
!215 = !DINamespace(name: "atomic", scope: !216)
!216 = !DINamespace(name: "sync", scope: !32)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !214, file: !2, baseType: !219, size: 64, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !220, file: !2, size: 64, align: 64, elements: !221, templateParams: !223, identifier: "1096bf4d22c004093180ac32ada74dc8")
!220 = !DINamespace(name: "cell", scope: !32)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !219, file: !2, baseType: !9, size: 64, align: 64)
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !9)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !211, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !2, baseType: !227, size: 256, align: 64, offset: 128)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !192, file: !2, size: 256, align: 64, elements: !228, templateParams: !28, identifier: "c4cf126348540eb9d47a2569a004f23c")
!228 = !{!229, !253, !262}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !2, baseType: !230, size: 128, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::ffi::c_str::CString>", scope: !231, file: !2, size: 128, align: 64, elements: !232, templateParams: !28, identifier: "11079736a8cf7d01b5081204844afabf")
!231 = !DINamespace(name: "option", scope: !32)
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_variant_part, scope: !230, file: !2, size: 128, align: 64, elements: !234, templateParams: !28, identifier: "24a4f611368b1aaecb2a2d1015a4e208", discriminator: !252)
!234 = !{!235, !248}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !233, file: !2, baseType: !236, size: 128, align: 64, extraData: i64 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !230, file: !2, size: 128, align: 64, elements: !28, templateParams: !237, identifier: "a0925efc4ffffc6b6e6a847eade956da")
!237 = !{!238}
!238 = !DITemplateTypeParameter(name: "T", type: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !240, file: !2, size: 128, align: 64, elements: !242, templateParams: !28, identifier: "a4dcbb113228472ac833458ca2f5ee8d")
!240 = !DINamespace(name: "c_str", scope: !241)
!241 = !DINamespace(name: "ffi", scope: !204)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !239, file: !2, baseType: !244, size: 128, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !245, templateParams: !28, identifier: "e783b0825321c11fc908377d145707b4")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !244, file: !2, baseType: !148, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !244, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !233, file: !2, baseType: !249, size: 128, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !230, file: !2, size: 128, align: 64, elements: !250, templateParams: !237, identifier: "b95ab6a63fa54894b511858e9aa487eb")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !249, file: !2, baseType: !239, size: 128, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !230, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !2, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !192, file: !2, size: 64, align: 64, elements: !255, templateParams: !28, identifier: "14daaba64fc0b725cea71c77b1c0dda0")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !257, size: 64, align: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !258, file: !2, size: 64, align: 64, elements: !260, templateParams: !28, identifier: "c75221714c3cb037594d5c7d9a6076e4")
!258 = !DINamespace(name: "nonzero", scope: !259)
!259 = !DINamespace(name: "num", scope: !32)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !257, file: !2, baseType: !160, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !227, file: !2, baseType: !263, size: 32, align: 32, offset: 192)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !264, file: !2, size: 32, align: 32, elements: !267, templateParams: !28, identifier: "c35d3c03a2fef7c43fe89d6d5817985")
!264 = !DINamespace(name: "futex", scope: !265)
!265 = !DINamespace(name: "thread_parker", scope: !266)
!266 = !DINamespace(name: "sys_common", scope: !18)
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !263, file: !2, baseType: !269, size: 32, align: 32)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !215, file: !2, size: 32, align: 32, elements: !270, templateParams: !28, identifier: "df28c1061f1f509fecdfe447f073fe05")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !269, file: !2, baseType: !272, size: 32, align: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !220, file: !2, size: 32, align: 32, elements: !273, templateParams: !276, identifier: "913c5966f37dcbe528496c11edeecf37")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !2, baseType: !275, size: 32, align: 32)
!275 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!276 = !{!277}
!277 = !DITemplateTypeParameter(name: "T", type: !275)
!278 = !{!279}
!279 = !DITemplateTypeParameter(name: "T", type: !227)
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !211)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !202, file: !2, baseType: !283, align: 8)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !280, identifier: "d5fdc42d9e07c76ff2921be32eeec608")
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "P", type: !202)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "output_capture", scope: !189, file: !2, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !231, file: !2, size: 64, align: 64, elements: !288, templateParams: !28, identifier: "63712b03c48a48b546a99b37b1795ac9")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 64, align: 64, elements: !290, templateParams: !28, identifier: "cea104d8888d652a5ea8270ab215780f", discriminator: !375)
!290 = !{!291, !371}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !289, file: !2, baseType: !292, size: 64, align: 64, extraData: i64 0)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 64, align: 64, elements: !28, templateParams: !293, identifier: "d5ea655bebdffd9d6ccc8e7b72ba2494")
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "T", type: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !203, file: !2, size: 64, align: 64, elements: !296, templateParams: !365, identifier: "2460f30d6622b7eef1e579dc880d78bd")
!296 = !{!297, !369}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !295, file: !2, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !52, file: !2, size: 64, align: 64, elements: !299, templateParams: !367, identifier: "9762843dde224ed9ee9dcfa13338b8ad")
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !298, file: !2, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !302, size: 64, align: 64, dwarfAddressSpace: 0)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !203, file: !2, size: 384, align: 64, elements: !303, templateParams: !365, identifier: "80f642da82ac97e64301b741d3e0cb85")
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !302, file: !2, baseType: !214, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !302, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !2, baseType: !307, size: 256, align: 64, offset: 128)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !308, file: !2, size: 256, align: 64, elements: !310, templateParams: !363, identifier: "d24c7b343d9e4be2f0ee127389e541ea")
!308 = !DINamespace(name: "mutex", scope: !309)
!309 = !DINamespace(name: "sync", scope: !18)
!310 = !{!311, !321, !334}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !307, file: !2, baseType: !312, size: 32, align: 32)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableMutex", scope: !313, file: !2, size: 32, align: 32, elements: !314, templateParams: !28, identifier: "1c5271880f403453e095967f67b3a99a")
!313 = !DINamespace(name: "mutex", scope: !266)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !312, file: !2, baseType: !316, size: 32, align: 32)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !317, file: !2, size: 32, align: 32, elements: !319, templateParams: !28, identifier: "77860dc9701765ad347c5b544e453cfb")
!317 = !DINamespace(name: "futex_mutex", scope: !318)
!318 = !DINamespace(name: "locks", scope: !24)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !316, file: !2, baseType: !269, size: 32, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !307, file: !2, baseType: !322, size: 8, align: 8, offset: 32)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !323, file: !2, size: 8, align: 8, elements: !324, templateParams: !28, identifier: "f0efe752869ac106b25c24d064c5feb7")
!323 = !DINamespace(name: "poison", scope: !309)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !322, file: !2, baseType: !326, size: 8, align: 8)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !215, file: !2, size: 8, align: 8, elements: !327, templateParams: !28, identifier: "18df8ce09b617745af0df8c35407fa0c")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !326, file: !2, baseType: !329, size: 8, align: 8)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !220, file: !2, size: 8, align: 8, elements: !330, templateParams: !332, identifier: "b7b48363b5d13e5be0aac741c1d39baf")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !329, file: !2, baseType: !78, size: 8, align: 8)
!332 = !{!333}
!333 = !DITemplateTypeParameter(name: "T", type: !78)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !2, baseType: !335, size: 192, align: 64, offset: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !220, file: !2, size: 192, align: 64, elements: !336, templateParams: !363, identifier: "27f04b51a7d0a7ef411ab63b89f92cc2")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !335, file: !2, baseType: !338, size: 192, align: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !339, file: !2, size: 192, align: 64, elements: !340, templateParams: !360, identifier: "f48a096c1ed19eb7ba15a7173429013")
!339 = !DINamespace(name: "vec", scope: !204)
!340 = !{!341, !362}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !338, file: !2, baseType: !342, size: 128, align: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !343, file: !2, size: 128, align: 64, elements: !344, templateParams: !360, identifier: "d09dab1a097018b9dd4dad6f3ce84c27")
!343 = !DINamespace(name: "raw_vec", scope: !204)
!344 = !{!345, !356, !357}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !342, file: !2, baseType: !346, size: 64, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !347, file: !2, size: 64, align: 64, elements: !348, templateParams: !332, identifier: "7e72c5db004520f6d0779c7d4ace2142")
!347 = !DINamespace(name: "unique", scope: !53)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !346, file: !2, baseType: !350, size: 64, align: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !52, file: !2, size: 64, align: 64, elements: !351, templateParams: !332, identifier: "3160283ea80cecf6149fff38a2e996de")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !350, file: !2, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !346, file: !2, baseType: !355, align: 8)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !332, identifier: "e338a8151f1037c76eadd10ab3c53972")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !342, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !342, file: !2, baseType: !358, align: 8)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !359, file: !2, align: 8, elements: !28, identifier: "3328ba4994ba07f4a4a3e83fae935932")
!359 = !DINamespace(name: "alloc", scope: !204)
!360 = !{!333, !361}
!361 = !DITemplateTypeParameter(name: "A", type: !358)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !338, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "T", type: !338)
!365 = !{!366}
!366 = !DITemplateTypeParameter(name: "T", type: !307)
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "T", type: !302)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !295, file: !2, baseType: !370, align: 8)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !367, identifier: "73d706133e736839387d803b65b68460")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !289, file: !2, baseType: !372, size: 64, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 64, align: 64, elements: !373, templateParams: !293, identifier: "7602f28f6060b5f6b8d821c8e8098170")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !372, file: !2, baseType: !295, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !189, file: !2, baseType: !377, align: 8)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !378, file: !2, align: 8, elements: !28, identifier: "337e774c9bd960f2bdc08cbeaf16d216")
!378 = !DINamespace(name: "test_thread_locals", scope: !379)
!379 = !DINamespace(name: "test_thread_locals", scope: !380)
!380 = !DINamespace(name: "statics_tests", scope: null)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "their_packet", scope: !189, file: !2, baseType: !382, size: 64, align: 64, offset: 128)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Packet<()>>", scope: !203, file: !2, size: 64, align: 64, elements: !383, templateParams: !492, identifier: "fdd87ae4dce4c1ac57ddb61cdd37959b")
!383 = !{!384, !496}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !382, file: !2, baseType: !385, size: 64, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !52, file: !2, size: 64, align: 64, elements: !386, templateParams: !494, identifier: "a8a4fa2523ad853c9015d56e5a83588a")
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !385, file: !2, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Packet<()>>", baseType: !389, size: 64, align: 64, dwarfAddressSpace: 0)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Packet<()>>", scope: !203, file: !2, size: 384, align: 64, elements: !390, templateParams: !492, identifier: "fd905c0a44a63506f7a9fef2e73fa8a3")
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !389, file: !2, baseType: !214, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !389, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !389, file: !2, baseType: !394, size: 256, align: 64, offset: 128)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<()>", scope: !192, file: !2, size: 256, align: 64, elements: !395, templateParams: !56, identifier: "b0146c8076836b0ac1e0bc617b64c584")
!395 = !{!396, !434, !474}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !394, file: !2, baseType: !397, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::thread::scoped::ScopeData>>", scope: !231, file: !2, size: 64, align: 64, elements: !398, templateParams: !28, identifier: "2139409eff764451bb0726111ad9d39a")
!398 = !{!399}
!399 = !DICompositeType(tag: DW_TAG_variant_part, scope: !397, file: !2, size: 64, align: 64, elements: !400, templateParams: !28, identifier: "54bf56efea14fe2f7463523e5d528e1", discriminator: !433)
!400 = !{!401, !429}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !399, file: !2, baseType: !402, size: 64, align: 64, extraData: i64 0)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !397, file: !2, size: 64, align: 64, elements: !28, templateParams: !403, identifier: "e58bab26a5690860f86d543f88adea7a")
!403 = !{!404}
!404 = !DITemplateTypeParameter(name: "T", type: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::scoped::ScopeData>", scope: !203, file: !2, size: 64, align: 64, elements: !406, templateParams: !423, identifier: "7ed25dde1c11128688f3de0b5a70a958")
!406 = !{!407, !427}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !405, file: !2, baseType: !408, size: 64, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !52, file: !2, size: 64, align: 64, elements: !409, templateParams: !425, identifier: "ff76ffd683af82c79d71270e0bb91fe9")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !408, file: !2, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::scoped::ScopeData>", baseType: !412, size: 64, align: 64, dwarfAddressSpace: 0)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::scoped::ScopeData>", scope: !203, file: !2, size: 320, align: 64, elements: !413, templateParams: !423, identifier: "f2b0c476fed7a2f8d1903b2f6b0485e8")
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !412, file: !2, baseType: !214, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !412, file: !2, baseType: !214, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !412, file: !2, baseType: !417, size: 192, align: 64, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScopeData", scope: !418, file: !2, size: 192, align: 64, elements: !419, templateParams: !28, identifier: "20817ae6ef2c8174d403992a55266850")
!418 = !DINamespace(name: "scoped", scope: !192)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num_running_threads", scope: !417, file: !2, baseType: !214, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "a_thread_panicked", scope: !417, file: !2, baseType: !326, size: 8, align: 8, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "main_thread", scope: !417, file: !2, baseType: !195, size: 64, align: 64, offset: 64)
!423 = !{!424}
!424 = !DITemplateTypeParameter(name: "T", type: !417)
!425 = !{!426}
!426 = !DITemplateTypeParameter(name: "T", type: !412)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !405, file: !2, baseType: !428, align: 8)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !425, identifier: "becf7c1943d341c91d8397d327aff583")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !399, file: !2, baseType: !430, size: 64, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !397, file: !2, size: 64, align: 64, elements: !431, templateParams: !403, identifier: "965bf7244209b910c04e3ac07f4912f")
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !430, file: !2, baseType: !405, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !394, file: !2, baseType: !435, size: 192, align: 64, offset: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>>", scope: !220, file: !2, size: 192, align: 64, elements: !436, templateParams: !472, identifier: "eb7bcfa5ea7b484b75a86311e0a3ebc6")
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !435, file: !2, baseType: !438, size: 192, align: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>", scope: !231, file: !2, size: 192, align: 64, elements: !439, templateParams: !28, identifier: "45598915a4947056ede1d33fc25bcd29")
!439 = !{!440}
!440 = !DICompositeType(tag: DW_TAG_variant_part, scope: !438, file: !2, size: 192, align: 64, elements: !441, templateParams: !28, identifier: "959e3ffd8c1b9a6a71ba2c40617f3c1", discriminator: !471)
!441 = !{!442, !467}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !440, file: !2, baseType: !443, size: 192, align: 64, extraData: i64 0)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !438, file: !2, size: 192, align: 64, elements: !28, templateParams: !444, identifier: "1479da203eecae8328653a2c5856a829")
!444 = !{!445}
!445 = !DITemplateTypeParameter(name: "T", type: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", scope: !31, file: !2, size: 128, align: 64, elements: !447, templateParams: !28, identifier: "ff7327f4f565d57f588d410e9ddea48d")
!447 = !{!448}
!448 = !DICompositeType(tag: DW_TAG_variant_part, scope: !446, file: !2, size: 128, align: 64, elements: !449, templateParams: !28, identifier: "52bcafea47fdc093a89ce382e6a95700", discriminator: !466)
!449 = !{!450, !462}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !448, file: !2, baseType: !451, size: 128, align: 64, extraData: i64 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !446, file: !2, size: 128, align: 64, elements: !452, templateParams: !454, identifier: "4fc298a15573157ccb7e81565fdf9685")
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !451, file: !2, baseType: !7, align: 8)
!454 = !{!41, !455}
!455 = !DITemplateTypeParameter(name: "E", type: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !457, templateParams: !28, identifier: "f0f31b23b3f69bd76438b25fe58ed04b")
!457 = !{!458, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !456, file: !2, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64, dwarfAddressSpace: 0)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !28, identifier: "eca8f7fd02b6d6b94d3c92b23b660554")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !456, file: !2, baseType: !128, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !448, file: !2, baseType: !463, size: 128, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !446, file: !2, size: 128, align: 64, elements: !464, templateParams: !454, identifier: "9346a086afab40dd9cdea7a7983c393c")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !463, file: !2, baseType: !456, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !440, file: !2, baseType: !468, size: 192, align: 64, extraData: i64 1)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !438, file: !2, size: 192, align: 64, elements: !469, templateParams: !444, identifier: "46ac3a8135f8c8504adb7e0fa41963c3")
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !468, file: !2, baseType: !446, size: 128, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !438, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!472 = !{!473}
!473 = !DITemplateTypeParameter(name: "T", type: !438)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !394, file: !2, baseType: !475, align: 8)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<&std::thread::scoped::ScopeData>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !476, identifier: "12437ea3c9bcb4a1e7a9a98423ff8f55")
!476 = !{!477}
!477 = !DITemplateTypeParameter(name: "T", type: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&std::thread::scoped::ScopeData>", scope: !231, file: !2, size: 64, align: 64, elements: !479, templateParams: !28, identifier: "2ee0ef21be33b12734ae04baafe5b2")
!479 = !{!480}
!480 = !DICompositeType(tag: DW_TAG_variant_part, scope: !478, file: !2, size: 64, align: 64, elements: !481, templateParams: !28, identifier: "2c9b859780c74ee98f47446212114488", discriminator: !491)
!481 = !{!482, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !480, file: !2, baseType: !483, size: 64, align: 64, extraData: i64 0)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !478, file: !2, size: 64, align: 64, elements: !28, templateParams: !484, identifier: "197c888836267348d2be0b6d5f4c3de8")
!484 = !{!485}
!485 = !DITemplateTypeParameter(name: "T", type: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::thread::scoped::ScopeData", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !480, file: !2, baseType: !488, size: 64, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !478, file: !2, size: 64, align: 64, elements: !489, templateParams: !484, identifier: "aa8e6829f1d653aa7f31126bfcf44711")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !488, file: !2, baseType: !486, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, scope: !478, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!492 = !{!493}
!493 = !DITemplateTypeParameter(name: "T", type: !394)
!494 = !{!495}
!495 = !DITemplateTypeParameter(name: "T", type: !389)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !382, file: !2, baseType: !497, align: 8)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !59, file: !2, align: 8, elements: !28, templateParams: !494, identifier: "ee4f7ed6b2d764b85c60519183fd7c51")
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "<&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !501, vtableHolder: !508, templateParams: !28, identifier: "2debe91a3ced6dbdaf96e0d69977a443")
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !500, file: !2, baseType: !6, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !500, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !500, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !500, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !500, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !500, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !512, vtableHolder: !517, templateParams: !28, identifier: "e41da7ed75ed4863791811c5b4f5fafa")
!512 = !{!513, !514, !515, !516}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !511, file: !2, baseType: !6, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !511, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !511, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !521, vtableHolder: !43, templateParams: !28, identifier: "5524bda69378138df0eaa44a0fa62936")
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !520, file: !2, baseType: !6, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !520, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !520, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !520, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !529, vtableHolder: !534, templateParams: !28, identifier: "1b870bd9431ccc1d71adabe14fa4d734")
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !528, file: !2, baseType: !6, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !528, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !528, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !528, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !240, file: !2, size: 256, align: 64, elements: !535, templateParams: !28, identifier: "f0b155880f0e8602fd0be3023df941a4")
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !534, file: !2, baseType: !9, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !534, file: !2, baseType: !338, size: 192, align: 64, offset: 64)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "<alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !541, vtableHolder: !456, templateParams: !28, identifier: "2e8fbfd9211dac47eeee6b9a0e4bcd21")
!541 = !{!542, !543, !544, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !540, file: !2, baseType: !6, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !540, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !540, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !540, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "<&f32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&f32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !549, vtableHolder: !554, templateParams: !28, identifier: "167dd032769a3561d40fd3e6fbb4e28f")
!549 = !{!550, !551, !552, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !548, file: !2, baseType: !6, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !548, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !548, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !548, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !555, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "<&[i32; 11] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 11] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !559, vtableHolder: !564, templateParams: !28, identifier: "93161247c3c0435d6a9ea9d97cf3ab43")
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !558, file: !2, baseType: !6, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !558, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !558, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !558, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 11]", baseType: !565, size: 64, align: 64, dwarfAddressSpace: 0)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 352, align: 32, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 11, lowerBound: 0)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !571, vtableHolder: !576, templateParams: !28, identifier: "56f3ae9cd35b4a6d41c32c0359fd0048")
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !570, file: !2, baseType: !6, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !570, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !570, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !570, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !275, size: 64, align: 64, dwarfAddressSpace: 0)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "<&[i32; 16] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[i32; 16] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !580, vtableHolder: !585, templateParams: !28, identifier: "dcf34fa946d9628428fdab0b05413c16")
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !579, file: !2, baseType: !6, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !579, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !579, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[i32; 16]", baseType: !586, size: 64, align: 64, dwarfAddressSpace: 0)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, align: 32, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 16, lowerBound: 0)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "rust_gssi", linkageName: "_ZN13statics_tests13thread_locals9rust_gssi17ha42a983c30fd17ceE", scope: !591, file: !592, line: 16, type: !70, isLocal: true, isDefinition: true, align: 32)
!591 = !DINamespace(name: "thread_locals", scope: !380)
!592 = !DIFile(filename: "src/thread_locals.rs", directory: "/home/calvin/git/c2rust/tests/statics", checksumkind: CSK_MD5, checksum: "cd391bc1d5902258e41f853032563abd")
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "rust_gsti", linkageName: "_ZN13statics_tests13thread_locals9rust_gsti17h8c6e37da93ad1f39E", scope: !591, file: !592, line: 18, type: !70, isLocal: true, isDefinition: true, align: 32)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "rust_fssi", linkageName: "_ZN13statics_tests13thread_locals17rust_thread_entry9rust_fssi17hd080597f2f0eb4e3E", scope: !597, file: !592, line: 27, type: !70, isLocal: true, isDefinition: true, align: 32)
!597 = !DINamespace(name: "rust_thread_entry", scope: !591)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "rust_fsti", linkageName: "_ZN13statics_tests13thread_locals17rust_thread_entry9rust_fsti17hfed40b6f8f57ce71E", scope: !597, file: !592, line: 32, type: !70, isLocal: true, isDefinition: true, align: 32)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "rust_params", scope: !602, file: !603, line: 36, type: !604, isLocal: false, isDefinition: true, align: 32)
!602 = !DINamespace(name: "sections", scope: !380)
!603 = !DIFile(filename: "src/sections.rs", directory: "/home/calvin/git/c2rust/tests/statics", checksumkind: CSK_MD5, checksum: "60c06af74b7303a7a3c05de6c400bc5c")
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 192, align: 32, elements: !610)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Foo", scope: !602, file: !2, size: 96, align: 32, elements: !606, templateParams: !28, identifier: "9ad07ad48b9a18964dc1cd3dd0f3e53f")
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !605, file: !2, baseType: !275, size: 32, align: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !605, file: !2, baseType: !70, size: 32, align: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !605, file: !2, baseType: !555, size: 32, align: 32, offset: 64)
!610 = !{!611}
!611 = !DISubrange(count: 2, lowerBound: 0)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "rust_dont_section_a", scope: !602, file: !603, line: 55, type: !70, isLocal: false, isDefinition: true, align: 32)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "rust_dont_section_b", scope: !602, file: !603, line: 57, type: !70, isLocal: false, isDefinition: true, align: 32)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "rust_dont_section_c", scope: !602, file: !603, line: 59, type: !618, isLocal: false, isDefinition: true, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i32", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "rust_dont_section_d", scope: !602, file: !603, line: 63, type: !618, isLocal: false, isDefinition: true, align: 64)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "rust_dont_section_foo", scope: !602, file: !603, line: 68, type: !605, isLocal: false, isDefinition: true, align: 32)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "rust_dont_section_me", scope: !602, file: !603, line: 70, type: !275, isLocal: false, isDefinition: true, align: 32)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "rust_bar", scope: !602, file: !603, line: 73, type: !627, isLocal: false, isDefinition: true, align: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bar", scope: !602, file: !2, size: 64, align: 64, elements: !628, templateParams: !28, identifier: "efa2886fa8785d90fe647da8d1b9c00f")
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bar", scope: !627, file: !2, baseType: !618, size: 64, align: 64)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "rust_int_to_pointer", scope: !602, file: !603, line: 77, type: !632, isLocal: false, isDefinition: true, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !633, size: 64, align: 64, dwarfAddressSpace: 0)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !634, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !635)
!634 = !DINamespace(name: "ffi", scope: !32)
!635 = !{!636, !637}
!636 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!637 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "rust_null_to_ptr_ty", scope: !602, file: !603, line: 81, type: !160, isLocal: false, isDefinition: true, align: 64)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "rust_section_me", scope: !602, file: !603, line: 83, type: !275, isLocal: false, isDefinition: true, align: 32)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "rust_section_me2", scope: !602, file: !603, line: 85, type: !70, isLocal: false, isDefinition: true, align: 32)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "rust_section_me3", scope: !602, file: !603, line: 87, type: !275, isLocal: false, isDefinition: true, align: 32)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "rust_section_me4", scope: !602, file: !603, line: 89, type: !275, isLocal: false, isDefinition: true, align: 32)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "rust_section_me5", scope: !602, file: !603, line: 91, type: !275, isLocal: false, isDefinition: true, align: 32)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "rust_section_foo_b_field", scope: !602, file: !603, line: 93, type: !605, isLocal: false, isDefinition: true, align: 32)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "rust_section_num_params", scope: !602, file: !603, line: 95, type: !275, isLocal: false, isDefinition: true, align: 32)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "rust_if_expr", scope: !602, file: !603, line: 97, type: !160, isLocal: false, isDefinition: true, align: 64)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "rust_s", scope: !602, file: !603, line: 99, type: !658, isLocal: false, isDefinition: true, align: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", scope: !602, file: !2, size: 64, align: 64, elements: !659, templateParams: !28, identifier: "3c664c647a4c1e91bda6cd847a2474f8")
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !658, file: !2, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut i32", baseType: !618, size: 64, align: 64, dwarfAddressSpace: 0)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "rust_s2", scope: !602, file: !603, line: 103, type: !664, isLocal: false, isDefinition: true, align: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat2", scope: !602, file: !2, size: 64, align: 64, elements: !665, templateParams: !28, identifier: "93ab5a07359007639e1810ed6b6e9a8")
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !664, file: !2, baseType: !618, size: 64, align: 64)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "rust_int_to_fn_ptr", scope: !602, file: !603, line: 107, type: !669, isLocal: false, isDefinition: true, align: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn()>", scope: !231, file: !2, size: 64, align: 64, elements: !670, templateParams: !28, identifier: "56185c42dbbd8d93ae6e42c26d54f356")
!670 = !{!671}
!671 = !DICompositeType(tag: DW_TAG_variant_part, scope: !669, file: !2, size: 64, align: 64, elements: !672, templateParams: !28, identifier: "d0de43b7bc6ed01c82a002c1a646e119", discriminator: !682)
!672 = !{!673, !678}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !671, file: !2, baseType: !674, size: 64, align: 64, extraData: i64 0)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !669, file: !2, size: 64, align: 64, elements: !28, templateParams: !675, identifier: "4e80b015fd961ee5af3a668479d55524")
!675 = !{!676}
!676 = !DITemplateTypeParameter(name: "T", type: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn()", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !671, file: !2, baseType: !679, size: 64, align: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !669, file: !2, size: 64, align: 64, elements: !680, templateParams: !675, identifier: "9789a6fe10048157e51a215fa06e8d23")
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !679, file: !2, baseType: !677, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !669, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "rust_int_to_fn_ptr2", scope: !602, file: !603, line: 109, type: !685, isLocal: false, isDefinition: true, align: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(i32, ...)>", scope: !231, file: !2, size: 64, align: 64, elements: !686, templateParams: !28, identifier: "74473353eec75e89b8225c6ac10dde2d")
!686 = !{!687}
!687 = !DICompositeType(tag: DW_TAG_variant_part, scope: !685, file: !2, size: 64, align: 64, elements: !688, templateParams: !28, identifier: "37b8fa4fdd51250978926e663ce2207f", discriminator: !700)
!688 = !{!689, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !687, file: !2, baseType: !690, size: 64, align: 64, extraData: i64 0)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !685, file: !2, size: 64, align: 64, elements: !28, templateParams: !691, identifier: "b57fb6dc6233a440d2713dc8b1170e23")
!691 = !{!692}
!692 = !DITemplateTypeParameter(name: "T", type: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(i32, ...)", baseType: !694, size: 64, align: 64, dwarfAddressSpace: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !70}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !687, file: !2, baseType: !697, size: 64, align: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !685, file: !2, size: 64, align: 64, elements: !698, templateParams: !691, identifier: "9c7504d99f323bc6232704883dfa4818")
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !697, file: !2, baseType: !693, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, scope: !685, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagArtificial)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "rust_int_to_fn_ptr3", scope: !602, file: !603, line: 113, type: !669, isLocal: false, isDefinition: true, align: 64)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "rust_sectioned_scoped_init", linkageName: "_ZN13statics_tests8sections26rust_sectioned_scoped_init17h8d245479008eab85E", scope: !602, file: !603, line: 114, type: !160, isLocal: true, isDefinition: true, align: 64)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "rust_not_sectioned", linkageName: "_ZN13statics_tests8sections26rust_fn_scoped_static_init18rust_not_sectioned17hbdf5c484f106ab02E", scope: !707, file: !603, line: 121, type: !275, isLocal: true, isDefinition: true, align: 32)
!707 = !DINamespace(name: "rust_fn_scoped_static_init", scope: !602)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "rust_fn_scoped_extern", scope: !602, file: !603, line: 128, type: !160, isLocal: false, isDefinition: true, align: 64)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "rust_sectioned_array", linkageName: "_ZN13statics_tests8sections20rust_sectioned_array17h1e43ae8f57627000E", scope: !602, file: !603, line: 129, type: !712, isLocal: true, isDefinition: true, align: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, align: 64, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 1, lowerBound: 0)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "INIT_ARRAY", linkageName: "_ZN13statics_tests8sections10INIT_ARRAY17h99c3ca5e85ae4ca0E", scope: !602, file: !603, line: 193, type: !717, isLocal: true, isDefinition: true, align: 64)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 64, align: 64, elements: !713)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "gesi", scope: !379, file: !720, line: 13, type: !275, isLocal: false, isDefinition: true, align: 32)
!720 = !DIFile(filename: "src/test_thread_locals.rs", directory: "/home/calvin/git/c2rust/tests/statics", checksumkind: CSK_MD5, checksum: "2adc41383d45fad3662ebc1e6cb2b16d")
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "rust_gesi", scope: !379, file: !720, line: 15, type: !275, isLocal: false, isDefinition: true, align: 32)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "fesi", scope: !379, file: !720, line: 17, type: !275, isLocal: false, isDefinition: true, align: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "rust_fesi", scope: !379, file: !720, line: 19, type: !275, isLocal: false, isDefinition: true, align: 32)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "geti", scope: !379, file: !720, line: 22, type: !275, isLocal: false, isDefinition: true, align: 32)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "rust_geti", scope: !379, file: !720, line: 25, type: !275, isLocal: false, isDefinition: true, align: 32)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "feti", scope: !379, file: !720, line: 28, type: !275, isLocal: false, isDefinition: true, align: 32)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "rust_feti", scope: !379, file: !720, line: 31, type: !275, isLocal: false, isDefinition: true, align: 32)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "rust_used_static", scope: !737, file: !738, line: 17, type: !70, isLocal: false, isDefinition: true, align: 32)
!737 = !DINamespace(name: "attributes", scope: !380)
!738 = !DIFile(filename: "src/attributes.rs", directory: "/home/calvin/git/c2rust/tests/statics", checksumkind: CSK_MD5, checksum: "483571ba4bb14af3341ea906d3627900")
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "rust_used_static2", scope: !737, file: !738, line: 21, type: !70, isLocal: false, isDefinition: true, align: 32)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "rust_used_static4", linkageName: "_ZN13statics_tests10attributes17rust_used_static417hc073714b54728f09E", scope: !737, file: !738, line: 24, type: !70, isLocal: true, isDefinition: true, align: 32)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "rust_used_static3", scope: !737, file: !738, line: 28, type: !70, isLocal: false, isDefinition: true, align: 32)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "rust_no_attrs", scope: !737, file: !738, line: 30, type: !70, isLocal: false, isDefinition: true, align: 32)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "rust_initialized_extern", scope: !737, file: !738, line: 33, type: !70, isLocal: false, isDefinition: true, align: 32)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "INIT_ARRAY", linkageName: "_ZN13statics_tests10attributes10INIT_ARRAY17h5f9cd6bf7e743198E", scope: !737, file: !738, line: 42, type: !717, isLocal: true, isDefinition: true, align: 64)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "rust_visible_everywhere", scope: !753, file: !754, line: 22, type: !70, isLocal: false, isDefinition: true, align: 32)
!753 = !DINamespace(name: "storage", scope: !380)
!754 = !DIFile(filename: "src/storage.rs", directory: "/home/calvin/git/c2rust/tests/statics", checksumkind: CSK_MD5, checksum: "c48d7370d08d41b263ffcf475eefbe82")
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "rust_counter", linkageName: "_ZN13statics_tests7storage12rust_counter17he98b1991b3a2a6e9E", scope: !753, file: !754, line: 23, type: !70, isLocal: true, isDefinition: true, align: 32)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "rust_k", linkageName: "_ZN13statics_tests7storage8rust_baz6rust_k17h896fedec22886b3eE", scope: !759, file: !754, line: 25, type: !70, isLocal: true, isDefinition: true, align: 32)
!759 = !DINamespace(name: "rust_baz", scope: !753)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "rust_hello", linkageName: "_ZN13statics_tests7storage10rust_hello17h3904f6f05287022dE", scope: !753, file: !754, line: 30, type: !762, isLocal: true, isDefinition: true, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !763, size: 64, align: 64, dwarfAddressSpace: 0)
!763 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "rust_world", linkageName: "_ZN13statics_tests7storage10rust_entry10rust_world17he2f89ceb8d536c35E", scope: !766, file: !754, line: 40, type: !762, isLocal: true, isDefinition: true, align: 64)
!766 = !DINamespace(name: "rust_entry", scope: !753)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "rust_Foo", linkageName: "_ZN13statics_tests7storage10rust_entry8rust_Foo17h34d66082d6db67beE", scope: !766, file: !754, line: 42, type: !769, isLocal: true, isDefinition: true, align: 8)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "StringStruct", scope: !753, file: !2, size: 24, align: 8, elements: !770, templateParams: !28, identifier: "67dacea366ce22dd80837b7c53942b70")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !769, file: !2, baseType: !772, size: 24, align: 8)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 24, align: 8, elements: !130)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "rust_Bar", linkageName: "_ZN13statics_tests7storage10rust_entry8rust_Bar17h1b7bb100cb6d99cfE", scope: !766, file: !754, line: 53, type: !775, isLocal: true, isDefinition: true, align: 32)
!775 = !DICompositeType(tag: DW_TAG_union_type, name: "StringUnion", scope: !753, file: !2, size: 32, align: 32, elements: !776, templateParams: !28, identifier: "52a4ab081b8b0022f60e10cc921ff885")
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !775, file: !2, baseType: !772, size: 24, align: 8)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !2, baseType: !70, size: 32, align: 32)
!779 = !{i32 7, !"PIC Level", i32 2}
!780 = !{i32 7, !"PIE Level", i32 2}
!781 = !{i32 2, !"RtLibUseGOT", i32 1}
!782 = !{i32 2, !"Dwarf Version", i32 4}
!783 = !{i32 2, !"Debug Info Version", i32 3}
!784 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !785, producer: "clang LLVM (rustc version 1.65.0-nightly (d394408fb 2022-08-07))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !786, globals: !887)
!785 = !DIFile(filename: "src/lib.rs/@/zf7m485wsz09ju", directory: "/home/calvin/git/c2rust/tests/statics")
!786 = !{!787, !77, !855, !864, !870, !877, !883, !633}
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValidAlignEnum64", scope: !788, file: !2, baseType: !160, size: 64, align: 64, flags: DIFlagEnumClass, elements: !790)
!788 = !DINamespace(name: "valid_align", scope: !789)
!789 = !DINamespace(name: "mem", scope: !32)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!791 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!792 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!793 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!794 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!795 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!796 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!797 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!798 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!799 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!800 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!801 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!802 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!803 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!804 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!805 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!806 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!807 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!808 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!809 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!810 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!811 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!812 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!813 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!814 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!815 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!816 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!817 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!818 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!819 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!820 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!821 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!822 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!823 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!824 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!825 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!826 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!827 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!828 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!829 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!830 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!831 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!832 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!833 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!834 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!835 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!836 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!837 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!838 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!839 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!840 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!841 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!842 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!843 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!844 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!845 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!846 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!847 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!848 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!849 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!850 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!851 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!852 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!853 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!854 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !856, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !859)
!856 = !DINamespace(name: "v1", scope: !857)
!857 = !DINamespace(name: "rt", scope: !858)
!858 = !DINamespace(name: "fmt", scope: !32)
!859 = !{!860, !861, !862, !863}
!860 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!861 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!862 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!863 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !865, file: !2, baseType: !763, size: 8, align: 8, flags: DIFlagEnumClass, elements: !866)
!865 = !DINamespace(name: "cmp", scope: !32)
!866 = !{!867, !868, !869}
!867 = !DIEnumerator(name: "Less", value: 255)
!868 = !DIEnumerator(name: "Equal", value: 0)
!869 = !DIEnumerator(name: "Greater", value: 1)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !215, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !871)
!871 = !{!872, !873, !874, !875, !876}
!872 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!873 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!874 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!875 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!876 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !878, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !879)
!878 = !DINamespace(name: "panicking", scope: !32)
!879 = !{!880, !881, !882}
!880 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!881 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!882 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !343, file: !2, baseType: !78, size: 8, align: 8, flags: DIFlagEnumClass, elements: !884)
!884 = !{!885, !886}
!885 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!886 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!887 = !{!0, !163, !181, !498, !509, !518, !526, !538, !546, !556, !568, !577, !589, !593, !595, !598, !600, !612, !614, !616, !619, !621, !623, !625, !630, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !662, !667, !683, !701, !703, !705, !708, !710, !715, !718, !721, !723, !725, !727, !729, !731, !733, !735, !739, !741, !743, !745, !747, !749, !751, !755, !757, !760, !764, !767, !773}
!888 = distinct !DISubprogram(name: "get_unchecked<u8>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h5f751f0d5c54b054E", scope: !890, file: !889, line: 278, type: !893, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !784, templateParams: !332, retainedNodes: !907)
!889 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "22a04328eca3d78fd2bf5357f9150928")
!890 = !DINamespace(name: "{impl#3}", scope: !891)
!891 = !DINamespace(name: "index", scope: !892)
!892 = !DINamespace(name: "slice", scope: !32)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !899, !895}
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !896, templateParams: !28, identifier: "7b54d414f2f329e57c9aa3e4ca07f4")
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !895, file: !2, baseType: !148, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !895, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !900, file: !2, size: 128, align: 64, elements: !902, templateParams: !905, identifier: "855eb37746b15049ea4556b174e97dd7")
!900 = !DINamespace(name: "range", scope: !901)
!901 = !DINamespace(name: "ops", scope: !32)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !899, file: !2, baseType: !9, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !899, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!905 = !{!906}
!906 = !DITemplateTypeParameter(name: "Idx", type: !9)
!907 = !{!908, !909, !910}
!908 = !DILocalVariable(name: "self", arg: 1, scope: !888, file: !889, line: 278, type: !899)
!909 = !DILocalVariable(name: "slice", arg: 2, scope: !888, file: !889, line: 278, type: !895)
!910 = !DILocalVariable(name: "runtime", scope: !911, file: !889, line: 285, type: !914, align: 8)
!911 = !DILexicalBlockFile(scope: !912, file: !889, discriminator: 0)
!912 = distinct !DILexicalBlock(scope: !888, file: !913, line: 2336, column: 13)
!913 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "f96ba730d7cf23ae45fdc72e7caf5f1b")
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<u8>", scope: !915, file: !2, size: 192, align: 64, elements: !916, templateParams: !28, identifier: "3899877b232b8d576af2a125fa395e55")
!915 = !DINamespace(name: "get_unchecked", scope: !890)
!916 = !{!917, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__start", scope: !914, file: !2, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self__end", scope: !914, file: !2, baseType: !918, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__slice", scope: !914, file: !2, baseType: !921, size: 64, align: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const [u8]", baseType: !895, size: 64, align: 64, dwarfAddressSpace: 0)
!922 = !DILocation(line: 278, column: 29, scope: !888)
!923 = !DILocation(line: 278, column: 35, scope: !888)
!924 = !DILocation(line: 285, column: 13, scope: !911)
!925 = !DILocation(line: 286, column: 39, scope: !888)
!926 = !DILocalVariable(name: "self", scope: !927, file: !889, line: 286, type: !895, align: 8)
!927 = !DILexicalBlockFile(scope: !928, file: !889, discriminator: 0)
!928 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr9const_ptr43_$LT$impl$u20$$BP$const$u20$$u5b$T$u5d$$GT$6as_ptr17h1088b55685155f31E", scope: !930, file: !929, line: 1385, type: !932, scopeLine: 1385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !784, templateParams: !332, retainedNodes: !934)
!929 = !DIFile(filename: "/rustc/d394408fb38c4de61f765a3ed5189d2731a1da91/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "1874e43cb83f8af3048974827047cb9c")
!930 = !DINamespace(name: "{impl#1}", scope: !931)
!931 = !DINamespace(name: "const_ptr", scope: !53)
!932 = !DISubroutineType(types: !933)
!933 = !{!353, !895}
!934 = !{!926}
!935 = !DILocation(line: 286, column: 39, scope: !927, inlinedAt: !925)
!936 = !DILocalVariable(name: "self", scope: !937, file: !889, line: 286, type: !353, align: 8)
